betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f417xx.h
/* Legacy defines */
#define SRAM_BASE             SRAM1_BASE
#define SRAM_BB_BASE          SRAM1_BB_BASE

/*!< Peripheral memory map */
#define APB1PERIPH_BASE       PERIPH_BASE
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000UL)
#define AHB1PERIPH_BASE       (PERIPH_BASE + 0x00020000UL)
#define AHB2PERIPH_BASE       (PERIPH_BASE + 0x10000000UL)

/*!< APB1 peripherals */
#define TMR2_BASE             (APB1PERIPH_BASE + 0x0000UL)
#define TMR3_BASE             (APB1PERIPH_BASE + 0x0400UL)
#define TMR4_BASE             (APB1PERIPH_BASE + 0x0800UL)
#define TMR5_BASE             (APB1PERIPH_BASE + 0x0C00UL)
#define TMR6_BASE             (APB1PERIPH_BASE + 0x1000UL)
#define TMR7_BASE             (APB1PERIPH_BASE + 0x1400UL)
#define TMR12_BASE            (APB1PERIPH_BASE + 0x1800UL)
#define TMR13_BASE            (APB1PERIPH_BASE + 0x1C00UL)
#define TMR14_BASE            (APB1PERIPH_BASE + 0x2000UL)
#define RTC_BASE              (APB1PERIPH_BASE + 0x2800UL)
#define WWDT_BASE             (APB1PERIPH_BASE + 0x2C00UL)
#define IWDT_BASE             (APB1PERIPH_BASE + 0x3000UL)
#define I2S2ext_BASE          (APB1PERIPH_BASE + 0x3400UL)
#define SPI2_BASE             (APB1PERIPH_BASE + 0x3800UL)
#define SPI3_BASE             (APB1PERIPH_BASE + 0x3C00UL)
#define I2S3ext_BASE          (APB1PERIPH_BASE + 0x4000UL)
#define USART2_BASE           (APB1PERIPH_BASE + 0x4400UL)
#define USART3_BASE           (APB1PERIPH_BASE + 0x4800UL)
#define UART4_BASE            (APB1PERIPH_BASE + 0x4C00UL)
#define UART5_BASE            (APB1PERIPH_BASE + 0x5000UL)
#define I2C1_BASE             (APB1PERIPH_BASE + 0x5400UL)
#define I2C2_BASE             (APB1PERIPH_BASE + 0x5800UL)
#define I2C3_BASE             (APB1PERIPH_BASE + 0x5C00UL)
#define CAN1_BASE             (APB1PERIPH_BASE + 0x6400UL)
#define CAN2_BASE             (APB1PERIPH_BASE + 0x6800UL)
#define PMU_BASE              (APB1PERIPH_BASE + 0x7000UL)
#define DAC_BASE              (APB1PERIPH_BASE + 0x7400UL)

/*!< APB2 peripherals */
#define TMR1_BASE             (APB2PERIPH_BASE + 0x0000UL)
#define TMR8_BASE             (APB2PERIPH_BASE + 0x0400UL)
#define USART1_BASE           (APB2PERIPH_BASE + 0x1000UL)
#define USART6_BASE           (APB2PERIPH_BASE + 0x1400UL)
#define ADC1_BASE             (APB2PERIPH_BASE + 0x2000UL)
#define ADC2_BASE             (APB2PERIPH_BASE + 0x2100UL)
#define ADC3_BASE             (APB2PERIPH_BASE + 0x2200UL)
#define ADC123_COMMON_BASE    (APB2PERIPH_BASE + 0x2300UL)
/* Legacy define */
#define ADC_BASE               ADC123_COMMON_BASE
#define SDIO_BASE             (APB2PERIPH_BASE + 0x2C00UL)
#define SPI1_BASE             (APB2PERIPH_BASE + 0x3000UL)
#define SYSCFG_BASE           (APB2PERIPH_BASE + 0x3800UL)
#define EINT_BASE             (APB2PERIPH_BASE + 0x3C00UL)
#define TMR9_BASE             (APB2PERIPH_BASE + 0x4000UL)
#define TMR10_BASE            (APB2PERIPH_BASE + 0x4400UL)
#define TMR11_BASE            (APB2PERIPH_BASE + 0x4800UL)

/*!< AHB1 peripherals */
#define GPIOA_BASE            (AHB1PERIPH_BASE + 0x0000UL)
#define GPIOB_BASE            (AHB1PERIPH_BASE + 0x0400UL)
#define GPIOC_BASE            (AHB1PERIPH_BASE + 0x0800UL)
#define GPIOD_BASE            (AHB1PERIPH_BASE + 0x0C00UL)
#define GPIOE_BASE            (AHB1PERIPH_BASE + 0x1000UL)
#define GPIOF_BASE            (AHB1PERIPH_BASE + 0x1400UL)
#define GPIOG_BASE            (AHB1PERIPH_BASE + 0x1800UL)
#define GPIOH_BASE            (AHB1PERIPH_BASE + 0x1C00UL)
#define GPIOI_BASE            (AHB1PERIPH_BASE + 0x2000UL)
#define CRC_BASE              (AHB1PERIPH_BASE + 0x3000UL)
#define RCM_BASE              (AHB1PERIPH_BASE + 0x3800UL)
#define FLASH_R_BASE          (AHB1PERIPH_BASE + 0x3C00UL)
#define DMA1_BASE             (AHB1PERIPH_BASE + 0x6000UL)
#define DMA1_Stream0_BASE     (DMA1_BASE + 0x010UL)
#define DMA1_Stream1_BASE     (DMA1_BASE + 0x028UL)
#define DMA1_Stream2_BASE     (DMA1_BASE + 0x040UL)
#define DMA1_Stream3_BASE     (DMA1_BASE + 0x058UL)
#define DMA1_Stream4_BASE     (DMA1_BASE + 0x070UL)
#define DMA1_Stream5_BASE     (DMA1_BASE + 0x088UL)
#define DMA1_Stream6_BASE     (DMA1_BASE + 0x0A0UL)
#define DMA1_Stream7_BASE     (DMA1_BASE + 0x0B8UL)
#define DMA2_BASE             (AHB1PERIPH_BASE + 0x6400UL)
#define DMA2_Stream0_BASE     (DMA2_BASE + 0x010UL)
#define DMA2_Stream1_BASE     (DMA2_BASE + 0x028UL)
#define DMA2_Stream2_BASE     (DMA2_BASE + 0x040UL)
#define DMA2_Stream3_BASE     (DMA2_BASE + 0x058UL)
#define DMA2_Stream4_BASE     (DMA2_BASE + 0x070UL)
#define DMA2_Stream5_BASE     (DMA2_BASE + 0x088UL)
#define DMA2_Stream6_BASE     (DMA2_BASE + 0x0A0UL)
#define DMA2_Stream7_BASE     (DMA2_BASE + 0x0B8UL)
#define ETH_BASE              (AHB1PERIPH_BASE + 0x8000UL)
#define ETH_MAC_BASE          (ETH_BASE)
#define ETH_MMC_BASE          (ETH_BASE + 0x0100UL)
#define ETH_PTP_BASE          (ETH_BASE + 0x0700UL)
#define ETH_DMA_BASE          (ETH_BASE + 0x1000UL)

/*!< AHB2 peripherals */
#define DCI_BASE             (AHB2PERIPH_BASE + 0x50000UL)
#define CRYP_BASE             (AHB2PERIPH_BASE + 0x60000UL)
#define HASH_BASE             (AHB2PERIPH_BASE + 0x60400UL)
#define HASH_DIGEST_BASE      (AHB2PERIPH_BASE + 0x60710UL)
#define RNG_BASE              (AHB2PERIPH_BASE + 0x60800UL)

/*!< SMC Bankx registers base address */
#define SMC_Bank1_R_BASE     (SMC_R_BASE + 0x0000UL)
#define SMC_Bank1E_R_BASE    (SMC_R_BASE + 0x0104UL)
#define SMC_Bank2_3_R_BASE   (SMC_R_BASE + 0x0060UL)
#define SMC_Bank4_R_BASE     (SMC_R_BASE + 0x00A0UL)

/*!< DMC registers base address */
#define DMC_BASE             ((uint32_t)0xA0000000UL)

/*!< Debug MCU registers base address */
#define DBGMCU_BASE           0xE0042000UL
/*!< USB registers base address */
#define USB_OTG_HS2_PERIPH_BASE              0x40040200UL
#define USB_OTG_HS_PERIPH_BASE               0x40040000UL
#define USB_OTG_FS_PERIPH_BASE               0x50000000UL

#define USB_OTG_GLOBAL_BASE                  0x000UL
#define USB_OTG_DEVICE_BASE                  0x800UL
#define USB_OTG_IN_ENDPOINT_BASE             0x900UL
#define USB_OTG_OUT_ENDPOINT_BASE            0xB00UL
#define USB_OTG_EP_REG_SIZE                  0x20UL
#define USB_OTG_HOST_BASE                    0x400UL
#define USB_OTG_HOST_PORT_BASE               0x440UL
#define USB_OTG_HOST_CHANNEL_BASE            0x500UL
#define USB_OTG_HOST_CHANNEL_SIZE            0x20UL
#define USB_OTG_PCGCCTL_BASE                 0xE00UL
#define USB_OTG_FIFO_BASE                    0x1000UL
#define USB_OTG_FIFO_SIZE                    0x1000UL

#define UID_BASE                     0x1FFF7A10UL           /*!< Unique device ID register base address */
#define FLASHSIZE_BASE               0x1FFF7A22UL           /*!< FLASH Size register base address       */
#define PACKAGE_BASE                 0x1FFF7BF0UL           /*!< Package size register base address     */
/**
  * @}
  */

/** @addtogroup Peripheral_declaration
  * @{
  */
#define TMR2                ((TMR_TypeDef *) TMR2_BASE)
#define TMR3                ((TMR_TypeDef *) TMR3_BASE)
#define TMR4                ((TMR_TypeDef *) TMR4_BASE)
#define TMR5                ((TMR_TypeDef *) TMR5_BASE)
#define TMR6                ((TMR_TypeDef *) TMR6_BASE)
#define TMR7                ((TMR_TypeDef *) TMR7_BASE)
#define TMR12               ((TMR_TypeDef *) TMR12_BASE)
#define TMR13               ((TMR_TypeDef *) TMR13_BASE)
#define TMR14               ((TMR_TypeDef *) TMR14_BASE)
#define RTC                 ((RTC_TypeDef *) RTC_BASE)
#define WWDT                ((WWDT_TypeDef *) WWDT_BASE)
#define IWDT                ((IWDT_TypeDef *) IWDT_BASE)
#define I2S2ext             ((SPI_TypeDef *) I2S2ext_BASE)
#define SPI2                ((SPI_TypeDef *) SPI2_BASE)
#define SPI3                ((SPI_TypeDef *) SPI3_BASE)
#define I2S3ext             ((SPI_TypeDef *) I2S3ext_BASE)
#define USART2              ((USART_TypeDef *) USART2_BASE)
#define USART3              ((USART_TypeDef *) USART3_BASE)
#define UART4               ((USART_TypeDef *) UART4_BASE)
#define UART5               ((USART_TypeDef *) UART5_BASE)
#define I2C1                ((I2C_TypeDef *) I2C1_BASE)
#define I2C2                ((I2C_TypeDef *) I2C2_BASE)
#define I2C3                ((I2C_TypeDef *) I2C3_BASE)
#define CAN1                ((CAN_TypeDef *) CAN1_BASE)
#define CAN2                ((CAN_TypeDef *) CAN2_BASE)
#define PMU                 ((PMU_TypeDef *) PMU_BASE)
#define DAC1                ((DAC_TypeDef *) DAC_BASE)
#define DAC                 ((DAC_TypeDef *) DAC_BASE) /* Kept for legacy purpose */
#define TMR1                ((TMR_TypeDef *) TMR1_BASE)
#define TMR8                ((TMR_TypeDef *) TMR8_BASE)
#define USART1              ((USART_TypeDef *) USART1_BASE)
#define USART6              ((USART_TypeDef *) USART6_BASE)
#define ADC1                ((ADC_TypeDef *) ADC1_BASE)
#define ADC2                ((ADC_TypeDef *) ADC2_BASE)
#define ADC3                ((ADC_TypeDef *) ADC3_BASE)
#define ADC123_COMMON       ((ADC_Common_TypeDef *) ADC123_COMMON_BASE)
/* Legacy define */
#define ADC                  ADC123_COMMON
#define SDIO                ((SDIO_TypeDef *) SDIO_BASE)
#define SPI1                ((SPI_TypeDef *) SPI1_BASE)
#define SYSCFG              ((SYSCFG_TypeDef *) SYSCFG_BASE)
#define EINT                ((EINT_TypeDef *) EINT_BASE)
#define TMR9                ((TMR_TypeDef *) TMR9_BASE)
#define TMR10               ((TMR_TypeDef *) TMR10_BASE)
#define TMR11               ((TMR_TypeDef *) TMR11_BASE)
#define GPIOA               ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB               ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC               ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD               ((GPIO_TypeDef *) GPIOD_BASE)
#define GPIOE               ((GPIO_TypeDef *) GPIOE_BASE)
#define GPIOF               ((GPIO_TypeDef *) GPIOF_BASE)
#define GPIOG               ((GPIO_TypeDef *) GPIOG_BASE)
#define GPIOH               ((GPIO_TypeDef *) GPIOH_BASE)
#define GPIOI               ((GPIO_TypeDef *) GPIOI_BASE)
#define CRC                 ((CRC_TypeDef *) CRC_BASE)
#define RCM                 ((RCM_TypeDef *) RCM_BASE)
#define FLASH               ((FLASH_TypeDef *) FLASH_R_BASE)
#define DMA1                ((DMA_TypeDef *) DMA1_BASE)
#define DMA1_Stream0        ((DMA_Stream_TypeDef *) DMA1_Stream0_BASE)
#define DMA1_Stream1        ((DMA_Stream_TypeDef *) DMA1_Stream1_BASE)
#define DMA1_Stream2        ((DMA_Stream_TypeDef *) DMA1_Stream2_BASE)
#define DMA1_Stream3        ((DMA_Stream_TypeDef *) DMA1_Stream3_BASE)
#define DMA1_Stream4        ((DMA_Stream_TypeDef *) DMA1_Stream4_BASE)
#define DMA1_Stream5        ((DMA_Stream_TypeDef *) DMA1_Stream5_BASE)
#define DMA1_Stream6        ((DMA_Stream_TypeDef *) DMA1_Stream6_BASE)
#define DMA1_Stream7        ((DMA_Stream_TypeDef *) DMA1_Stream7_BASE)
#define DMA2                ((DMA_TypeDef *) DMA2_BASE)
#define DMA2_Stream0        ((DMA_Stream_TypeDef *) DMA2_Stream0_BASE)
#define DMA2_Stream1        ((DMA_Stream_TypeDef *) DMA2_Stream1_BASE)
#define DMA2_Stream2        ((DMA_Stream_TypeDef *) DMA2_Stream2_BASE)
#define DMA2_Stream3        ((DMA_Stream_TypeDef *) DMA2_Stream3_BASE)
#define DMA2_Stream4        ((DMA_Stream_TypeDef *) DMA2_Stream4_BASE)
#define DMA2_Stream5        ((DMA_Stream_TypeDef *) DMA2_Stream5_BASE)
#define DMA2_Stream6        ((DMA_Stream_TypeDef *) DMA2_Stream6_BASE)
#define DMA2_Stream7        ((DMA_Stream_TypeDef *) DMA2_Stream7_BASE)
#define ETH                 ((ETH_TypeDef *) ETH_BASE)
#define DCI                ((DCI_TypeDef *) DCI_BASE)
#define CRYP                ((CRYP_TypeDef *) CRYP_BASE)
#define HASH                ((HASH_TypeDef *) HASH_BASE)
#define HASH_DIGEST         ((HASH_DIGEST_TypeDef *) HASH_DIGEST_BASE)
#define RNG                 ((RNG_TypeDef *) RNG_BASE)
#define SMC_Bank1          ((SMC_Bank1_TypeDef *) SMC_Bank1_R_BASE)
#define SMC_Bank1E         ((SMC_Bank1E_TypeDef *) SMC_Bank1E_R_BASE)
#define SMC_Bank2_3        ((SMC_Bank2_3_TypeDef *) SMC_Bank2_3_R_BASE)
#define SMC_Bank4          ((SMC_Bank4_TypeDef *) SMC_Bank4_R_BASE)
#define DBGMCU              ((DBGMCU_TypeDef *) DBGMCU_BASE)
#define USB_OTG_FS          ((USB_OTG_GlobalTypeDef *) USB_OTG_FS_PERIPH_BASE)
#define USB_OTG_HS          ((USB_OTG_GlobalTypeDef *) USB_OTG_HS_PERIPH_BASE)
#define USB_OTG_HS2         ((USB_OTG_HS2TypeDef *) USB_OTG_HS2_PERIPH_BASE)
#define DMC                 ((DMC_TypeDef *) DMC_BASE)

/**
  * @}
  */

/** @addtogroup Exported_constants
  * @{
  */

/** @addtogroup Hardware_Constant_Definition
  * @{
  */
#define LSI_STARTUP_TIME                40U /*!< LSI Maximum startup time in us */
/**
  * @}
  */

  /** @addtogroup Peripheral_Registers_Bits_Definition
  * @{
  */

/******************************************************************************/
/*                         Peripheral Registers_Bits_Definition               */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                        Analog to Digital Converter                         */
/*                                                                            */
/******************************************************************************/
/*
 * @brief Specific device feature definitions (not present on all devices in the APM32F4 serie)
 */
#define ADC_MULTIMODE_SUPPORT                                                                                                      /*!<ADC Multimode feature available on specific devices */

/********************  Bit definition for ADC_STS register  ********************/
#define ADC_STS_AWDFLG_Pos                                          (0U)
#define ADC_STS_AWDFLG_Msk                                          (0x1UL << ADC_STS_AWDFLG_Pos)                                  /*!< 0x00000001 */
#define ADC_STS_AWDFLG                                              ADC_STS_AWDFLG_Msk                                             /*!<Analog watchdog flag */
#define ADC_STS_EOCFLG_Pos                                          (1U)
#define ADC_STS_EOCFLG_Msk                                          (0x1UL << ADC_STS_EOCFLG_Pos)                                  /*!< 0x00000002 */
#define ADC_STS_EOCFLG                                              ADC_STS_EOCFLG_Msk                                             /*!<End of conversion */
#define ADC_STS_INJEOCFLG_Pos                                       (2U)
#define ADC_STS_INJEOCFLG_Msk                                       (0x1UL << ADC_STS_INJEOCFLG_Pos)                               /*!< 0x00000004 */
#define ADC_STS_INJEOCFLG                                           ADC_STS_INJEOCFLG_Msk                                          /*!<Injected channel end of conversion */
#define ADC_STS_INJCSFLG_Pos                                        (3U)
#define ADC_STS_INJCSFLG_Msk                                        (0x1UL << ADC_STS_INJCSFLG_Pos)                                /*!< 0x00000008 */
#define ADC_STS_INJCSFLG                                            ADC_STS_INJCSFLG_Msk                                           /*!<Injected channel Start flag */
#define ADC_STS_REGCSFLG_Pos                                        (4U)
#define ADC_STS_REGCSFLG_Msk                                        (0x1UL << ADC_STS_REGCSFLG_Pos)                                /*!< 0x00000010 */
#define ADC_STS_REGCSFLG                                            ADC_STS_REGCSFLG_Msk                                           /*!<Regular channel Start flag */
#define ADC_STS_OVRFLG_Pos                                          (5U)
#define ADC_STS_OVRFLG_Msk                                          (0x1UL << ADC_STS_OVRFLG_Pos)                                  /*!< 0x00000020 */
#define ADC_STS_OVRFLG                                              ADC_STS_OVRFLG_Msk                                             /*!<Overrun flag */

/*******************  Bit definition for ADC_CTRL1 register  ********************/
#define ADC_CTRL1_AWDCHSEL_Pos                                      (0U)
#define ADC_CTRL1_AWDCHSEL_Msk                                      (0x1FUL << ADC_CTRL1_AWDCHSEL_Pos)                             /*!< 0x0000001F */
#define ADC_CTRL1_AWDCHSEL                                          ADC_CTRL1_AWDCHSEL_Msk                                         /*!<AWDCH[4:0] bits (Analog watchdog channel select bits) */
#define ADC_CTRL1_AWDCHSEL_0                                        (0x01UL << ADC_CTRL1_AWDCHSEL_Pos)                             /*!< 0x00000001 */
#define ADC_CTRL1_AWDCHSEL_1                                        (0x02UL << ADC_CTRL1_AWDCHSEL_Pos)                             /*!< 0x00000002 */
#define ADC_CTRL1_AWDCHSEL_2                                        (0x04UL << ADC_CTRL1_AWDCHSEL_Pos)                             /*!< 0x00000004 */
#define ADC_CTRL1_AWDCHSEL_3                                        (0x08UL << ADC_CTRL1_AWDCHSEL_Pos)                             /*!< 0x00000008 */
#define ADC_CTRL1_AWDCHSEL_4                                        (0x10UL << ADC_CTRL1_AWDCHSEL_Pos)                             /*!< 0x00000010 */
#define ADC_CTRL1_EOCIEN_Pos                                        (5U)
#define ADC_CTRL1_EOCIEN_Msk                                        (0x1UL << ADC_CTRL1_EOCIEN_Pos)                                /*!< 0x00000020 */
#define ADC_CTRL1_EOCIEN                                            ADC_CTRL1_EOCIEN_Msk                                           /*!<Interrupt enable for EOC */
#define ADC_CTRL1_AWDIEN_Pos                                        (6U)
#define ADC_CTRL1_AWDIEN_Msk                                        (0x1UL << ADC_CTRL1_AWDIEN_Pos)                                /*!< 0x00000040 */
#define ADC_CTRL1_AWDIEN                                            ADC_CTRL1_AWDIEN_Msk                                           /*!<AAnalog Watchdog interrupt enable */
#define ADC_CTRL1_INJEOCIEN_Pos                                     (7U)
#define ADC_CTRL1_INJEOCIEN_Msk                                     (0x1UL << ADC_CTRL1_INJEOCIEN_Pos)                             /*!< 0x00000080 */
#define ADC_CTRL1_INJEOCIEN                                         ADC_CTRL1_INJEOCIEN_Msk                                        /*!<Interrupt enable for injected channels */
#define ADC_CTRL1_SCANEN_Pos                                        (8U)
#define ADC_CTRL1_SCANEN_Msk                                        (0x1UL << ADC_CTRL1_SCANEN_Pos)                                /*!< 0x00000100 */
#define ADC_CTRL1_SCANEN                                            ADC_CTRL1_SCANEN_Msk                                           /*!<Scan mode */
#define ADC_CTRL1_AWDSGLEN_Pos                                      (9U)
#define ADC_CTRL1_AWDSGLEN_Msk                                      (0x1UL << ADC_CTRL1_AWDSGLEN_Pos)                              /*!< 0x00000200 */
#define ADC_CTRL1_AWDSGLEN                                          ADC_CTRL1_AWDSGLEN_Msk                                         /*!<Enable the watchdog on a single channel in scan mode */
#define ADC_CTRL1_INJGACEN_Pos                                      (10U)
#define ADC_CTRL1_INJGACEN_Msk                                      (0x1UL << ADC_CTRL1_INJGACEN_Pos)                              /*!< 0x00000400 */
#define ADC_CTRL1_INJGACEN                                          ADC_CTRL1_INJGACEN_Msk                                         /*!<Automatic injected group conversion */
#define ADC_CTRL1_REGDISCEN_Pos                                     (11U)
#define ADC_CTRL1_REGDISCEN_Msk                                     (0x1UL << ADC_CTRL1_REGDISCEN_Pos)                             /*!< 0x00000800 */
#define ADC_CTRL1_REGDISCEN                                         ADC_CTRL1_REGDISCEN_Msk                                        /*!<Discontinuous mode on regular channels */
#define ADC_CTRL1_INJDISCEN_Pos                                     (12U)
#define ADC_CTRL1_INJDISCEN_Msk                                     (0x1UL << ADC_CTRL1_INJDISCEN_Pos)                             /*!< 0x00001000 */
#define ADC_CTRL1_INJDISCEN                                         ADC_CTRL1_INJDISCEN_Msk                                        /*!<Discontinuous mode on injected channels */
#define ADC_CTRL1_DISCNUMCFG_Pos                                    (13U)
#define ADC_CTRL1_DISCNUMCFG_Msk                                    (0x7UL << ADC_CTRL1_DISCNUMCFG_Pos)                            /*!< 0x0000E000 */
#define ADC_CTRL1_DISCNUMCFG                                        ADC_CTRL1_DISCNUMCFG_Msk                                       /*!<DISCNUM[2:0] bits (Discontinuous mode channel count) */
#define ADC_CTRL1_DISCNUMCFG_0                                      (0x1UL << ADC_CTRL1_DISCNUMCFG_Pos)                            /*!< 0x00002000 */
#define ADC_CTRL1_DISCNUMCFG_1                                      (0x2UL << ADC_CTRL1_DISCNUMCFG_Pos)                            /*!< 0x00004000 */
#define ADC_CTRL1_DISCNUMCFG_2                                      (0x4UL << ADC_CTRL1_DISCNUMCFG_Pos)                            /*!< 0x00008000 */
#define ADC_CTRL1_INJAWDEN_Pos                                      (22U)
#define ADC_CTRL1_INJAWDEN_Msk                                      (0x1UL << ADC_CTRL1_INJAWDEN_Pos)                              /*!< 0x00400000 */
#define ADC_CTRL1_INJAWDEN                                          ADC_CTRL1_INJAWDEN_Msk                                         /*!<Analog watchdog enable on injected channels */
#define ADC_CTRL1_REGAWDEN_Pos                                      (23U)
#define ADC_CTRL1_REGAWDEN_Msk                                      (0x1UL << ADC_CTRL1_REGAWDEN_Pos)                              /*!< 0x00800000 */
#define ADC_CTRL1_REGAWDEN                                          ADC_CTRL1_REGAWDEN_Msk                                         /*!<Analog watchdog enable on regular channels */
#define ADC_CTRL1_RESSEL_Pos                                        (24U)
#define ADC_CTRL1_RESSEL_Msk                                        (0x3UL << ADC_CTRL1_RESSEL_Pos)                                /*!< 0x03000000 */
#define ADC_CTRL1_RESSEL                                            ADC_CTRL1_RESSEL_Msk                                           /*!<RES[2:0] bits (Resolution) */
#define ADC_CTRL1_RESSEL_0                                          (0x1UL << ADC_CTRL1_RESSEL_Pos)                                /*!< 0x01000000 */
#define ADC_CTRL1_RESSEL_1                                          (0x2UL << ADC_CTRL1_RESSEL_Pos)                                /*!< 0x02000000 */
#define ADC_CTRL1_OVRIEN_Pos                                        (26U)
#define ADC_CTRL1_OVRIEN_Msk                                        (0x1UL << ADC_CTRL1_OVRIEN_Pos)                                /*!< 0x04000000 */
#define ADC_CTRL1_OVRIEN                                            ADC_CTRL1_OVRIEN_Msk                                           /*!<overrun interrupt enable */

