betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f417xx.h
/********************  Bit definition for CRC_CTRL register  ********************/
#define CRC_CTRL_RST_Pos                                            (0U)
#define CRC_CTRL_RST_Msk                                            (0x1UL << CRC_CTRL_RST_Pos)                                    /*!< 0x00000001 */
#define CRC_CTRL_RST                                                CRC_CTRL_RST_Msk                                               /*!< RESET bit */

/******************************************************************************/
/*                                                                            */
/*                            Crypto Processor                                */
/*                                                                            */
/******************************************************************************/
/******************* Bits definition for CRYP_CTRL register  ********************/
#define CRYP_CTRL_ALGODIRSEL_Pos                                    (2U)
#define CRYP_CTRL_ALGODIRSEL_Msk                                    (0x1UL << CRYP_CTRL_ALGODIRSEL_Pos)                            /*!< 0x00000004 */
#define CRYP_CTRL_ALGODIRSEL                                        CRYP_CTRL_ALGODIRSEL_Msk

#define CRYP_CTRL_ALGOMSEL_Pos                                      (3U)
#define CRYP_CTRL_ALGOMSEL_Msk                                      (0x10007UL << CRYP_CTRL_ALGOMSEL_Pos)                          /*!< 0x00080038 */
#define CRYP_CTRL_ALGOMSEL                                          CRYP_CTRL_ALGOMSEL_Msk
#define CRYP_CTRL_ALGOMSEL_0                                        (0x00001UL << CRYP_CTRL_ALGOMSEL_Pos)                          /*!< 0x00000008 */
#define CRYP_CTRL_ALGOMSEL_1                                        (0x00002UL << CRYP_CTRL_ALGOMSEL_Pos)                          /*!< 0x00000010 */
#define CRYP_CTRL_ALGOMSEL_2                                        (0x00004UL << CRYP_CTRL_ALGOMSEL_Pos)                          /*!< 0x00000020 */
#define CRYP_CTRL_ALGOMSEL_TDES_ECB                                 0x00000000U
#define CRYP_CTRL_ALGOMSEL_TDES_CBC_Pos                             (3U)
#define CRYP_CTRL_ALGOMSEL_TDES_CBC_Msk                             (0x1UL << CRYP_CTRL_ALGOMSEL_TDES_CBC_Pos)                     /*!< 0x00000008 */
#define CRYP_CTRL_ALGOMSEL_TDES_CBC                                 CRYP_CTRL_ALGOMSEL_TDES_CBC_Msk
#define CRYP_CTRL_ALGOMSEL_DES_ECB_Pos                              (4U)
#define CRYP_CTRL_ALGOMSEL_DES_ECB_Msk                              (0x1UL << CRYP_CTRL_ALGOMSEL_DES_ECB_Pos)                      /*!< 0x00000010 */
#define CRYP_CTRL_ALGOMSEL_DES_ECB                                  CRYP_CTRL_ALGOMSEL_DES_ECB_Msk
#define CRYP_CTRL_ALGOMSEL_DES_CBC_Pos                              (3U)
#define CRYP_CTRL_ALGOMSEL_DES_CBC_Msk                              (0x3UL << CRYP_CTRL_ALGOMSEL_DES_CBC_Pos)                      /*!< 0x00000018 */
#define CRYP_CTRL_ALGOMSEL_DES_CBC                                  CRYP_CTRL_ALGOMSEL_DES_CBC_Msk
#define CRYP_CTRL_ALGOMSEL_AES_ECB_Pos                              (5U)
#define CRYP_CTRL_ALGOMSEL_AES_ECB_Msk                              (0x1UL << CRYP_CTRL_ALGOMSEL_AES_ECB_Pos)                      /*!< 0x00000020 */
#define CRYP_CTRL_ALGOMSEL_AES_ECB                                  CRYP_CTRL_ALGOMSEL_AES_ECB_Msk
#define CRYP_CTRL_ALGOMSEL_AES_CBC_Pos                              (3U)
#define CRYP_CTRL_ALGOMSEL_AES_CBC_Msk                              (0x5UL << CRYP_CTRL_ALGOMSEL_AES_CBC_Pos)                      /*!< 0x00000028 */
#define CRYP_CTRL_ALGOMSEL_AES_CBC                                  CRYP_CTRL_ALGOMSEL_AES_CBC_Msk
#define CRYP_CTRL_ALGOMSEL_AES_CTR_Pos                              (4U)
#define CRYP_CTRL_ALGOMSEL_AES_CTR_Msk                              (0x3UL << CRYP_CTRL_ALGOMSEL_AES_CTR_Pos)                      /*!< 0x00000030 */
#define CRYP_CTRL_ALGOMSEL_AES_CTR                                  CRYP_CTRL_ALGOMSEL_AES_CTR_Msk
#define CRYP_CTRL_ALGOMSEL_AES_KEY_Pos                              (3U)
#define CRYP_CTRL_ALGOMSEL_AES_KEY_Msk                              (0x7UL << CRYP_CTRL_ALGOMSEL_AES_KEY_Pos)                      /*!< 0x00000038 */
#define CRYP_CTRL_ALGOMSEL_AES_KEY                                  CRYP_CTRL_ALGOMSEL_AES_KEY_Msk

#define CRYP_CTRL_DTSEL_Pos                                         (6U)
#define CRYP_CTRL_DTSEL_Msk                                         (0x3UL << CRYP_CTRL_DTSEL_Pos)                                 /*!< 0x000000C0 */
#define CRYP_CTRL_DTSEL                                             CRYP_CTRL_DTSEL_Msk
#define CRYP_CTRL_DTSEL_0                                           (0x1UL << CRYP_CTRL_DTSEL_Pos)                                 /*!< 0x00000040 */
#define CRYP_CTRL_DTSEL_1                                           (0x2UL << CRYP_CTRL_DTSEL_Pos)                                 /*!< 0x00000080 */
#define CRYP_CTRL_KSIZESEL_Pos                                      (8U)
#define CRYP_CTRL_KSIZESEL_Msk                                      (0x3UL << CRYP_CTRL_KSIZESEL_Pos)                              /*!< 0x00000300 */
#define CRYP_CTRL_KSIZESEL                                          CRYP_CTRL_KSIZESEL_Msk
#define CRYP_CTRL_KSIZESEL_0                                        (0x1UL << CRYP_CTRL_KSIZESEL_Pos)                              /*!< 0x00000100 */
#define CRYP_CTRL_KSIZESEL_1                                        (0x2UL << CRYP_CTRL_KSIZESEL_Pos)                              /*!< 0x00000200 */
#define CRYP_CTRL_FFLUSH_Pos                                        (14U)
#define CRYP_CTRL_FFLUSH_Msk                                        (0x1UL << CRYP_CTRL_FFLUSH_Pos)                                /*!< 0x00004000 */
#define CRYP_CTRL_FFLUSH                                            CRYP_CTRL_FFLUSH_Msk
#define CRYP_CTRL_CRYPEN_Pos                                        (15U)
#define CRYP_CTRL_CRYPEN_Msk                                        (0x1UL << CRYP_CTRL_CRYPEN_Pos)                                /*!< 0x00008000 */
#define CRYP_CTRL_CRYPEN                                            CRYP_CTRL_CRYPEN_Msk

#define CRYP_CTRL_GCM_CCMPH_Pos                                     (16U)
#define CRYP_CTRL_GCM_CCMPH_Msk                                     (0x3UL << CRYP_CTRL_GCM_CCMPH_Pos)                             /*!< 0x00030000 */
#define CRYP_CTRL_GCM_CCMPH                                         CRYP_CTRL_GCM_CCMPH_Msk
#define CRYP_CTRL_GCM_CCMPH_0                                       (0x1UL << CRYP_CTRL_GCM_CCMPH_Pos)                             /*!< 0x00010000 */
#define CRYP_CTRL_GCM_CCMPH_1                                       (0x2UL << CRYP_CTRL_GCM_CCMPH_Pos)                             /*!< 0x00020000 */
#define CRYP_CTRL_ALGOMSEL_3                                        0x00080000U

/****************** Bits definition for CRYP_STS register  *********************/
#define CRYP_STS_IFEMPT_Pos                                         (0U)
#define CRYP_STS_IFEMPT_Msk                                         (0x1UL << CRYP_STS_IFEMPT_Pos)                                 /*!< 0x00000001 */
#define CRYP_STS_IFEMPT                                             CRYP_STS_IFEMPT_Msk
#define CRYP_STS_IFFULL_Pos                                         (1U)
#define CRYP_STS_IFFULL_Msk                                         (0x1UL << CRYP_STS_IFFULL_Pos)                                 /*!< 0x00000002 */
#define CRYP_STS_IFFULL                                             CRYP_STS_IFFULL_Msk
#define CRYP_STS_OFEMPT_Pos                                         (2U)
#define CRYP_STS_OFEMPT_Msk                                         (0x1UL << CRYP_STS_OFEMPT_Pos)                                 /*!< 0x00000004 */
#define CRYP_STS_OFEMPT                                             CRYP_STS_OFEMPT_Msk
#define CRYP_STS_OFFULL_Pos                                         (3U)
#define CRYP_STS_OFFULL_Msk                                         (0x1UL << CRYP_STS_OFFULL_Pos)                                 /*!< 0x00000008 */
#define CRYP_STS_OFFULL                                             CRYP_STS_OFFULL_Msk
#define CRYP_STS_BUSY_Pos                                           (4U)
#define CRYP_STS_BUSY_Msk                                           (0x1UL << CRYP_STS_BUSY_Pos)                                   /*!< 0x00000010 */
#define CRYP_STS_BUSY                                               CRYP_STS_BUSY_Msk
/****************** Bits definition for CRYP_DMACTRL register  ******************/
#define CRYP_DMACTRL_INEN_Pos                                       (0U)
#define CRYP_DMACTRL_INEN_Msk                                       (0x1UL << CRYP_DMACTRL_INEN_Pos)                               /*!< 0x00000001 */
#define CRYP_DMACTRL_INEN                                           CRYP_DMACTRL_INEN_Msk
#define CRYP_DMACTRL_OUTEN_Pos                                      (1U)
#define CRYP_DMACTRL_OUTEN_Msk                                      (0x1UL << CRYP_DMACTRL_OUTEN_Pos)                              /*!< 0x00000002 */
#define CRYP_DMACTRL_OUTEN                                          CRYP_DMACTRL_OUTEN_Msk
/*****************  Bits definition for CRYP_INTMASK register  ******************/
#define CRYP_INTMASK_INIMASK_Pos                                    (0U)
#define CRYP_INTMASK_INIMASK_Msk                                    (0x1UL << CRYP_INTMASK_INIMASK_Pos)                            /*!< 0x00000001 */
#define CRYP_INTMASK_INIMASK                                        CRYP_INTMASK_INIMASK_Msk
#define CRYP_INTMASK_OUTIMASK_Pos                                   (1U)
#define CRYP_INTMASK_OUTIMASK_Msk                                   (0x1UL << CRYP_INTMASK_OUTIMASK_Pos)                           /*!< 0x00000002 */
#define CRYP_INTMASK_OUTIMASK                                       CRYP_INTMASK_OUTIMASK_Msk
/****************** Bits definition for CRYP_INTSTS register  *******************/
#define CRYP_INTSTS_INISTS_Pos                                      (0U)
#define CRYP_INTSTS_INISTS_Msk                                      (0x1UL << CRYP_INTSTS_INISTS_Pos)                              /*!< 0x00000001 */
#define CRYP_INTSTS_INISTS                                          CRYP_INTSTS_INISTS_Msk
#define CRYP_INTSTS_OUTISTS_Pos                                     (1U)
#define CRYP_INTSTS_OUTISTS_Msk                                     (0x1UL << CRYP_INTSTS_OUTISTS_Pos)                             /*!< 0x00000002 */
#define CRYP_INTSTS_OUTISTS                                         CRYP_INTSTS_OUTISTS_Msk
/****************** Bits definition for CRYP_MINTSTS register  *******************/
#define CRYP_MINTSTS_INMISTS_Pos                                    (0U)
#define CRYP_MINTSTS_INMISTS_Msk                                    (0x1UL << CRYP_MINTSTS_INMISTS_Pos)                            /*!< 0x00000001 */
#define CRYP_MINTSTS_INMISTS                                        CRYP_MINTSTS_INMISTS_Msk
#define CRYP_MINTSTS_OUTMISTS_Pos                                   (1U)
#define CRYP_MINTSTS_OUTMISTS_Msk                                   (0x1UL << CRYP_MINTSTS_OUTMISTS_Pos)                           /*!< 0x00000002 */
#define CRYP_MINTSTS_OUTMISTS                                       CRYP_MINTSTS_OUTMISTS_Msk

/******************************************************************************/
/*                                                                            */
/*                      Digital to Analog Converter                           */
/*                                                                            */
/******************************************************************************/
/*
 * @brief Specific device feature definitions (not present on all devices in the APM32F4 serie)
 */
#define DAC_CHANNEL2_SUPPORT                                                                                                       /*!< DAC feature available only on specific devices: availability of DAC channel 2 */
/********************  Bit definition for DAC_CTRL register  ********************/
#define DAC_CTRL_ENCH1_Pos                                          (0U)
#define DAC_CTRL_ENCH1_Msk                                          (0x1UL << DAC_CTRL_ENCH1_Pos)                                  /*!< 0x00000001 */
#define DAC_CTRL_ENCH1                                              DAC_CTRL_ENCH1_Msk                                             /*!<DAC channel1 enable */
#define DAC_CTRL_BUFFDCH1_Pos                                       (1U)
#define DAC_CTRL_BUFFDCH1_Msk                                       (0x1UL << DAC_CTRL_BUFFDCH1_Pos)                               /*!< 0x00000002 */
#define DAC_CTRL_BUFFDCH1                                           DAC_CTRL_BUFFDCH1_Msk                                          /*!<DAC channel1 output buffer disable */
#define DAC_CTRL_TRGENCH1_Pos                                       (2U)
#define DAC_CTRL_TRGENCH1_Msk                                       (0x1UL << DAC_CTRL_TRGENCH1_Pos)                               /*!< 0x00000004 */
#define DAC_CTRL_TRGENCH1                                           DAC_CTRL_TRGENCH1_Msk                                          /*!<DAC channel1 Trigger enable */

#define DAC_CTRL_TRGSELCH1_Pos                                      (3U)
#define DAC_CTRL_TRGSELCH1_Msk                                      (0x7UL << DAC_CTRL_TRGSELCH1_Pos)                              /*!< 0x00000038 */
#define DAC_CTRL_TRGSELCH1                                          DAC_CTRL_TRGSELCH1_Msk                                         /*!<TSEL1[2:0] (DAC channel1 Trigger selection) */
#define DAC_CTRL_TRGSELCH1_0                                        (0x1UL << DAC_CTRL_TRGSELCH1_Pos)                              /*!< 0x00000008 */
#define DAC_CTRL_TRGSELCH1_1                                        (0x2UL << DAC_CTRL_TRGSELCH1_Pos)                              /*!< 0x00000010 */
#define DAC_CTRL_TRGSELCH1_2                                        (0x4UL << DAC_CTRL_TRGSELCH1_Pos)                              /*!< 0x00000020 */

#define DAC_CTRL_WAVENCH1_Pos                                       (6U)
#define DAC_CTRL_WAVENCH1_Msk                                       (0x3UL << DAC_CTRL_WAVENCH1_Pos)                               /*!< 0x000000C0 */
#define DAC_CTRL_WAVENCH1                                           DAC_CTRL_WAVENCH1_Msk                                          /*!<WAVE1[1:0] (DAC channel1 noise/triangle wave generation enable) */
#define DAC_CTRL_WAVENCH1_0                                         (0x1UL << DAC_CTRL_WAVENCH1_Pos)                               /*!< 0x00000040 */
#define DAC_CTRL_WAVENCH1_1                                         (0x2UL << DAC_CTRL_WAVENCH1_Pos)                               /*!< 0x00000080 */

#define DAC_CTRL_MAMPSELCH1_Pos                                     (8U)
#define DAC_CTRL_MAMPSELCH1_Msk                                     (0xFUL << DAC_CTRL_MAMPSELCH1_Pos)                             /*!< 0x00000F00 */
#define DAC_CTRL_MAMPSELCH1                                         DAC_CTRL_MAMPSELCH1_Msk                                        /*!<MAMP1[3:0] (DAC channel1 Mask/Amplitude selector) */
#define DAC_CTRL_MAMPSELCH1_0                                       (0x1UL << DAC_CTRL_MAMPSELCH1_Pos)                             /*!< 0x00000100 */
#define DAC_CTRL_MAMPSELCH1_1                                       (0x2UL << DAC_CTRL_MAMPSELCH1_Pos)                             /*!< 0x00000200 */
#define DAC_CTRL_MAMPSELCH1_2                                       (0x4UL << DAC_CTRL_MAMPSELCH1_Pos)                             /*!< 0x00000400 */
#define DAC_CTRL_MAMPSELCH1_3                                       (0x8UL << DAC_CTRL_MAMPSELCH1_Pos)                             /*!< 0x00000800 */

#define DAC_CTRL_DMAENCH1_Pos                                       (12U)
#define DAC_CTRL_DMAENCH1_Msk                                       (0x1UL << DAC_CTRL_DMAENCH1_Pos)                               /*!< 0x00001000 */
#define DAC_CTRL_DMAENCH1                                           DAC_CTRL_DMAENCH1_Msk                                          /*!<DAC channel1 DMA enable */
#define DAC_CTRL_DMAUDIEN1_Pos                                      (13U)
#define DAC_CTRL_DMAUDIEN1_Msk                                      (0x1UL << DAC_CTRL_DMAUDIEN1_Pos)                              /*!< 0x00002000 */
#define DAC_CTRL_DMAUDIEN1                                          DAC_CTRL_DMAUDIEN1_Msk                                         /*!<DAC channel1 DMA underrun interrupt enable*/
#define DAC_CTRL_ENCH2_Pos                                          (16U)
#define DAC_CTRL_ENCH2_Msk                                          (0x1UL << DAC_CTRL_ENCH2_Pos)                                  /*!< 0x00010000 */
#define DAC_CTRL_ENCH2                                              DAC_CTRL_ENCH2_Msk                                             /*!<DAC channel2 enable */
#define DAC_CTRL_BUFFDCH2_Pos                                       (17U)
#define DAC_CTRL_BUFFDCH2_Msk                                       (0x1UL << DAC_CTRL_BUFFDCH2_Pos)                               /*!< 0x00020000 */
#define DAC_CTRL_BUFFDCH2                                           DAC_CTRL_BUFFDCH2_Msk                                          /*!<DAC channel2 output buffer disable */
#define DAC_CTRL_TRGENCH2_Pos                                       (18U)
#define DAC_CTRL_TRGENCH2_Msk                                       (0x1UL << DAC_CTRL_TRGENCH2_Pos)                               /*!< 0x00040000 */
#define DAC_CTRL_TRGENCH2                                           DAC_CTRL_TRGENCH2_Msk                                          /*!<DAC channel2 Trigger enable */

