betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f417xx.h
#define DAC_CTRL_TRGSELCH2_Pos                                      (19U)
#define DAC_CTRL_TRGSELCH2_Msk                                      (0x7UL << DAC_CTRL_TRGSELCH2_Pos)                              /*!< 0x00380000 */
#define DAC_CTRL_TRGSELCH2                                          DAC_CTRL_TRGSELCH2_Msk                                         /*!<TSEL2[2:0] (DAC channel2 Trigger selection) */
#define DAC_CTRL_TRGSELCH2_0                                        (0x1UL << DAC_CTRL_TRGSELCH2_Pos)                              /*!< 0x00080000 */
#define DAC_CTRL_TRGSELCH2_1                                        (0x2UL << DAC_CTRL_TRGSELCH2_Pos)                              /*!< 0x00100000 */
#define DAC_CTRL_TRGSELCH2_2                                        (0x4UL << DAC_CTRL_TRGSELCH2_Pos)                              /*!< 0x00200000 */

#define DAC_CTRL_WAVENCH2_Pos                                       (22U)
#define DAC_CTRL_WAVENCH2_Msk                                       (0x3UL << DAC_CTRL_WAVENCH2_Pos)                               /*!< 0x00C00000 */
#define DAC_CTRL_WAVENCH2                                           DAC_CTRL_WAVENCH2_Msk                                          /*!<WAVE2[1:0] (DAC channel2 noise/triangle wave generation enable) */
#define DAC_CTRL_WAVENCH2_0                                         (0x1UL << DAC_CTRL_WAVENCH2_Pos)                               /*!< 0x00400000 */
#define DAC_CTRL_WAVENCH2_1                                         (0x2UL << DAC_CTRL_WAVENCH2_Pos)                               /*!< 0x00800000 */

#define DAC_CTRL_MAMPSELCH2_Pos                                     (24U)
#define DAC_CTRL_MAMPSELCH2_Msk                                     (0xFUL << DAC_CTRL_MAMPSELCH2_Pos)                             /*!< 0x0F000000 */
#define DAC_CTRL_MAMPSELCH2                                         DAC_CTRL_MAMPSELCH2_Msk                                        /*!<MAMP2[3:0] (DAC channel2 Mask/Amplitude selector) */
#define DAC_CTRL_MAMPSELCH2_0                                       (0x1UL << DAC_CTRL_MAMPSELCH2_Pos)                             /*!< 0x01000000 */
#define DAC_CTRL_MAMPSELCH2_1                                       (0x2UL << DAC_CTRL_MAMPSELCH2_Pos)                             /*!< 0x02000000 */
#define DAC_CTRL_MAMPSELCH2_2                                       (0x4UL << DAC_CTRL_MAMPSELCH2_Pos)                             /*!< 0x04000000 */
#define DAC_CTRL_MAMPSELCH2_3                                       (0x8UL << DAC_CTRL_MAMPSELCH2_Pos)                             /*!< 0x08000000 */

#define DAC_CTRL_DMAENCH2_Pos                                       (28U)
#define DAC_CTRL_DMAENCH2_Msk                                       (0x1UL << DAC_CTRL_DMAENCH2_Pos)                               /*!< 0x10000000 */
#define DAC_CTRL_DMAENCH2                                           DAC_CTRL_DMAENCH2_Msk                                          /*!<DAC channel2 DMA enabled */
#define DAC_CTRL_DMAUDIEN2_Pos                                      (29U)
#define DAC_CTRL_DMAUDIEN2_Msk                                      (0x1UL << DAC_CTRL_DMAUDIEN2_Pos)                              /*!< 0x20000000 */
#define DAC_CTRL_DMAUDIEN2                                          DAC_CTRL_DMAUDIEN2_Msk                                         /*!<DAC channel2 DMA underrun interrupt enable*/

/*****************  Bit definition for DAC_SWTRG register  ******************/
#define DAC_SWTRG_SWTRG1_Pos                                        (0U)
#define DAC_SWTRG_SWTRG1_Msk                                        (0x1UL << DAC_SWTRG_SWTRG1_Pos)                                /*!< 0x00000001 */
#define DAC_SWTRG_SWTRG1                                            DAC_SWTRG_SWTRG1_Msk                                           /*!<DAC channel1 software trigger */
#define DAC_SWTRG_SWTRG2_Pos                                        (1U)
#define DAC_SWTRG_SWTRG2_Msk                                        (0x1UL << DAC_SWTRG_SWTRG2_Pos)                                /*!< 0x00000002 */
#define DAC_SWTRG_SWTRG2                                            DAC_SWTRG_SWTRG2_Msk                                           /*!<DAC channel2 software trigger */

/*****************  Bit definition for DAC_DH12R1 register  ******************/
#define DAC_DH12R1_DATA_Pos                                         (0U)
#define DAC_DH12R1_DATA_Msk                                         (0xFFFUL << DAC_DH12R1_DATA_Pos)                               /*!< 0x00000FFF */
#define DAC_DH12R1_DATA                                             DAC_DH12R1_DATA_Msk                                            /*!<DAC channel1 12-bit Right aligned data */

/*****************  Bit definition for DAC_DH12L1 register  ******************/
#define DAC_DH12L1_DATA_Pos                                         (4U)
#define DAC_DH12L1_DATA_Msk                                         (0xFFFUL << DAC_DH12L1_DATA_Pos)                               /*!< 0x0000FFF0 */
#define DAC_DH12L1_DATA                                             DAC_DH12L1_DATA_Msk                                            /*!<DAC channel1 12-bit Left aligned data */

/******************  Bit definition for DAC_DH8R1 register  ******************/
#define DAC_DH8R1_DATA_Pos                                          (0U)
#define DAC_DH8R1_DATA_Msk                                          (0xFFUL << DAC_DH8R1_DATA_Pos)                                 /*!< 0x000000FF */
#define DAC_DH8R1_DATA                                              DAC_DH8R1_DATA_Msk                                             /*!<DAC channel1 8-bit Right aligned data */

/*****************  Bit definition for DAC_DH12R2 register  ******************/
#define DAC_DH12R2_DATA_Pos                                         (0U)
#define DAC_DH12R2_DATA_Msk                                         (0xFFFUL << DAC_DH12R2_DATA_Pos)                               /*!< 0x00000FFF */
#define DAC_DH12R2_DATA                                             DAC_DH12R2_DATA_Msk                                            /*!<DAC channel2 12-bit Right aligned data */

/*****************  Bit definition for DAC_DH12L2 register  ******************/
#define DAC_DH12L2_DATA_Pos                                         (4U)
#define DAC_DH12L2_DATA_Msk                                         (0xFFFUL << DAC_DH12L2_DATA_Pos)                               /*!< 0x0000FFF0 */
#define DAC_DH12L2_DATA                                             DAC_DH12L2_DATA_Msk                                            /*!<DAC channel2 12-bit Left aligned data */

