betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f417xx.h
/*******************  Bit definition for EINT_IPEND register  ********************/
#define EINT_IPEND_IPEND0_Pos                                       (0U)
#define EINT_IPEND_IPEND0_Msk                                       (0x1UL << EINT_IPEND_IPEND0_Pos)                               /*!< 0x00000001 */
#define EINT_IPEND_IPEND0                                           EINT_IPEND_IPEND0_Msk                                          /*!< Pending bit for line 0 */
#define EINT_IPEND_IPEND1_Pos                                       (1U)
#define EINT_IPEND_IPEND1_Msk                                       (0x1UL << EINT_IPEND_IPEND1_Pos)                               /*!< 0x00000002 */
#define EINT_IPEND_IPEND1                                           EINT_IPEND_IPEND1_Msk                                          /*!< Pending bit for line 1 */
#define EINT_IPEND_IPEND2_Pos                                       (2U)
#define EINT_IPEND_IPEND2_Msk                                       (0x1UL << EINT_IPEND_IPEND2_Pos)                               /*!< 0x00000004 */
#define EINT_IPEND_IPEND2                                           EINT_IPEND_IPEND2_Msk                                          /*!< Pending bit for line 2 */
#define EINT_IPEND_IPEND3_Pos                                       (3U)
#define EINT_IPEND_IPEND3_Msk                                       (0x1UL << EINT_IPEND_IPEND3_Pos)                               /*!< 0x00000008 */
#define EINT_IPEND_IPEND3                                           EINT_IPEND_IPEND3_Msk                                          /*!< Pending bit for line 3 */
#define EINT_IPEND_IPEND4_Pos                                       (4U)
#define EINT_IPEND_IPEND4_Msk                                       (0x1UL << EINT_IPEND_IPEND4_Pos)                               /*!< 0x00000010 */
#define EINT_IPEND_IPEND4                                           EINT_IPEND_IPEND4_Msk                                          /*!< Pending bit for line 4 */
#define EINT_IPEND_IPEND5_Pos                                       (5U)
#define EINT_IPEND_IPEND5_Msk                                       (0x1UL << EINT_IPEND_IPEND5_Pos)                               /*!< 0x00000020 */
#define EINT_IPEND_IPEND5                                           EINT_IPEND_IPEND5_Msk                                          /*!< Pending bit for line 5 */
#define EINT_IPEND_IPEND6_Pos                                       (6U)
#define EINT_IPEND_IPEND6_Msk                                       (0x1UL << EINT_IPEND_IPEND6_Pos)                               /*!< 0x00000040 */
#define EINT_IPEND_IPEND6                                           EINT_IPEND_IPEND6_Msk                                          /*!< Pending bit for line 6 */
#define EINT_IPEND_IPEND7_Pos                                       (7U)
#define EINT_IPEND_IPEND7_Msk                                       (0x1UL << EINT_IPEND_IPEND7_Pos)                               /*!< 0x00000080 */
#define EINT_IPEND_IPEND7                                           EINT_IPEND_IPEND7_Msk                                          /*!< Pending bit for line 7 */
#define EINT_IPEND_IPEND8_Pos                                       (8U)
#define EINT_IPEND_IPEND8_Msk                                       (0x1UL << EINT_IPEND_IPEND8_Pos)                               /*!< 0x00000100 */
#define EINT_IPEND_IPEND8                                           EINT_IPEND_IPEND8_Msk                                          /*!< Pending bit for line 8 */
#define EINT_IPEND_IPEND9_Pos                                       (9U)
#define EINT_IPEND_IPEND9_Msk                                       (0x1UL << EINT_IPEND_IPEND9_Pos)                               /*!< 0x00000200 */
#define EINT_IPEND_IPEND9                                           EINT_IPEND_IPEND9_Msk                                          /*!< Pending bit for line 9 */
#define EINT_IPEND_IPEND10_Pos                                      (10U)
#define EINT_IPEND_IPEND10_Msk                                      (0x1UL << EINT_IPEND_IPEND10_Pos)                              /*!< 0x00000400 */
#define EINT_IPEND_IPEND10                                          EINT_IPEND_IPEND10_Msk                                         /*!< Pending bit for line 10 */
#define EINT_IPEND_IPEND11_Pos                                      (11U)
#define EINT_IPEND_IPEND11_Msk                                      (0x1UL << EINT_IPEND_IPEND11_Pos)                              /*!< 0x00000800 */
#define EINT_IPEND_IPEND11                                          EINT_IPEND_IPEND11_Msk                                         /*!< Pending bit for line 11 */
#define EINT_IPEND_IPEND12_Pos                                      (12U)
#define EINT_IPEND_IPEND12_Msk                                      (0x1UL << EINT_IPEND_IPEND12_Pos)                              /*!< 0x00001000 */
#define EINT_IPEND_IPEND12                                          EINT_IPEND_IPEND12_Msk                                         /*!< Pending bit for line 12 */
#define EINT_IPEND_IPEND13_Pos                                      (13U)
#define EINT_IPEND_IPEND13_Msk                                      (0x1UL << EINT_IPEND_IPEND13_Pos)                              /*!< 0x00002000 */
#define EINT_IPEND_IPEND13                                          EINT_IPEND_IPEND13_Msk                                         /*!< Pending bit for line 13 */
#define EINT_IPEND_IPEND14_Pos                                      (14U)
#define EINT_IPEND_IPEND14_Msk                                      (0x1UL << EINT_IPEND_IPEND14_Pos)                              /*!< 0x00004000 */
#define EINT_IPEND_IPEND14                                          EINT_IPEND_IPEND14_Msk                                         /*!< Pending bit for line 14 */
#define EINT_IPEND_IPEND15_Pos                                      (15U)
#define EINT_IPEND_IPEND15_Msk                                      (0x1UL << EINT_IPEND_IPEND15_Pos)                              /*!< 0x00008000 */
#define EINT_IPEND_IPEND15                                          EINT_IPEND_IPEND15_Msk                                         /*!< Pending bit for line 15 */
#define EINT_IPEND_IPEND16_Pos                                      (16U)
#define EINT_IPEND_IPEND16_Msk                                      (0x1UL << EINT_IPEND_IPEND16_Pos)                              /*!< 0x00010000 */
#define EINT_IPEND_IPEND16                                          EINT_IPEND_IPEND16_Msk                                         /*!< Pending bit for line 16 */
#define EINT_IPEND_IPEND17_Pos                                      (17U)
#define EINT_IPEND_IPEND17_Msk                                      (0x1UL << EINT_IPEND_IPEND17_Pos)                              /*!< 0x00020000 */
#define EINT_IPEND_IPEND17                                          EINT_IPEND_IPEND17_Msk                                         /*!< Pending bit for line 17 */
#define EINT_IPEND_IPEND18_Pos                                      (18U)
#define EINT_IPEND_IPEND18_Msk                                      (0x1UL << EINT_IPEND_IPEND18_Pos)                              /*!< 0x00040000 */
#define EINT_IPEND_IPEND18                                          EINT_IPEND_IPEND18_Msk                                         /*!< Pending bit for line 18 */
#define EINT_IPEND_IPEND19_Pos                                      (19U)
#define EINT_IPEND_IPEND19_Msk                                      (0x1UL << EINT_IPEND_IPEND19_Pos)                              /*!< 0x00080000 */
#define EINT_IPEND_IPEND19                                          EINT_IPEND_IPEND19_Msk                                         /*!< Pending bit for line 19 */
#define EINT_IPEND_IPEND20_Pos                                      (20U)
#define EINT_IPEND_IPEND20_Msk                                      (0x1UL << EINT_IPEND_IPEND20_Pos)                              /*!< 0x00100000 */
#define EINT_IPEND_IPEND20                                          EINT_IPEND_IPEND20_Msk                                         /*!< Pending bit for line 20 */
#define EINT_IPEND_IPEND21_Pos                                      (21U)
#define EINT_IPEND_IPEND21_Msk                                      (0x1UL << EINT_IPEND_IPEND21_Pos)                              /*!< 0x00200000 */
#define EINT_IPEND_IPEND21                                          EINT_IPEND_IPEND21_Msk                                         /*!< Pending bit for line 21 */
#define EINT_IPEND_IPEND22_Pos                                      (22U)
#define EINT_IPEND_IPEND22_Msk                                      (0x1UL << EINT_IPEND_IPEND22_Pos)                              /*!< 0x00400000 */
#define EINT_IPEND_IPEND22                                          EINT_IPEND_IPEND22_Msk                                         /*!< Pending bit for line 22 */

/******************************************************************************/
/*                                                                            */
/*                                    FLASH                                   */
/*                                                                            */
/******************************************************************************/
/*******************  Bits definition for FMC_ACCTRL register  *****************/
#define FLASH_ACCTRL_WAITP_Pos                                      (0U)
#define FLASH_ACCTRL_WAITP_Msk                                      (0x7UL << FLASH_ACCTRL_WAITP_Pos)                              /*!< 0x00000007 */
#define FLASH_ACCTRL_WAITP                                          FLASH_ACCTRL_WAITP_Msk
#define FLASH_ACCTRL_WAITP_0WS                                      0x00000000U
#define FLASH_ACCTRL_WAITP_1WS                                      0x00000001U
#define FLASH_ACCTRL_WAITP_2WS                                      0x00000002U
#define FLASH_ACCTRL_WAITP_3WS                                      0x00000003U
#define FLASH_ACCTRL_WAITP_4WS                                      0x00000004U
#define FLASH_ACCTRL_WAITP_5WS                                      0x00000005U
#define FLASH_ACCTRL_WAITP_6WS                                      0x00000006U
#define FLASH_ACCTRL_WAITP_7WS                                      0x00000007U


#define FLASH_ACCTRL_PREFEN_Pos                                     (8U)
#define FLASH_ACCTRL_PREFEN_Msk                                     (0x1UL << FLASH_ACCTRL_PREFEN_Pos)                             /*!< 0x00000100 */
#define FLASH_ACCTRL_PREFEN                                         FLASH_ACCTRL_PREFEN_Msk
#define FLASH_ACCTRL_ICACHEEN_Pos                                   (9U)
#define FLASH_ACCTRL_ICACHEEN_Msk                                   (0x1UL << FLASH_ACCTRL_ICACHEEN_Pos)                           /*!< 0x00000200 */
#define FLASH_ACCTRL_ICACHEEN                                       FLASH_ACCTRL_ICACHEEN_Msk
#define FLASH_ACCTRL_DCACHEEN_Pos                                   (10U)
#define FLASH_ACCTRL_DCACHEEN_Msk                                   (0x1UL << FLASH_ACCTRL_DCACHEEN_Pos)                           /*!< 0x00000400 */
#define FLASH_ACCTRL_DCACHEEN                                       FLASH_ACCTRL_DCACHEEN_Msk
#define FLASH_ACCTRL_ICACHERST_Pos                                  (11U)
#define FLASH_ACCTRL_ICACHERST_Msk                                  (0x1UL << FLASH_ACCTRL_ICACHERST_Pos)                          /*!< 0x00000800 */
#define FLASH_ACCTRL_ICACHERST                                      FLASH_ACCTRL_ICACHERST_Msk
#define FLASH_ACCTRL_DCACHERST_Pos                                  (12U)
#define FLASH_ACCTRL_DCACHERST_Msk                                  (0x1UL << FLASH_ACCTRL_DCACHERST_Pos)                          /*!< 0x00001000 */
#define FLASH_ACCTRL_DCACHERST                                      FLASH_ACCTRL_DCACHERST_Msk
#define FLASH_ACCTRL_BYTE0_ADDRESS_Pos                              (10U)
#define FLASH_ACCTRL_BYTE0_ADDRESS_Msk                              (0x10008FUL << FLASH_ACCTRL_BYTE0_ADDRESS_Pos)                 /*!< 0x40023C00 */
#define FLASH_ACCTRL_BYTE0_ADDRESS                                  FLASH_ACCTRL_BYTE0_ADDRESS_Msk
#define FLASH_ACCTRL_BYTE2_ADDRESS_Pos                              (0U)
#define FLASH_ACCTRL_BYTE2_ADDRESS_Msk                              (0x40023C03UL << FLASH_ACCTRL_BYTE2_ADDRESS_Pos)               /*!< 0x40023C03 */
#define FLASH_ACCTRL_BYTE2_ADDRESS                                  FLASH_ACCTRL_BYTE2_ADDRESS_Msk

/*******************  Bits definition for FMC_STS register  ******************/
#define FLASH_STS_OPRCMP_Pos                                        (0U)
#define FLASH_STS_OPRCMP_Msk                                        (0x1UL << FLASH_STS_OPRCMP_Pos)                                /*!< 0x00000001 */
#define FLASH_STS_OPRCMP                                            FLASH_STS_OPRCMP_Msk
#define FLASH_STS_OPRERR_Pos                                        (1U)
#define FLASH_STS_OPRERR_Msk                                        (0x1UL << FLASH_STS_OPRERR_Pos)                                /*!< 0x00000002 */
#define FLASH_STS_OPRERR                                            FLASH_STS_OPRERR_Msk
#define FLASH_STS_WPROTERR_Pos                                      (4U)
#define FLASH_STS_WPROTERR_Msk                                      (0x1UL << FLASH_STS_WPROTERR_Pos)                              /*!< 0x00000010 */
#define FLASH_STS_WPROTERR                                          FLASH_STS_WPROTERR_Msk
#define FLASH_STS_PGALGERR_Pos                                      (5U)
#define FLASH_STS_PGALGERR_Msk                                      (0x1UL << FLASH_STS_PGALGERR_Pos)                              /*!< 0x00000020 */
#define FLASH_STS_PGALGERR                                          FLASH_STS_PGALGERR_Msk
#define FLASH_STS_PGPRLERR_Pos                                      (6U)
#define FLASH_STS_PGPRLERR_Msk                                      (0x1UL << FLASH_STS_PGPRLERR_Pos)                              /*!< 0x00000040 */
#define FLASH_STS_PGPRLERR                                          FLASH_STS_PGPRLERR_Msk
#define FLASH_STS_PGSEQERR_Pos                                      (7U)
#define FLASH_STS_PGSEQERR_Msk                                      (0x1UL << FLASH_STS_PGSEQERR_Pos)                              /*!< 0x00000080 */
#define FLASH_STS_PGSEQERR                                          FLASH_STS_PGSEQERR_Msk
#define FLASH_STS_BUSY_Pos                                          (16U)
#define FLASH_STS_BUSY_Msk                                          (0x1UL << FLASH_STS_BUSY_Pos)                                  /*!< 0x00010000 */
#define FLASH_STS_BUSY                                              FLASH_STS_BUSY_Msk

/*******************  Bits definition for FMC_CTRL register  ******************/
#define FLASH_CTRL_PG_Pos                                           (0U)
#define FLASH_CTRL_PG_Msk                                           (0x1UL << FLASH_CTRL_PG_Pos)                                   /*!< 0x00000001 */
#define FLASH_CTRL_PG                                               FLASH_CTRL_PG_Msk
#define FLASH_CTRL_SERS_Pos                                         (1U)
#define FLASH_CTRL_SERS_Msk                                         (0x1UL << FLASH_CTRL_SERS_Pos)                                 /*!< 0x00000002 */
#define FLASH_CTRL_SERS                                             FLASH_CTRL_SERS_Msk
#define FLASH_CTRL_MERS_Pos                                         (2U)
#define FLASH_CTRL_MERS_Msk                                         (0x1UL << FLASH_CTRL_MERS_Pos)                                 /*!< 0x00000004 */
#define FLASH_CTRL_MERS                                             FLASH_CTRL_MERS_Msk
#define FLASH_CTRL_SNUM_Pos                                         (3U)
#define FLASH_CTRL_SNUM_Msk                                         (0x1FUL << FLASH_CTRL_SNUM_Pos)                                /*!< 0x000000F8 */
#define FLASH_CTRL_SNUM                                             FLASH_CTRL_SNUM_Msk
#define FLASH_CTRL_SNUM_0                                           (0x01UL << FLASH_CTRL_SNUM_Pos)                                /*!< 0x00000008 */
#define FLASH_CTRL_SNUM_1                                           (0x02UL << FLASH_CTRL_SNUM_Pos)                                /*!< 0x00000010 */
#define FLASH_CTRL_SNUM_2                                           (0x04UL << FLASH_CTRL_SNUM_Pos)                                /*!< 0x00000020 */
#define FLASH_CTRL_SNUM_3                                           (0x08UL << FLASH_CTRL_SNUM_Pos)                                /*!< 0x00000040 */
#define FLASH_CTRL_SNUM_4                                           (0x10UL << FLASH_CTRL_SNUM_Pos)                                /*!< 0x00000080 */
#define FLASH_CTRL_PGSIZE_Pos                                       (8U)
#define FLASH_CTRL_PGSIZE_Msk                                       (0x3UL << FLASH_CTRL_PGSIZE_Pos)                               /*!< 0x00000300 */
#define FLASH_CTRL_PGSIZE                                           FLASH_CTRL_PGSIZE_Msk
#define FLASH_CTRL_PGSIZE_0                                         (0x1UL << FLASH_CTRL_PGSIZE_Pos)                               /*!< 0x00000100 */
#define FLASH_CTRL_PGSIZE_1                                         (0x2UL << FLASH_CTRL_PGSIZE_Pos)                               /*!< 0x00000200 */
#define FLASH_CTRL_START_Pos                                        (16U)
#define FLASH_CTRL_START_Msk                                        (0x1UL << FLASH_CTRL_START_Pos)                                /*!< 0x00010000 */
#define FLASH_CTRL_START                                            FLASH_CTRL_START_Msk
#define FLASH_CTRL_OPCINTEN_Pos                                     (24U)
#define FLASH_CTRL_OPCINTEN_Msk                                     (0x1UL << FLASH_CTRL_OPCINTEN_Pos)                             /*!< 0x01000000 */
#define FLASH_CTRL_OPCINTEN                                         FLASH_CTRL_OPCINTEN_Msk
#define FLASH_CTRL_ERRINTEN_Pos                                     (25U)
#define FLASH_CTRL_ERRINTEN_Msk                                     (0x1UL << FLASH_CTRL_ERRINTEN_Pos)
#define FLASH_CTRL_ERRINTEN                                         FLASH_CTRL_ERRINTEN_Msk
#define FLASH_CTRL_LOCK_Pos                                         (31U)
#define FLASH_CTRL_LOCK_Msk                                         (0x1UL << FLASH_CTRL_LOCK_Pos)                                 /*!< 0x80000000 */
#define FLASH_CTRL_LOCK                                             FLASH_CTRL_LOCK_Msk

