betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f417xx.h
#define SMC_CMSTIM2_WAIT2_Pos                                       (8U)
#define SMC_CMSTIM2_WAIT2_Msk                                       (0xFFUL << SMC_CMSTIM2_WAIT2_Pos)                              /*!< 0x0000FF00 */
#define SMC_CMSTIM2_WAIT2                                           SMC_CMSTIM2_WAIT2_Msk                                          /*!<MEMWAIT2[7:0] bits (Common memory 2 wait time) */
#define SMC_CMSTIM2_WAIT2_0                                         (0x01UL << SMC_CMSTIM2_WAIT2_Pos)                              /*!< 0x00000100 */
#define SMC_CMSTIM2_WAIT2_1                                         (0x02UL << SMC_CMSTIM2_WAIT2_Pos)                              /*!< 0x00000200 */
#define SMC_CMSTIM2_WAIT2_2                                         (0x04UL << SMC_CMSTIM2_WAIT2_Pos)                              /*!< 0x00000400 */
#define SMC_CMSTIM2_WAIT2_3                                         (0x08UL << SMC_CMSTIM2_WAIT2_Pos)                              /*!< 0x00000800 */
#define SMC_CMSTIM2_WAIT2_4                                         (0x10UL << SMC_CMSTIM2_WAIT2_Pos)                              /*!< 0x00001000 */
#define SMC_CMSTIM2_WAIT2_5                                         (0x20UL << SMC_CMSTIM2_WAIT2_Pos)                              /*!< 0x00002000 */
#define SMC_CMSTIM2_WAIT2_6                                         (0x40UL << SMC_CMSTIM2_WAIT2_Pos)                              /*!< 0x00004000 */
#define SMC_CMSTIM2_WAIT2_7                                         (0x80UL << SMC_CMSTIM2_WAIT2_Pos)                              /*!< 0x00008000 */

#define SMC_CMSTIM2_HLD2_Pos                                        (16U)
#define SMC_CMSTIM2_HLD2_Msk                                        (0xFFUL << SMC_CMSTIM2_HLD2_Pos)                               /*!< 0x00FF0000 */
#define SMC_CMSTIM2_HLD2                                            SMC_CMSTIM2_HLD2_Msk                                           /*!<MEMHOLD2[7:0] bits (Common memory 2 hold time) */
#define SMC_CMSTIM2_HLD2_0                                          (0x01UL << SMC_CMSTIM2_HLD2_Pos)                               /*!< 0x00010000 */
#define SMC_CMSTIM2_HLD2_1                                          (0x02UL << SMC_CMSTIM2_HLD2_Pos)                               /*!< 0x00020000 */
#define SMC_CMSTIM2_HLD2_2                                          (0x04UL << SMC_CMSTIM2_HLD2_Pos)                               /*!< 0x00040000 */
#define SMC_CMSTIM2_HLD2_3                                          (0x08UL << SMC_CMSTIM2_HLD2_Pos)                               /*!< 0x00080000 */
#define SMC_CMSTIM2_HLD2_4                                          (0x10UL << SMC_CMSTIM2_HLD2_Pos)                               /*!< 0x00100000 */
#define SMC_CMSTIM2_HLD2_5                                          (0x20UL << SMC_CMSTIM2_HLD2_Pos)                               /*!< 0x00200000 */
#define SMC_CMSTIM2_HLD2_6                                          (0x40UL << SMC_CMSTIM2_HLD2_Pos)                               /*!< 0x00400000 */
#define SMC_CMSTIM2_HLD2_7                                          (0x80UL << SMC_CMSTIM2_HLD2_Pos)                               /*!< 0x00800000 */

#define SMC_CMSTIM2_HIZ2_Pos                                        (24U)
#define SMC_CMSTIM2_HIZ2_Msk                                        (0xFFUL << SMC_CMSTIM2_HIZ2_Pos)                               /*!< 0xFF000000 */
#define SMC_CMSTIM2_HIZ2                                            SMC_CMSTIM2_HIZ2_Msk                                           /*!<MEMHIZ2[7:0] bits (Common memory 2 databus HiZ time) */
#define SMC_CMSTIM2_HIZ2_0                                          (0x01UL << SMC_CMSTIM2_HIZ2_Pos)                               /*!< 0x01000000 */
#define SMC_CMSTIM2_HIZ2_1                                          (0x02UL << SMC_CMSTIM2_HIZ2_Pos)                               /*!< 0x02000000 */
#define SMC_CMSTIM2_HIZ2_2                                          (0x04UL << SMC_CMSTIM2_HIZ2_Pos)                               /*!< 0x04000000 */
#define SMC_CMSTIM2_HIZ2_3                                          (0x08UL << SMC_CMSTIM2_HIZ2_Pos)                               /*!< 0x08000000 */
#define SMC_CMSTIM2_HIZ2_4                                          (0x10UL << SMC_CMSTIM2_HIZ2_Pos)                               /*!< 0x10000000 */
#define SMC_CMSTIM2_HIZ2_5                                          (0x20UL << SMC_CMSTIM2_HIZ2_Pos)                               /*!< 0x20000000 */
#define SMC_CMSTIM2_HIZ2_6                                          (0x40UL << SMC_CMSTIM2_HIZ2_Pos)                               /*!< 0x40000000 */
#define SMC_CMSTIM2_HIZ2_7                                          (0x80UL << SMC_CMSTIM2_HIZ2_Pos)                               /*!< 0x80000000 */

/******************  Bit definition for SMC_CMSTIM3 register  ******************/
#define SMC_CMSTIM3_SET3_Pos                                        (0U)
#define SMC_CMSTIM3_SET3_Msk                                        (0xFFUL << SMC_CMSTIM3_SET3_Pos)                               /*!< 0x000000FF */
#define SMC_CMSTIM3_SET3                                            SMC_CMSTIM3_SET3_Msk                                           /*!<MEMSET3[7:0] bits (Common memory 3 setup time) */
#define SMC_CMSTIM3_SET3_0                                          (0x01UL << SMC_CMSTIM3_SET3_Pos)                               /*!< 0x00000001 */
#define SMC_CMSTIM3_SET3_1                                          (0x02UL << SMC_CMSTIM3_SET3_Pos)                               /*!< 0x00000002 */
#define SMC_CMSTIM3_SET3_2                                          (0x04UL << SMC_CMSTIM3_SET3_Pos)                               /*!< 0x00000004 */
#define SMC_CMSTIM3_SET3_3                                          (0x08UL << SMC_CMSTIM3_SET3_Pos)                               /*!< 0x00000008 */
#define SMC_CMSTIM3_SET3_4                                          (0x10UL << SMC_CMSTIM3_SET3_Pos)                               /*!< 0x00000010 */
#define SMC_CMSTIM3_SET3_5                                          (0x20UL << SMC_CMSTIM3_SET3_Pos)                               /*!< 0x00000020 */
#define SMC_CMSTIM3_SET3_6                                          (0x40UL << SMC_CMSTIM3_SET3_Pos)                               /*!< 0x00000040 */
#define SMC_CMSTIM3_SET3_7                                          (0x80UL << SMC_CMSTIM3_SET3_Pos)                               /*!< 0x00000080 */

#define SMC_CMSTIM3_WAIT3_Pos                                       (8U)
#define SMC_CMSTIM3_WAIT3_Msk                                       (0xFFUL << SMC_CMSTIM3_WAIT3_Pos)                              /*!< 0x0000FF00 */
#define SMC_CMSTIM3_WAIT3                                           SMC_CMSTIM3_WAIT3_Msk                                          /*!<MEMWAIT3[7:0] bits (Common memory 3 wait time) */
#define SMC_CMSTIM3_WAIT3_0                                         (0x01UL << SMC_CMSTIM3_WAIT3_Pos)                              /*!< 0x00000100 */
#define SMC_CMSTIM3_WAIT3_1                                         (0x02UL << SMC_CMSTIM3_WAIT3_Pos)                              /*!< 0x00000200 */
#define SMC_CMSTIM3_WAIT3_2                                         (0x04UL << SMC_CMSTIM3_WAIT3_Pos)                              /*!< 0x00000400 */
#define SMC_CMSTIM3_WAIT3_3                                         (0x08UL << SMC_CMSTIM3_WAIT3_Pos)                              /*!< 0x00000800 */
#define SMC_CMSTIM3_WAIT3_4                                         (0x10UL << SMC_CMSTIM3_WAIT3_Pos)                              /*!< 0x00001000 */
#define SMC_CMSTIM3_WAIT3_5                                         (0x20UL << SMC_CMSTIM3_WAIT3_Pos)                              /*!< 0x00002000 */
#define SMC_CMSTIM3_WAIT3_6                                         (0x40UL << SMC_CMSTIM3_WAIT3_Pos)                              /*!< 0x00004000 */
#define SMC_CMSTIM3_WAIT3_7                                         (0x80UL << SMC_CMSTIM3_WAIT3_Pos)                              /*!< 0x00008000 */

#define SMC_CMSTIM3_HLD3_Pos                                        (16U)
#define SMC_CMSTIM3_HLD3_Msk                                        (0xFFUL << SMC_CMSTIM3_HLD3_Pos)                               /*!< 0x00FF0000 */
#define SMC_CMSTIM3_HLD3                                            SMC_CMSTIM3_HLD3_Msk                                           /*!<MEMHOLD3[7:0] bits (Common memory 3 hold time) */
#define SMC_CMSTIM3_HLD3_0                                          (0x01UL << SMC_CMSTIM3_HLD3_Pos)                               /*!< 0x00010000 */
#define SMC_CMSTIM3_HLD3_1                                          (0x02UL << SMC_CMSTIM3_HLD3_Pos)                               /*!< 0x00020000 */
#define SMC_CMSTIM3_HLD3_2                                          (0x04UL << SMC_CMSTIM3_HLD3_Pos)                               /*!< 0x00040000 */
#define SMC_CMSTIM3_HLD3_3                                          (0x08UL << SMC_CMSTIM3_HLD3_Pos)                               /*!< 0x00080000 */
#define SMC_CMSTIM3_HLD3_4                                          (0x10UL << SMC_CMSTIM3_HLD3_Pos)                               /*!< 0x00100000 */
#define SMC_CMSTIM3_HLD3_5                                          (0x20UL << SMC_CMSTIM3_HLD3_Pos)                               /*!< 0x00200000 */
#define SMC_CMSTIM3_HLD3_6                                          (0x40UL << SMC_CMSTIM3_HLD3_Pos)                               /*!< 0x00400000 */
#define SMC_CMSTIM3_HLD3_7                                          (0x80UL << SMC_CMSTIM3_HLD3_Pos)                               /*!< 0x00800000 */

#define SMC_CMSTIM3_HIZ3_Pos                                        (24U)
#define SMC_CMSTIM3_HIZ3_Msk                                        (0xFFUL << SMC_CMSTIM3_HIZ3_Pos)                               /*!< 0xFF000000 */
#define SMC_CMSTIM3_HIZ3                                            SMC_CMSTIM3_HIZ3_Msk                                           /*!<MEMHIZ3[7:0] bits (Common memory 3 databus HiZ time) */
#define SMC_CMSTIM3_HIZ3_0                                          (0x01UL << SMC_CMSTIM3_HIZ3_Pos)                               /*!< 0x01000000 */
#define SMC_CMSTIM3_HIZ3_1                                          (0x02UL << SMC_CMSTIM3_HIZ3_Pos)                               /*!< 0x02000000 */
#define SMC_CMSTIM3_HIZ3_2                                          (0x04UL << SMC_CMSTIM3_HIZ3_Pos)                               /*!< 0x04000000 */
#define SMC_CMSTIM3_HIZ3_3                                          (0x08UL << SMC_CMSTIM3_HIZ3_Pos)                               /*!< 0x08000000 */
#define SMC_CMSTIM3_HIZ3_4                                          (0x10UL << SMC_CMSTIM3_HIZ3_Pos)                               /*!< 0x10000000 */
#define SMC_CMSTIM3_HIZ3_5                                          (0x20UL << SMC_CMSTIM3_HIZ3_Pos)                               /*!< 0x20000000 */
#define SMC_CMSTIM3_HIZ3_6                                          (0x40UL << SMC_CMSTIM3_HIZ3_Pos)                               /*!< 0x40000000 */
#define SMC_CMSTIM3_HIZ3_7                                          (0x80UL << SMC_CMSTIM3_HIZ3_Pos)                               /*!< 0x80000000 */

/******************  Bit definition for SMC_CMSTIM4 register  ******************/
#define SMC_CMSTIM4_SET4_Pos                                        (0U)
#define SMC_CMSTIM4_SET4_Msk                                        (0xFFUL << SMC_CMSTIM4_SET4_Pos)                               /*!< 0x000000FF */
#define SMC_CMSTIM4_SET4                                            SMC_CMSTIM4_SET4_Msk                                           /*!<MEMSET4[7:0] bits (Common memory 4 setup time) */
#define SMC_CMSTIM4_SET4_0                                          (0x01UL << SMC_CMSTIM4_SET4_Pos)                               /*!< 0x00000001 */
#define SMC_CMSTIM4_SET4_1                                          (0x02UL << SMC_CMSTIM4_SET4_Pos)                               /*!< 0x00000002 */
#define SMC_CMSTIM4_SET4_2                                          (0x04UL << SMC_CMSTIM4_SET4_Pos)                               /*!< 0x00000004 */
#define SMC_CMSTIM4_SET4_3                                          (0x08UL << SMC_CMSTIM4_SET4_Pos)                               /*!< 0x00000008 */
#define SMC_CMSTIM4_SET4_4                                          (0x10UL << SMC_CMSTIM4_SET4_Pos)                               /*!< 0x00000010 */
#define SMC_CMSTIM4_SET4_5                                          (0x20UL << SMC_CMSTIM4_SET4_Pos)                               /*!< 0x00000020 */
#define SMC_CMSTIM4_SET4_6                                          (0x40UL << SMC_CMSTIM4_SET4_Pos)                               /*!< 0x00000040 */
#define SMC_CMSTIM4_SET4_7                                          (0x80UL << SMC_CMSTIM4_SET4_Pos)                               /*!< 0x00000080 */

