betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f417xx.h
/* Legacy defines */
#define GPIO_IDATA_IDR_0                                            GPIO_IDATA_IDATA0
#define GPIO_IDATA_IDR_1                                            GPIO_IDATA_IDATA1
#define GPIO_IDATA_IDR_2                                            GPIO_IDATA_IDATA2
#define GPIO_IDATA_IDR_3                                            GPIO_IDATA_IDATA3
#define GPIO_IDATA_IDR_4                                            GPIO_IDATA_IDATA4
#define GPIO_IDATA_IDR_5                                            GPIO_IDATA_IDATA5
#define GPIO_IDATA_IDR_6                                            GPIO_IDATA_IDATA6
#define GPIO_IDATA_IDR_7                                            GPIO_IDATA_IDATA7
#define GPIO_IDATA_IDR_8                                            GPIO_IDATA_IDATA8
#define GPIO_IDATA_IDR_9                                            GPIO_IDATA_IDATA9
#define GPIO_IDATA_IDR_10                                           GPIO_IDATA_IDATA10
#define GPIO_IDATA_IDR_11                                           GPIO_IDATA_IDATA11
#define GPIO_IDATA_IDR_12                                           GPIO_IDATA_IDATA12
#define GPIO_IDATA_IDR_13                                           GPIO_IDATA_IDATA13
#define GPIO_IDATA_IDR_14                                           GPIO_IDATA_IDATA14
#define GPIO_IDATA_IDR_15                                           GPIO_IDATA_IDATA15

/******************  Bits definition for GPIO_ODATA register  *******************/
#define GPIO_ODATA_ODATA0_Pos                                       (0U)
#define GPIO_ODATA_ODATA0_Msk                                       (0x1UL << GPIO_ODATA_ODATA0_Pos)                               /*!< 0x00000001 */
#define GPIO_ODATA_ODATA0                                           GPIO_ODATA_ODATA0_Msk
#define GPIO_ODATA_ODATA1_Pos                                       (1U)
#define GPIO_ODATA_ODATA1_Msk                                       (0x1UL << GPIO_ODATA_ODATA1_Pos)                               /*!< 0x00000002 */
#define GPIO_ODATA_ODATA1                                           GPIO_ODATA_ODATA1_Msk
#define GPIO_ODATA_ODATA2_Pos                                       (2U)
#define GPIO_ODATA_ODATA2_Msk                                       (0x1UL << GPIO_ODATA_ODATA2_Pos)                               /*!< 0x00000004 */
#define GPIO_ODATA_ODATA2                                           GPIO_ODATA_ODATA2_Msk
#define GPIO_ODATA_ODATA3_Pos                                       (3U)
#define GPIO_ODATA_ODATA3_Msk                                       (0x1UL << GPIO_ODATA_ODATA3_Pos)                               /*!< 0x00000008 */
#define GPIO_ODATA_ODATA3                                           GPIO_ODATA_ODATA3_Msk
#define GPIO_ODATA_ODATA4_Pos                                       (4U)
#define GPIO_ODATA_ODATA4_Msk                                       (0x1UL << GPIO_ODATA_ODATA4_Pos)                               /*!< 0x00000010 */
#define GPIO_ODATA_ODATA4                                           GPIO_ODATA_ODATA4_Msk
#define GPIO_ODATA_ODATA5_Pos                                       (5U)
#define GPIO_ODATA_ODATA5_Msk                                       (0x1UL << GPIO_ODATA_ODATA5_Pos)                               /*!< 0x00000020 */
#define GPIO_ODATA_ODATA5                                           GPIO_ODATA_ODATA5_Msk
#define GPIO_ODATA_ODATA6_Pos                                       (6U)
#define GPIO_ODATA_ODATA6_Msk                                       (0x1UL << GPIO_ODATA_ODATA6_Pos)                               /*!< 0x00000040 */
#define GPIO_ODATA_ODATA6                                           GPIO_ODATA_ODATA6_Msk
#define GPIO_ODATA_ODATA7_Pos                                       (7U)
#define GPIO_ODATA_ODATA7_Msk                                       (0x1UL << GPIO_ODATA_ODATA7_Pos)                               /*!< 0x00000080 */
#define GPIO_ODATA_ODATA7                                           GPIO_ODATA_ODATA7_Msk
#define GPIO_ODATA_ODATA8_Pos                                       (8U)
#define GPIO_ODATA_ODATA8_Msk                                       (0x1UL << GPIO_ODATA_ODATA8_Pos)                               /*!< 0x00000100 */
#define GPIO_ODATA_ODATA8                                           GPIO_ODATA_ODATA8_Msk
#define GPIO_ODATA_ODATA9_Pos                                       (9U)
#define GPIO_ODATA_ODATA9_Msk                                       (0x1UL << GPIO_ODATA_ODATA9_Pos)                               /*!< 0x00000200 */
#define GPIO_ODATA_ODATA9                                           GPIO_ODATA_ODATA9_Msk
#define GPIO_ODATA_ODATA10_Pos                                      (10U)
#define GPIO_ODATA_ODATA10_Msk                                      (0x1UL << GPIO_ODATA_ODATA10_Pos)                              /*!< 0x00000400 */
#define GPIO_ODATA_ODATA10                                          GPIO_ODATA_ODATA10_Msk
#define GPIO_ODATA_ODATA11_Pos                                      (11U)
#define GPIO_ODATA_ODATA11_Msk                                      (0x1UL << GPIO_ODATA_ODATA11_Pos)                              /*!< 0x00000800 */
#define GPIO_ODATA_ODATA11                                          GPIO_ODATA_ODATA11_Msk
#define GPIO_ODATA_ODATA12_Pos                                      (12U)
#define GPIO_ODATA_ODATA12_Msk                                      (0x1UL << GPIO_ODATA_ODATA12_Pos)                              /*!< 0x00001000 */
#define GPIO_ODATA_ODATA12                                          GPIO_ODATA_ODATA12_Msk
#define GPIO_ODATA_ODATA13_Pos                                      (13U)
#define GPIO_ODATA_ODATA13_Msk                                      (0x1UL << GPIO_ODATA_ODATA13_Pos)                              /*!< 0x00002000 */
#define GPIO_ODATA_ODATA13                                          GPIO_ODATA_ODATA13_Msk
#define GPIO_ODATA_ODATA14_Pos                                      (14U)
#define GPIO_ODATA_ODATA14_Msk                                      (0x1UL << GPIO_ODATA_ODATA14_Pos)                              /*!< 0x00004000 */
#define GPIO_ODATA_ODATA14                                          GPIO_ODATA_ODATA14_Msk
#define GPIO_ODATA_ODATA15_Pos                                      (15U)
#define GPIO_ODATA_ODATA15_Msk                                      (0x1UL << GPIO_ODATA_ODATA15_Pos)                              /*!< 0x00008000 */
#define GPIO_ODATA_ODATA15                                          GPIO_ODATA_ODATA15_Msk
/* Legacy defines */
#define GPIO_ODATA_ODR_0                                            GPIO_ODATA_ODATA0
#define GPIO_ODATA_ODR_1                                            GPIO_ODATA_ODATA1
#define GPIO_ODATA_ODR_2                                            GPIO_ODATA_ODATA2
#define GPIO_ODATA_ODR_3                                            GPIO_ODATA_ODATA3
#define GPIO_ODATA_ODR_4                                            GPIO_ODATA_ODATA4
#define GPIO_ODATA_ODR_5                                            GPIO_ODATA_ODATA5
#define GPIO_ODATA_ODR_6                                            GPIO_ODATA_ODATA6
#define GPIO_ODATA_ODR_7                                            GPIO_ODATA_ODATA7
#define GPIO_ODATA_ODR_8                                            GPIO_ODATA_ODATA8
#define GPIO_ODATA_ODR_9                                            GPIO_ODATA_ODATA9
#define GPIO_ODATA_ODR_10                                           GPIO_ODATA_ODATA10
#define GPIO_ODATA_ODR_11                                           GPIO_ODATA_ODATA11
#define GPIO_ODATA_ODR_12                                           GPIO_ODATA_ODATA12
#define GPIO_ODATA_ODR_13                                           GPIO_ODATA_ODATA13
#define GPIO_ODATA_ODR_14                                           GPIO_ODATA_ODATA14
#define GPIO_ODATA_ODR_15                                           GPIO_ODATA_ODATA15

/******************  Bits definition for GPIO_BSC register  ******************/
#define GPIO_BSC_BS0_Pos                                            (0U)
#define GPIO_BSC_BS0_Msk                                            (0x1UL << GPIO_BSC_BS0_Pos)                                    /*!< 0x00000001 */
#define GPIO_BSC_BS0                                                GPIO_BSC_BS0_Msk
#define GPIO_BSC_BS1_Pos                                            (1U)
#define GPIO_BSC_BS1_Msk                                            (0x1UL << GPIO_BSC_BS1_Pos)                                    /*!< 0x00000002 */
#define GPIO_BSC_BS1                                                GPIO_BSC_BS1_Msk
#define GPIO_BSC_BS2_Pos                                            (2U)
#define GPIO_BSC_BS2_Msk                                            (0x1UL << GPIO_BSC_BS2_Pos)                                    /*!< 0x00000004 */
#define GPIO_BSC_BS2                                                GPIO_BSC_BS2_Msk
#define GPIO_BSC_BS3_Pos                                            (3U)
#define GPIO_BSC_BS3_Msk                                            (0x1UL << GPIO_BSC_BS3_Pos)                                    /*!< 0x00000008 */
#define GPIO_BSC_BS3                                                GPIO_BSC_BS3_Msk
#define GPIO_BSC_BS4_Pos                                            (4U)
#define GPIO_BSC_BS4_Msk                                            (0x1UL << GPIO_BSC_BS4_Pos)                                    /*!< 0x00000010 */
#define GPIO_BSC_BS4                                                GPIO_BSC_BS4_Msk
#define GPIO_BSC_BS5_Pos                                            (5U)
#define GPIO_BSC_BS5_Msk                                            (0x1UL << GPIO_BSC_BS5_Pos)                                    /*!< 0x00000020 */
#define GPIO_BSC_BS5                                                GPIO_BSC_BS5_Msk
#define GPIO_BSC_BS6_Pos                                            (6U)
#define GPIO_BSC_BS6_Msk                                            (0x1UL << GPIO_BSC_BS6_Pos)                                    /*!< 0x00000040 */
#define GPIO_BSC_BS6                                                GPIO_BSC_BS6_Msk
#define GPIO_BSC_BS7_Pos                                            (7U)
#define GPIO_BSC_BS7_Msk                                            (0x1UL << GPIO_BSC_BS7_Pos)                                    /*!< 0x00000080 */
#define GPIO_BSC_BS7                                                GPIO_BSC_BS7_Msk
#define GPIO_BSC_BS8_Pos                                            (8U)
#define GPIO_BSC_BS8_Msk                                            (0x1UL << GPIO_BSC_BS8_Pos)                                    /*!< 0x00000100 */
#define GPIO_BSC_BS8                                                GPIO_BSC_BS8_Msk
#define GPIO_BSC_BS9_Pos                                            (9U)
#define GPIO_BSC_BS9_Msk                                            (0x1UL << GPIO_BSC_BS9_Pos)                                    /*!< 0x00000200 */
#define GPIO_BSC_BS9                                                GPIO_BSC_BS9_Msk
#define GPIO_BSC_BS10_Pos                                           (10U)
#define GPIO_BSC_BS10_Msk                                           (0x1UL << GPIO_BSC_BS10_Pos)                                   /*!< 0x00000400 */
#define GPIO_BSC_BS10                                               GPIO_BSC_BS10_Msk
#define GPIO_BSC_BS11_Pos                                           (11U)
#define GPIO_BSC_BS11_Msk                                           (0x1UL << GPIO_BSC_BS11_Pos)                                   /*!< 0x00000800 */
#define GPIO_BSC_BS11                                               GPIO_BSC_BS11_Msk
#define GPIO_BSC_BS12_Pos                                           (12U)
#define GPIO_BSC_BS12_Msk                                           (0x1UL << GPIO_BSC_BS12_Pos)                                   /*!< 0x00001000 */
#define GPIO_BSC_BS12                                               GPIO_BSC_BS12_Msk
#define GPIO_BSC_BS13_Pos                                           (13U)
#define GPIO_BSC_BS13_Msk                                           (0x1UL << GPIO_BSC_BS13_Pos)                                   /*!< 0x00002000 */
#define GPIO_BSC_BS13                                               GPIO_BSC_BS13_Msk
#define GPIO_BSC_BS14_Pos                                           (14U)
#define GPIO_BSC_BS14_Msk                                           (0x1UL << GPIO_BSC_BS14_Pos)                                   /*!< 0x00004000 */
#define GPIO_BSC_BS14                                               GPIO_BSC_BS14_Msk
#define GPIO_BSC_BS15_Pos                                           (15U)
#define GPIO_BSC_BS15_Msk                                           (0x1UL << GPIO_BSC_BS15_Pos)                                   /*!< 0x00008000 */
#define GPIO_BSC_BS15                                               GPIO_BSC_BS15_Msk
#define GPIO_BSC_BC0_Pos                                            (16U)
#define GPIO_BSC_BC0_Msk                                            (0x1UL << GPIO_BSC_BC0_Pos)                                    /*!< 0x00010000 */
#define GPIO_BSC_BC0                                                GPIO_BSC_BC0_Msk
#define GPIO_BSC_BC1_Pos                                            (17U)
#define GPIO_BSC_BC1_Msk                                            (0x1UL << GPIO_BSC_BC1_Pos)                                    /*!< 0x00020000 */
#define GPIO_BSC_BC1                                                GPIO_BSC_BC1_Msk
#define GPIO_BSC_BC2_Pos                                            (18U)
#define GPIO_BSC_BC2_Msk                                            (0x1UL << GPIO_BSC_BC2_Pos)                                    /*!< 0x00040000 */
#define GPIO_BSC_BC2                                                GPIO_BSC_BC2_Msk
#define GPIO_BSC_BC3_Pos                                            (19U)
#define GPIO_BSC_BC3_Msk                                            (0x1UL << GPIO_BSC_BC3_Pos)                                    /*!< 0x00080000 */
#define GPIO_BSC_BC3                                                GPIO_BSC_BC3_Msk
#define GPIO_BSC_BC4_Pos                                            (20U)
#define GPIO_BSC_BC4_Msk                                            (0x1UL << GPIO_BSC_BC4_Pos)                                    /*!< 0x00100000 */
#define GPIO_BSC_BC4                                                GPIO_BSC_BC4_Msk
#define GPIO_BSC_BC5_Pos                                            (21U)
#define GPIO_BSC_BC5_Msk                                            (0x1UL << GPIO_BSC_BC5_Pos)                                    /*!< 0x00200000 */
#define GPIO_BSC_BC5                                                GPIO_BSC_BC5_Msk
#define GPIO_BSC_BC6_Pos                                            (22U)
#define GPIO_BSC_BC6_Msk                                            (0x1UL << GPIO_BSC_BC6_Pos)                                    /*!< 0x00400000 */
#define GPIO_BSC_BC6                                                GPIO_BSC_BC6_Msk
#define GPIO_BSC_BC7_Pos                                            (23U)
#define GPIO_BSC_BC7_Msk                                            (0x1UL << GPIO_BSC_BC7_Pos)                                    /*!< 0x00800000 */
#define GPIO_BSC_BC7                                                GPIO_BSC_BC7_Msk
#define GPIO_BSC_BC8_Pos                                            (24U)
#define GPIO_BSC_BC8_Msk                                            (0x1UL << GPIO_BSC_BC8_Pos)                                    /*!< 0x01000000 */
#define GPIO_BSC_BC8                                                GPIO_BSC_BC8_Msk
#define GPIO_BSC_BC9_Pos                                            (25U)
#define GPIO_BSC_BC9_Msk                                            (0x1UL << GPIO_BSC_BC9_Pos)                                    /*!< 0x02000000 */
#define GPIO_BSC_BC9                                                GPIO_BSC_BC9_Msk
#define GPIO_BSC_BC10_Pos                                           (26U)
#define GPIO_BSC_BC10_Msk                                           (0x1UL << GPIO_BSC_BC10_Pos)                                   /*!< 0x04000000 */
#define GPIO_BSC_BC10                                               GPIO_BSC_BC10_Msk
#define GPIO_BSC_BC11_Pos                                           (27U)
#define GPIO_BSC_BC11_Msk                                           (0x1UL << GPIO_BSC_BC11_Pos)                                   /*!< 0x08000000 */
#define GPIO_BSC_BC11                                               GPIO_BSC_BC11_Msk
#define GPIO_BSC_BC12_Pos                                           (28U)
#define GPIO_BSC_BC12_Msk                                           (0x1UL << GPIO_BSC_BC12_Pos)                                   /*!< 0x10000000 */
#define GPIO_BSC_BC12                                               GPIO_BSC_BC12_Msk
#define GPIO_BSC_BC13_Pos                                           (29U)
#define GPIO_BSC_BC13_Msk                                           (0x1UL << GPIO_BSC_BC13_Pos)                                   /*!< 0x20000000 */
#define GPIO_BSC_BC13                                               GPIO_BSC_BC13_Msk
#define GPIO_BSC_BC14_Pos                                           (30U)
#define GPIO_BSC_BC14_Msk                                           (0x1UL << GPIO_BSC_BC14_Pos)                                   /*!< 0x40000000 */
#define GPIO_BSC_BC14                                               GPIO_BSC_BC14_Msk
#define GPIO_BSC_BC15_Pos                                           (31U)
#define GPIO_BSC_BC15_Msk                                           (0x1UL << GPIO_BSC_BC15_Pos)                                   /*!< 0x80000000 */
#define GPIO_BSC_BC15                                               GPIO_BSC_BC15_Msk

