betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f417xx.h
/* Legacy defines */
#define GPIO_ALFH_AFRH0                                             GPIO_ALFH_ALFSEL8
#define GPIO_ALFH_AFRH0_0                                           GPIO_ALFH_ALFSEL8_0
#define GPIO_ALFH_AFRH0_1                                           GPIO_ALFH_ALFSEL8_1
#define GPIO_ALFH_AFRH0_2                                           GPIO_ALFH_ALFSEL8_2
#define GPIO_ALFH_AFRH0_3                                           GPIO_ALFH_ALFSEL8_3
#define GPIO_ALFH_AFRH1                                             GPIO_ALFH_ALFSEL9
#define GPIO_ALFH_AFRH1_0                                           GPIO_ALFH_ALFSEL9_0
#define GPIO_ALFH_AFRH1_1                                           GPIO_ALFH_ALFSEL9_1
#define GPIO_ALFH_AFRH1_2                                           GPIO_ALFH_ALFSEL9_2
#define GPIO_ALFH_AFRH1_3                                           GPIO_ALFH_ALFSEL9_3
#define GPIO_ALFH_AFRH2                                             GPIO_ALFH_ALFSEL10
#define GPIO_ALFH_AFRH2_0                                           GPIO_ALFH_ALFSEL10_0
#define GPIO_ALFH_AFRH2_1                                           GPIO_ALFH_ALFSEL10_1
#define GPIO_ALFH_AFRH2_2                                           GPIO_ALFH_ALFSEL10_2
#define GPIO_ALFH_AFRH2_3                                           GPIO_ALFH_ALFSEL10_3
#define GPIO_ALFH_AFRH3                                             GPIO_ALFH_ALFSEL11
#define GPIO_ALFH_AFRH3_0                                           GPIO_ALFH_ALFSEL11_0
#define GPIO_ALFH_AFRH3_1                                           GPIO_ALFH_ALFSEL11_1
#define GPIO_ALFH_AFRH3_2                                           GPIO_ALFH_ALFSEL11_2
#define GPIO_ALFH_AFRH3_3                                           GPIO_ALFH_ALFSEL11_3
#define GPIO_ALFH_AFRH4                                             GPIO_ALFH_ALFSEL12
#define GPIO_ALFH_AFRH4_0                                           GPIO_ALFH_ALFSEL12_0
#define GPIO_ALFH_AFRH4_1                                           GPIO_ALFH_ALFSEL12_1
#define GPIO_ALFH_AFRH4_2                                           GPIO_ALFH_ALFSEL12_2
#define GPIO_ALFH_AFRH4_3                                           GPIO_ALFH_ALFSEL12_3
#define GPIO_ALFH_AFRH5                                             GPIO_ALFH_ALFSEL13
#define GPIO_ALFH_AFRH5_0                                           GPIO_ALFH_ALFSEL13_0
#define GPIO_ALFH_AFRH5_1                                           GPIO_ALFH_ALFSEL13_1
#define GPIO_ALFH_AFRH5_2                                           GPIO_ALFH_ALFSEL13_2
#define GPIO_ALFH_AFRH5_3                                           GPIO_ALFH_ALFSEL13_3
#define GPIO_ALFH_AFRH6                                             GPIO_ALFH_ALFSEL14
#define GPIO_ALFH_AFRH6_0                                           GPIO_ALFH_ALFSEL14_0
#define GPIO_ALFH_AFRH6_1                                           GPIO_ALFH_ALFSEL14_1
#define GPIO_ALFH_AFRH6_2                                           GPIO_ALFH_ALFSEL14_2
#define GPIO_ALFH_AFRH6_3                                           GPIO_ALFH_ALFSEL14_3
#define GPIO_ALFH_AFRH7                                             GPIO_ALFH_ALFSEL15
#define GPIO_ALFH_AFRH7_0                                           GPIO_ALFH_ALFSEL15_0
#define GPIO_ALFH_AFRH7_1                                           GPIO_ALFH_ALFSEL15_1
#define GPIO_ALFH_AFRH7_2                                           GPIO_ALFH_ALFSEL15_2
#define GPIO_ALFH_AFRH7_3                                           GPIO_ALFH_ALFSEL15_3


/******************************************************************************/
/*                                                                            */
/*                                    HASH                                    */
/*                                                                            */
/******************************************************************************/
/******************  Bits definition for HASH_CTRL register  ********************/
#define HASH_CTRL_INITCAL_Pos                                       (2U)
#define HASH_CTRL_INITCAL_Msk                                       (0x1UL << HASH_CTRL_INITCAL_Pos)                               /*!< 0x00000004 */
#define HASH_CTRL_INITCAL                                           HASH_CTRL_INITCAL_Msk
#define HASH_CTRL_DMAEN_Pos                                         (3U)
#define HASH_CTRL_DMAEN_Msk                                         (0x1UL << HASH_CTRL_DMAEN_Pos)                                 /*!< 0x00000008 */
#define HASH_CTRL_DMAEN                                             HASH_CTRL_DMAEN_Msk
#define HASH_CTRL_DTYPE_Pos                                         (4U)
#define HASH_CTRL_DTYPE_Msk                                         (0x3UL << HASH_CTRL_DTYPE_Pos)                                 /*!< 0x00000030 */
#define HASH_CTRL_DTYPE                                             HASH_CTRL_DTYPE_Msk
#define HASH_CTRL_DTYPE_0                                           (0x1UL << HASH_CTRL_DTYPE_Pos)                                 /*!< 0x00000010 */
#define HASH_CTRL_DTYPE_1                                           (0x2UL << HASH_CTRL_DTYPE_Pos)                                 /*!< 0x00000020 */
#define HASH_CTRL_MODESEL_Pos                                       (6U)
#define HASH_CTRL_MODESEL_Msk                                       (0x1UL << HASH_CTRL_MODESEL_Pos)                               /*!< 0x00000040 */
#define HASH_CTRL_MODESEL                                           HASH_CTRL_MODESEL_Msk
#define HASH_CTRL_ALGSEL_Pos                                        (7U)
#define HASH_CTRL_ALGSEL_Msk                                        (0x1UL << HASH_CTRL_ALGSEL_Pos)                                /*!< 0x00000080 */
#define HASH_CTRL_ALGSEL                                            HASH_CTRL_ALGSEL_Msk
#define HASH_CTRL_ALGSEL_0                                          (0x1UL << HASH_CTRL_ALGSEL_Pos)                                /*!< 0x00000080 */
#define HASH_CTRL_WNUM_Pos                                          (8U)
#define HASH_CTRL_WNUM_Msk                                          (0xFUL << HASH_CTRL_WNUM_Pos)                                  /*!< 0x00000F00 */
#define HASH_CTRL_WNUM                                              HASH_CTRL_WNUM_Msk
#define HASH_CTRL_WNUM_0                                            (0x1UL << HASH_CTRL_WNUM_Pos)                                  /*!< 0x00000100 */
#define HASH_CTRL_WNUM_1                                            (0x2UL << HASH_CTRL_WNUM_Pos)                                  /*!< 0x00000200 */
#define HASH_CTRL_WNUM_2                                            (0x4UL << HASH_CTRL_WNUM_Pos)                                  /*!< 0x00000400 */
#define HASH_CTRL_WNUM_3                                            (0x8UL << HASH_CTRL_WNUM_Pos)                                  /*!< 0x00000800 */
#define HASH_CTRL_DINNEMPT_Pos                                      (12U)
#define HASH_CTRL_DINNEMPT_Msk                                      (0x1UL << HASH_CTRL_DINNEMPT_Pos)                              /*!< 0x00001000 */
#define HASH_CTRL_DINNEMPT                                          HASH_CTRL_DINNEMPT_Msk
#define HASH_CTRL_LKEYSEL_Pos                                       (16U)
#define HASH_CTRL_LKEYSEL_Msk                                       (0x1UL << HASH_CTRL_LKEYSEL_Pos)                               /*!< 0x00010000 */
#define HASH_CTRL_LKEYSEL                                           HASH_CTRL_LKEYSEL_Msk

/******************  Bits definition for HASH_START register  *******************/
#define HASH_START_LWNUM_Pos                                        (0U)
#define HASH_START_LWNUM_Msk                                        (0x1FUL << HASH_START_LWNUM_Pos)                               /*!< 0x0000001F */
#define HASH_START_LWNUM                                            HASH_START_LWNUM_Msk
#define HASH_START_LWNUM_0                                          (0x01UL << HASH_START_LWNUM_Pos)                               /*!< 0x00000001 */
#define HASH_START_LWNUM_1                                          (0x02UL << HASH_START_LWNUM_Pos)                               /*!< 0x00000002 */
#define HASH_START_LWNUM_2                                          (0x04UL << HASH_START_LWNUM_Pos)                               /*!< 0x00000004 */
#define HASH_START_LWNUM_3                                          (0x08UL << HASH_START_LWNUM_Pos)                               /*!< 0x00000008 */
#define HASH_START_LWNUM_4                                          (0x10UL << HASH_START_LWNUM_Pos)                               /*!< 0x00000010 */
#define HASH_START_DIGCAL_Pos                                       (8U)
#define HASH_START_DIGCAL_Msk                                       (0x1UL << HASH_START_DIGCAL_Pos)                               /*!< 0x00000100 */
#define HASH_START_DIGCAL                                           HASH_START_DIGCAL_Msk
/* Aliases for HASH_START register */
#define HASH_START_NBW                                              HASH_START_LWNUM
#define HASH_START_NBW_0                                            HASH_START_LWNUM_0
#define HASH_START_NBW_1                                            HASH_START_LWNUM_1
#define HASH_START_NBW_2                                            HASH_START_LWNUM_2
#define HASH_START_NBW_3                                            HASH_START_LWNUM_3
#define HASH_START_NBW_4                                            HASH_START_LWNUM_4

