betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f417xx.h
#define I2C_CTRL2_ERRIEN_Pos                                        (8U)
#define I2C_CTRL2_ERRIEN_Msk                                        (0x1UL << I2C_CTRL2_ERRIEN_Pos)                                /*!< 0x00000100 */
#define I2C_CTRL2_ERRIEN                                            I2C_CTRL2_ERRIEN_Msk                                           /*!<Error Interrupt Enable  */
#define I2C_CTRL2_EVIEN_Pos                                         (9U)
#define I2C_CTRL2_EVIEN_Msk                                         (0x1UL << I2C_CTRL2_EVIEN_Pos)                                 /*!< 0x00000200 */
#define I2C_CTRL2_EVIEN                                             I2C_CTRL2_EVIEN_Msk                                            /*!<Event Interrupt Enable  */
#define I2C_CTRL2_BUFIEN_Pos                                        (10U)
#define I2C_CTRL2_BUFIEN_Msk                                        (0x1UL << I2C_CTRL2_BUFIEN_Pos)                                /*!< 0x00000400 */
#define I2C_CTRL2_BUFIEN                                            I2C_CTRL2_BUFIEN_Msk                                           /*!<Buffer Interrupt Enable */
#define I2C_CTRL2_DMAEN_Pos                                         (11U)
#define I2C_CTRL2_DMAEN_Msk                                         (0x1UL << I2C_CTRL2_DMAEN_Pos)                                 /*!< 0x00000800 */
#define I2C_CTRL2_DMAEN                                             I2C_CTRL2_DMAEN_Msk                                            /*!<DMA Requests Enable     */
#define I2C_CTRL2_LTCFG_Pos                                         (12U)
#define I2C_CTRL2_LTCFG_Msk                                         (0x1UL << I2C_CTRL2_LTCFG_Pos)                                 /*!< 0x00001000 */
#define I2C_CTRL2_LTCFG                                             I2C_CTRL2_LTCFG_Msk                                            /*!<DMA Last Transfer       */

/*******************  Bit definition for I2C_SADDR1 register  *******************/
#define I2C_SADDR1_ADDR1_7                                          0x000000FEU                                                    /*!<Interface Address */
#define I2C_SADDR1_ADDR8_9                                          0x00000300U                                                    /*!<Interface Address */

#define I2C_SADDR1_ADDR0_Pos                                        (0U)
#define I2C_SADDR1_ADDR0_Msk                                        (0x1UL << I2C_SADDR1_ADDR0_Pos)                                /*!< 0x00000001 */
#define I2C_SADDR1_ADDR0                                            I2C_SADDR1_ADDR0_Msk                                           /*!<Bit 0 */
#define I2C_SADDR1_ADDR1_Pos                                        (1U)
#define I2C_SADDR1_ADDR1_Msk                                        (0x1UL << I2C_SADDR1_ADDR1_Pos)                                /*!< 0x00000002 */
#define I2C_SADDR1_ADDR1                                            I2C_SADDR1_ADDR1_Msk                                           /*!<Bit 1 */
#define I2C_SADDR1_ADDR2_Pos                                        (2U)
#define I2C_SADDR1_ADDR2_Msk                                        (0x1UL << I2C_SADDR1_ADDR2_Pos)                                /*!< 0x00000004 */
#define I2C_SADDR1_ADDR2                                            I2C_SADDR1_ADDR2_Msk                                           /*!<Bit 2 */
#define I2C_SADDR1_ADDR3_Pos                                        (3U)
#define I2C_SADDR1_ADDR3_Msk                                        (0x1UL << I2C_SADDR1_ADDR3_Pos)                                /*!< 0x00000008 */
#define I2C_SADDR1_ADDR3                                            I2C_SADDR1_ADDR3_Msk                                           /*!<Bit 3 */
#define I2C_SADDR1_ADDR4_Pos                                        (4U)
#define I2C_SADDR1_ADDR4_Msk                                        (0x1UL << I2C_SADDR1_ADDR4_Pos)                                /*!< 0x00000010 */
#define I2C_SADDR1_ADDR4                                            I2C_SADDR1_ADDR4_Msk                                           /*!<Bit 4 */
#define I2C_SADDR1_ADDR5_Pos                                        (5U)
#define I2C_SADDR1_ADDR5_Msk                                        (0x1UL << I2C_SADDR1_ADDR5_Pos)                                /*!< 0x00000020 */
#define I2C_SADDR1_ADDR5                                            I2C_SADDR1_ADDR5_Msk                                           /*!<Bit 5 */
#define I2C_SADDR1_ADDR6_Pos                                        (6U)
#define I2C_SADDR1_ADDR6_Msk                                        (0x1UL << I2C_SADDR1_ADDR6_Pos)                                /*!< 0x00000040 */
#define I2C_SADDR1_ADDR6                                            I2C_SADDR1_ADDR6_Msk                                           /*!<Bit 6 */
#define I2C_SADDR1_ADDR7_Pos                                        (7U)
#define I2C_SADDR1_ADDR7_Msk                                        (0x1UL << I2C_SADDR1_ADDR7_Pos)                                /*!< 0x00000080 */
#define I2C_SADDR1_ADDR7                                            I2C_SADDR1_ADDR7_Msk                                           /*!<Bit 7 */
#define I2C_SADDR1_ADDR8_Pos                                        (8U)
#define I2C_SADDR1_ADDR8_Msk                                        (0x1UL << I2C_SADDR1_ADDR8_Pos)                                /*!< 0x00000100 */
#define I2C_SADDR1_ADDR8                                            I2C_SADDR1_ADDR8_Msk                                           /*!<Bit 8 */
#define I2C_SADDR1_ADDR9_Pos                                        (9U)
#define I2C_SADDR1_ADDR9_Msk                                        (0x1UL << I2C_SADDR1_ADDR9_Pos)                                /*!< 0x00000200 */
#define I2C_SADDR1_ADDR9                                            I2C_SADDR1_ADDR9_Msk                                           /*!<Bit 9 */

#define I2C_SADDR1_ADDRLEN_Pos                                      (15U)
#define I2C_SADDR1_ADDRLEN_Msk                                      (0x1UL << I2C_SADDR1_ADDRLEN_Pos)                              /*!< 0x00008000 */
#define I2C_SADDR1_ADDRLEN                                          I2C_SADDR1_ADDRLEN_Msk                                         /*!<Addressing Mode (Slave mode) */

