betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f417xx.h
#define PMU_CTRL_PLSEL_Pos                                          (5U)
#define PMU_CTRL_PLSEL_Msk                                          (0x7UL << PMU_CTRL_PLSEL_Pos)                                  /*!< 0x000000E0 */
#define PMU_CTRL_PLSEL                                              PMU_CTRL_PLSEL_Msk                                             /*!< PLS[2:0] bits (PVD Level Selection) */
#define PMU_CTRL_PLSEL_0                                            (0x1UL << PMU_CTRL_PLSEL_Pos)                                  /*!< 0x00000020 */
#define PMU_CTRL_PLSEL_1                                            (0x2UL << PMU_CTRL_PLSEL_Pos)                                  /*!< 0x00000040 */
#define PMU_CTRL_PLSEL_2                                            (0x4UL << PMU_CTRL_PLSEL_Pos)                                  /*!< 0x00000080 */

/*!< PVD level configuration */
#define PMU_CTRL_PLSEL_LEV0                                         0x00000000U                                                    /*!< PVD level 0 */
#define PMU_CTRL_PLSEL_LEV1                                         0x00000020U                                                    /*!< PVD level 1 */
#define PMU_CTRL_PLSEL_LEV2                                         0x00000040U                                                    /*!< PVD level 2 */
#define PMU_CTRL_PLSEL_LEV3                                         0x00000060U                                                    /*!< PVD level 3 */
#define PMU_CTRL_PLSEL_LEV4                                         0x00000080U                                                    /*!< PVD level 4 */
#define PMU_CTRL_PLSEL_LEV5                                         0x000000A0U                                                    /*!< PVD level 5 */
#define PMU_CTRL_PLSEL_LEV6                                         0x000000C0U                                                    /*!< PVD level 6 */
#define PMU_CTRL_PLSEL_LEV7                                         0x000000E0U                                                    /*!< PVD level 7 */
#define PMU_CTRL_BPWEN_Pos                                          (8U)
#define PMU_CTRL_BPWEN_Msk                                          (0x1UL << PMU_CTRL_BPWEN_Pos)                                  /*!< 0x00000100 */
#define PMU_CTRL_BPWEN                                              PMU_CTRL_BPWEN_Msk                                             /*!< Disable Backup Domain write protection                     */
#define PMU_CTRL_FPDSM_Pos                                          (9U)
#define PMU_CTRL_FPDSM_Msk                                          (0x1UL << PMU_CTRL_FPDSM_Pos)                                  /*!< 0x00000200 */
#define PMU_CTRL_FPDSM                                              PMU_CTRL_FPDSM_Msk                                             /*!< Flash power down in Stop mode                              */
#define PMU_CTRL_VOSSEL_Pos                                         (14U)
#define PMU_CTRL_VOSSEL_Msk                                         (0x1UL << PMU_CTRL_VOSSEL_Pos)                                 /*!< 0x00004000 */
#define PMU_CTRL_VOSSEL                                             PMU_CTRL_VOSSEL_Msk                                            /*!< VOS bit (Regulator voltage scaling output selection) */

/* Legacy define */
#define PMU_CTRL_PMODE                                              PMU_CTRL_VOSSEL

/*******************  Bit definition for PMU_CSTS register  ********************/
#define PMU_CSTS_WUEFLG_Pos                                         (0U)
#define PMU_CSTS_WUEFLG_Msk                                         (0x1UL << PMU_CSTS_WUEFLG_Pos)                                 /*!< 0x00000001 */
#define PMU_CSTS_WUEFLG                                             PMU_CSTS_WUEFLG_Msk                                            /*!< Wakeup Flag                                      */
#define PMU_CSTS_SBFLG_Pos                                          (1U)
#define PMU_CSTS_SBFLG_Msk                                          (0x1UL << PMU_CSTS_SBFLG_Pos)                                  /*!< 0x00000002 */
#define PMU_CSTS_SBFLG                                              PMU_CSTS_SBFLG_Msk                                             /*!< Standby Flag                                     */
#define PMU_CSTS_PVDOFLG_Pos                                        (2U)
#define PMU_CSTS_PVDOFLG_Msk                                        (0x1UL << PMU_CSTS_PVDOFLG_Pos)                                /*!< 0x00000004 */
#define PMU_CSTS_PVDOFLG                                            PMU_CSTS_PVDOFLG_Msk                                           /*!< PVD Output                                       */
#define PMU_CSTS_BKPRFLG_Pos                                        (3U)
#define PMU_CSTS_BKPRFLG_Msk                                        (0x1UL << PMU_CSTS_BKPRFLG_Pos)                                /*!< 0x00000008 */
#define PMU_CSTS_BKPRFLG                                            PMU_CSTS_BKPRFLG_Msk                                           /*!< Backup regulator ready                           */
#define PMU_CSTS_WKUPCFG_Pos                                        (8U)
#define PMU_CSTS_WKUPCFG_Msk                                        (0x1UL << PMU_CSTS_WKUPCFG_Pos)                                /*!< 0x00000100 */
#define PMU_CSTS_WKUPCFG                                            PMU_CSTS_WKUPCFG_Msk                                           /*!< Enable WKUP pin                                  */
#define PMU_CSTS_BKPREN_Pos                                         (9U)
#define PMU_CSTS_BKPREN_Msk                                         (0x1UL << PMU_CSTS_BKPREN_Pos)                                 /*!< 0x00000200 */
#define PMU_CSTS_BKPREN                                             PMU_CSTS_BKPREN_Msk                                            /*!< Backup regulator enable                          */
#define PMU_CSTS_VOSRFLG_Pos                                        (14U)
#define PMU_CSTS_VOSRFLG_Msk                                        (0x1UL << PMU_CSTS_VOSRFLG_Pos)                                /*!< 0x00004000 */
#define PMU_CSTS_VOSRFLG                                            PMU_CSTS_VOSRFLG_Msk                                           /*!< Regulator voltage scaling output selection ready */

