betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f417xx.h
#define RCM_PLL1CFG_PLLD_Pos                                        (24U)
#define RCM_PLL1CFG_PLLD_Msk                                        (0xFUL << RCM_PLL1CFG_PLLD_Pos)                                /*!< 0x0F000000 */
#define RCM_PLL1CFG_PLLD                                            RCM_PLL1CFG_PLLD_Msk
#define RCM_PLL1CFG_PLLD_0                                          (0x1UL << RCM_PLL1CFG_PLLD_Pos)                                /*!< 0x01000000 */
#define RCM_PLL1CFG_PLLD_1                                          (0x2UL << RCM_PLL1CFG_PLLD_Pos)                                /*!< 0x02000000 */
#define RCM_PLL1CFG_PLLD_2                                          (0x4UL << RCM_PLL1CFG_PLLD_Pos)                                /*!< 0x04000000 */
#define RCM_PLL1CFG_PLLD_3                                          (0x8UL << RCM_PLL1CFG_PLLD_Pos)                                /*!< 0x08000000 */


/********************  Bit definition for RCM_CFG register  ******************/
/*!< SCLKSEL configuration */
#define RCM_CFG_SCLKSEL_Pos                                         (0U)
#define RCM_CFG_SCLKSEL_Msk                                         (0x3UL << RCM_CFG_SCLKSEL_Pos)                                 /*!< 0x00000003 */
#define RCM_CFG_SCLKSEL                                             RCM_CFG_SCLKSEL_Msk                                            /*!< SCLKSEL[1:0] bits (System clock Switch) */
#define RCM_CFG_SCLKSEL_0                                           (0x1UL << RCM_CFG_SCLKSEL_Pos)                                 /*!< 0x00000001 */
#define RCM_CFG_SCLKSEL_1                                           (0x2UL << RCM_CFG_SCLKSEL_Pos)                                 /*!< 0x00000002 */

#define RCM_CFG_SCLKSEL_HSI                                         0x00000000U                                                    /*!< HSI selected as system clock */
#define RCM_CFG_SCLKSEL_HSE                                         0x00000001U                                                    /*!< HSE selected as system clock */
#define RCM_CFG_SCLKSEL_PLL                                         0x00000002U                                                    /*!< PLL selected as system clock */

/*!< SCLKSELSTS configuration */
#define RCM_CFG_SCLKSELSTS_Pos                                      (2U)
#define RCM_CFG_SCLKSELSTS_Msk                                      (0x3UL << RCM_CFG_SCLKSELSTS_Pos)                              /*!< 0x0000000C */
#define RCM_CFG_SCLKSELSTS                                          RCM_CFG_SCLKSELSTS_Msk                                         /*!< SCLKSELSTS[1:0] bits (System Clock Switch Status) */
#define RCM_CFG_SCLKSELSTS_0                                        (0x1UL << RCM_CFG_SCLKSELSTS_Pos)                              /*!< 0x00000004 */
#define RCM_CFG_SCLKSELSTS_1                                        (0x2UL << RCM_CFG_SCLKSELSTS_Pos)                              /*!< 0x00000008 */

#define RCM_CFG_SCLKSELSTS_HSI                                      0x00000000U                                                    /*!< HSI oscillator used as system clock        */
#define RCM_CFG_SCLKSELSTS_HSE                                      0x00000004U                                                    /*!< HSE oscillator used as system clock        */
#define RCM_CFG_SCLKSELSTS_PLL                                      0x00000008U                                                    /*!< PLL used as system clock                   */

/*!< AHBPSC configuration */
#define RCM_CFG_AHBPSC_Pos                                          (4U)
#define RCM_CFG_AHBPSC_Msk                                          (0xFUL << RCM_CFG_AHBPSC_Pos)                                  /*!< 0x000000F0 */
#define RCM_CFG_AHBPSC                                              RCM_CFG_AHBPSC_Msk                                             /*!< AHBPSC[3:0] bits (AHB prescaler) */
#define RCM_CFG_AHBPSC_0                                            (0x1UL << RCM_CFG_AHBPSC_Pos)                                  /*!< 0x00000010 */
#define RCM_CFG_AHBPSC_1                                            (0x2UL << RCM_CFG_AHBPSC_Pos)                                  /*!< 0x00000020 */
#define RCM_CFG_AHBPSC_2                                            (0x4UL << RCM_CFG_AHBPSC_Pos)                                  /*!< 0x00000040 */
#define RCM_CFG_AHBPSC_3                                            (0x8UL << RCM_CFG_AHBPSC_Pos)                                  /*!< 0x00000080 */

#define RCM_CFG_AHBPSC_DIV1                                         0x00000000U                                                    /*!< SYSCLK not divided    */
#define RCM_CFG_AHBPSC_DIV2                                         0x00000080U                                                    /*!< SYSCLK divided by 2   */
#define RCM_CFG_AHBPSC_DIV4                                         0x00000090U                                                    /*!< SYSCLK divided by 4   */
#define RCM_CFG_AHBPSC_DIV8                                         0x000000A0U                                                    /*!< SYSCLK divided by 8   */
#define RCM_CFG_AHBPSC_DIV16                                        0x000000B0U                                                    /*!< SYSCLK divided by 16  */
#define RCM_CFG_AHBPSC_DIV64                                        0x000000C0U                                                    /*!< SYSCLK divided by 64  */
#define RCM_CFG_AHBPSC_DIV128                                       0x000000D0U                                                    /*!< SYSCLK divided by 128 */
#define RCM_CFG_AHBPSC_DIV256                                       0x000000E0U                                                    /*!< SYSCLK divided by 256 */
#define RCM_CFG_AHBPSC_DIV512                                       0x000000F0U                                                    /*!< SYSCLK divided by 512 */

#define RCM_CFG_SDRAMPSC_Pos                                        (8U)
#define RCM_CFG_SDRAMPSC_Msk                                        (0x3UL << RCM_CFG_SDRAMPSC_Pos)
#define RCM_CFG_SDRAMPSC                                            RCM_CFG_SDRAMPSC_Msk
#define RCM_CFG_SDRAMPSC_0                                          (0x1UL << RCM_CFG_SDRAMPSC_Pos)
#define RCM_CFG_SDRAMPSC_1                                          (0x2UL << RCM_CFG_SDRAMPSC_Pos)

/*!< APB1PSC configuration */
#define RCM_CFG_APB1PSC_Pos                                         (10U)
#define RCM_CFG_APB1PSC_Msk                                         (0x7UL << RCM_CFG_APB1PSC_Pos)                                 /*!< 0x00001C00 */
#define RCM_CFG_APB1PSC                                             RCM_CFG_APB1PSC_Msk                                            /*!< APB1PSC[2:0] bits (APB1 prescaler) */
#define RCM_CFG_APB1PSC_0                                           (0x1UL << RCM_CFG_APB1PSC_Pos)                                 /*!< 0x00000400 */
#define RCM_CFG_APB1PSC_1                                           (0x2UL << RCM_CFG_APB1PSC_Pos)                                 /*!< 0x00000800 */
#define RCM_CFG_APB1PSC_2                                           (0x4UL << RCM_CFG_APB1PSC_Pos)                                 /*!< 0x00001000 */

#define RCM_CFG_APB1PSC_DIV1                                        0x00000000U                                                    /*!< HCLK not divided   */
#define RCM_CFG_APB1PSC_DIV2                                        0x00001000U                                                    /*!< HCLK divided by 2  */
#define RCM_CFG_APB1PSC_DIV4                                        0x00001400U                                                    /*!< HCLK divided by 4  */
#define RCM_CFG_APB1PSC_DIV8                                        0x00001800U                                                    /*!< HCLK divided by 8  */
#define RCM_CFG_APB1PSC_DIV16                                       0x00001C00U                                                    /*!< HCLK divided by 16 */

/*!< APB2PSC configuration */
#define RCM_CFG_APB2PSC_Pos                                         (13U)
#define RCM_CFG_APB2PSC_Msk                                         (0x7UL << RCM_CFG_APB2PSC_Pos)                                 /*!< 0x0000E000 */
#define RCM_CFG_APB2PSC                                             RCM_CFG_APB2PSC_Msk                                            /*!< APB2PSC[2:0] bits (APB2 prescaler) */
#define RCM_CFG_APB2PSC_0                                           (0x1UL << RCM_CFG_APB2PSC_Pos)                                 /*!< 0x00002000 */
#define RCM_CFG_APB2PSC_1                                           (0x2UL << RCM_CFG_APB2PSC_Pos)                                 /*!< 0x00004000 */
#define RCM_CFG_APB2PSC_2                                           (0x4UL << RCM_CFG_APB2PSC_Pos)                                 /*!< 0x00008000 */

#define RCM_CFG_APB2PSC_DIV1                                        0x00000000U                                                    /*!< HCLK not divided   */
#define RCM_CFG_APB2PSC_DIV2                                        0x00008000U                                                    /*!< HCLK divided by 2  */
#define RCM_CFG_APB2PSC_DIV4                                        0x0000A000U                                                    /*!< HCLK divided by 4  */
#define RCM_CFG_APB2PSC_DIV8                                        0x0000C000U                                                    /*!< HCLK divided by 8  */
#define RCM_CFG_APB2PSC_DIV16                                       0x0000E000U                                                    /*!< HCLK divided by 16 */

/*!< RTCPSC configuration */
#define RCM_CFG_RTCPSC_Pos                                          (16U)
#define RCM_CFG_RTCPSC_Msk                                          (0x1FUL << RCM_CFG_RTCPSC_Pos)                                 /*!< 0x001F0000 */
#define RCM_CFG_RTCPSC                                              RCM_CFG_RTCPSC_Msk
#define RCM_CFG_RTCPSC_0                                            (0x01UL << RCM_CFG_RTCPSC_Pos)                                 /*!< 0x00010000 */
#define RCM_CFG_RTCPSC_1                                            (0x02UL << RCM_CFG_RTCPSC_Pos)                                 /*!< 0x00020000 */
#define RCM_CFG_RTCPSC_2                                            (0x04UL << RCM_CFG_RTCPSC_Pos)                                 /*!< 0x00040000 */
#define RCM_CFG_RTCPSC_3                                            (0x08UL << RCM_CFG_RTCPSC_Pos)                                 /*!< 0x00080000 */
#define RCM_CFG_RTCPSC_4                                            (0x10UL << RCM_CFG_RTCPSC_Pos)                                 /*!< 0x00100000 */

/*!< MCO1 configuration */
#define RCM_CFG_MCO1SEL_Pos                                         (21U)
#define RCM_CFG_MCO1SEL_Msk                                         (0x3UL << RCM_CFG_MCO1SEL_Pos)                                 /*!< 0x00600000 */
#define RCM_CFG_MCO1SEL                                             RCM_CFG_MCO1SEL_Msk
#define RCM_CFG_MCO1SEL_0                                           (0x1UL << RCM_CFG_MCO1SEL_Pos)                                 /*!< 0x00200000 */
#define RCM_CFG_MCO1SEL_1                                           (0x2UL << RCM_CFG_MCO1SEL_Pos)                                 /*!< 0x00400000 */

#define RCM_CFG_I2SSEL_Pos                                          (23U)
#define RCM_CFG_I2SSEL_Msk                                          (0x1UL << RCM_CFG_I2SSEL_Pos)                                  /*!< 0x00800000 */
#define RCM_CFG_I2SSEL                                              RCM_CFG_I2SSEL_Msk

