betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f417xx.h
#define RCM_INT_LSIRDYCLR_Pos                                       (16U)
#define RCM_INT_LSIRDYCLR_Msk                                       (0x1UL << RCM_INT_LSIRDYCLR_Pos)                               /*!< 0x00010000 */
#define RCM_INT_LSIRDYCLR                                           RCM_INT_LSIRDYCLR_Msk
#define RCM_INT_LSERDYCLR_Pos                                       (17U)
#define RCM_INT_LSERDYCLR_Msk                                       (0x1UL << RCM_INT_LSERDYCLR_Pos)                               /*!< 0x00020000 */
#define RCM_INT_LSERDYCLR                                           RCM_INT_LSERDYCLR_Msk
#define RCM_INT_HSIRDYCLR_Pos                                       (18U)
#define RCM_INT_HSIRDYCLR_Msk                                       (0x1UL << RCM_INT_HSIRDYCLR_Pos)                               /*!< 0x00040000 */
#define RCM_INT_HSIRDYCLR                                           RCM_INT_HSIRDYCLR_Msk
#define RCM_INT_HSERDYCLR_Pos                                       (19U)
#define RCM_INT_HSERDYCLR_Msk                                       (0x1UL << RCM_INT_HSERDYCLR_Pos)                               /*!< 0x00080000 */
#define RCM_INT_HSERDYCLR                                           RCM_INT_HSERDYCLR_Msk
#define RCM_INT_PLL1RDYCLR_Pos                                      (20U)
#define RCM_INT_PLL1RDYCLR_Msk                                      (0x1UL << RCM_INT_PLL1RDYCLR_Pos)                              /*!< 0x00100000 */
#define RCM_INT_PLL1RDYCLR                                          RCM_INT_PLL1RDYCLR_Msk
#define RCM_INT_PLL2RDYCLR_Pos                                      (21U)
#define RCM_INT_PLL2RDYCLR_Msk                                      (0x1UL << RCM_INT_PLL2RDYCLR_Pos)                              /*!< 0x00200000 */
#define RCM_INT_PLL2RDYCLR                                          RCM_INT_PLL2RDYCLR_Msk

#define RCM_INT_CSSCLR_Pos                                          (23U)
#define RCM_INT_CSSCLR_Msk                                          (0x1UL << RCM_INT_CSSCLR_Pos)                                  /*!< 0x00800000 */
#define RCM_INT_CSSCLR                                              RCM_INT_CSSCLR_Msk

/********************  Bit definition for RCM_AHB1RST register  **************/
#define RCM_AHB1RST_PARST_Pos                                       (0U)
#define RCM_AHB1RST_PARST_Msk                                       (0x1UL << RCM_AHB1RST_PARST_Pos)                               /*!< 0x00000001 */
#define RCM_AHB1RST_PARST                                           RCM_AHB1RST_PARST_Msk
#define RCM_AHB1RST_PBRST_Pos                                       (1U)
#define RCM_AHB1RST_PBRST_Msk                                       (0x1UL << RCM_AHB1RST_PBRST_Pos)                               /*!< 0x00000002 */
#define RCM_AHB1RST_PBRST                                           RCM_AHB1RST_PBRST_Msk
#define RCM_AHB1RST_PCRST_Pos                                       (2U)
#define RCM_AHB1RST_PCRST_Msk                                       (0x1UL << RCM_AHB1RST_PCRST_Pos)                               /*!< 0x00000004 */
#define RCM_AHB1RST_PCRST                                           RCM_AHB1RST_PCRST_Msk
#define RCM_AHB1RST_PDRST_Pos                                       (3U)
#define RCM_AHB1RST_PDRST_Msk                                       (0x1UL << RCM_AHB1RST_PDRST_Pos)                               /*!< 0x00000008 */
#define RCM_AHB1RST_PDRST                                           RCM_AHB1RST_PDRST_Msk
#define RCM_AHB1RST_PERST_Pos                                       (4U)
#define RCM_AHB1RST_PERST_Msk                                       (0x1UL << RCM_AHB1RST_PERST_Pos)                               /*!< 0x00000010 */
#define RCM_AHB1RST_PERST                                           RCM_AHB1RST_PERST_Msk
#define RCM_AHB1RST_PFRST_Pos                                       (5U)
#define RCM_AHB1RST_PFRST_Msk                                       (0x1UL << RCM_AHB1RST_PFRST_Pos)                               /*!< 0x00000020 */
#define RCM_AHB1RST_PFRST                                           RCM_AHB1RST_PFRST_Msk
#define RCM_AHB1RST_PGRST_Pos                                       (6U)
#define RCM_AHB1RST_PGRST_Msk                                       (0x1UL << RCM_AHB1RST_PGRST_Pos)                               /*!< 0x00000040 */
#define RCM_AHB1RST_PGRST                                           RCM_AHB1RST_PGRST_Msk
#define RCM_AHB1RST_PHRST_Pos                                       (7U)
#define RCM_AHB1RST_PHRST_Msk                                       (0x1UL << RCM_AHB1RST_PHRST_Pos)                               /*!< 0x00000080 */
#define RCM_AHB1RST_PHRST                                           RCM_AHB1RST_PHRST_Msk
#define RCM_AHB1RST_PIRST_Pos                                       (8U)
#define RCM_AHB1RST_PIRST_Msk                                       (0x1UL << RCM_AHB1RST_PIRST_Pos)                               /*!< 0x00000100 */
#define RCM_AHB1RST_PIRST                                           RCM_AHB1RST_PIRST_Msk
#define RCM_AHB1RST_CRCRST_Pos                                      (12U)
#define RCM_AHB1RST_CRCRST_Msk                                      (0x1UL << RCM_AHB1RST_CRCRST_Pos)                              /*!< 0x00001000 */
#define RCM_AHB1RST_CRCRST                                          RCM_AHB1RST_CRCRST_Msk
#define RCM_AHB1RST_DMA1RST_Pos                                     (21U)
#define RCM_AHB1RST_DMA1RST_Msk                                     (0x1UL << RCM_AHB1RST_DMA1RST_Pos)                             /*!< 0x00200000 */
#define RCM_AHB1RST_DMA1RST                                         RCM_AHB1RST_DMA1RST_Msk
#define RCM_AHB1RST_DMA2RST_Pos                                     (22U)
#define RCM_AHB1RST_DMA2RST_Msk                                     (0x1UL << RCM_AHB1RST_DMA2RST_Pos)                             /*!< 0x00400000 */
#define RCM_AHB1RST_DMA2RST                                         RCM_AHB1RST_DMA2RST_Msk
#define RCM_AHB1RST_ETHRST_Pos                                      (25U)
#define RCM_AHB1RST_ETHRST_Msk                                      (0x1UL << RCM_AHB1RST_ETHRST_Pos)                              /*!< 0x02000000 */
#define RCM_AHB1RST_ETHRST                                          RCM_AHB1RST_ETHRST_Msk
#define RCM_AHB1RST_OTGHS1RST_Pos                                   (29U)
#define RCM_AHB1RST_OTGHS1RST_Msk                                   (0x1UL << RCM_AHB1RST_OTGHS1RST_Pos)                           /*!< 0x20000000 */
#define RCM_AHB1RST_OTGHS1RST                                       RCM_AHB1RST_OTGHS1RST_Msk

/********************  Bit definition for RCM_AHB2RST register  **************/
#define RCM_AHB2RST_DCIRST_Pos                                      (0U)
#define RCM_AHB2RST_DCIRST_Msk                                      (0x1UL << RCM_AHB2RST_DCIRST_Pos)                              /*!< 0x00000001 */
#define RCM_AHB2RST_DCIRST                                          RCM_AHB2RST_DCIRST_Msk
#define RCM_AHB2RST_FPURST_Pos                                      (1U)
#define RCM_AHB2RST_FPURST_Msk                                      (0x1UL << RCM_AHB2RST_FPURST_Pos)                              /*!< 0x00000002 */
#define RCM_AHB2RST_FPURST                                          RCM_AHB2RST_FPURST_Msk
#define RCM_AHB2RST_BNRST_Pos                                       (2U)
#define RCM_AHB2RST_BNRST_Msk                                       (0x1UL << RCM_AHB2RST_BNRST_Pos)                               /*!< 0x00000004 */
#define RCM_AHB2RST_BNRST                                           RCM_AHB2RST_BNRST_Msk
#define RCM_AHB2RST_SMRST_Pos                                       (3U)
#define RCM_AHB2RST_SMRST_Msk                                       (0x1UL << RCM_AHB2RST_SMRST_Pos)                               /*!< 0x00000008 */
#define RCM_AHB2RST_SMRST                                           RCM_AHB2RST_SMRST_Msk
#define RCM_AHB2RST_CRYPRST_Pos                                     (4U)
#define RCM_AHB2RST_CRYPRST_Msk                                     (0x1UL << RCM_AHB2RST_CRYPRST_Pos)                             /*!< 0x00000010 */
#define RCM_AHB2RST_CRYPRST                                         RCM_AHB2RST_CRYPRST_Msk
#define RCM_AHB2RST_HASHRST_Pos                                     (5U)
#define RCM_AHB2RST_HASHRST_Msk                                     (0x1UL << RCM_AHB2RST_HASHRST_Pos)                             /*!< 0x00000020 */
#define RCM_AHB2RST_HASHRST                                         RCM_AHB2RST_HASHRST_Msk
 /* maintained for legacy purpose */
#define RCM_AHB2RST_HSAHRST                                         RCM_AHB2RST_HASHRST
#define RCM_AHB2RST_RNGRST_Pos                                      (6U)
#define RCM_AHB2RST_RNGRST_Msk                                      (0x1UL << RCM_AHB2RST_RNGRST_Pos)                              /*!< 0x00000040 */
#define RCM_AHB2RST_RNGRST                                          RCM_AHB2RST_RNGRST_Msk
#define RCM_AHB2RST_OTGFSRST_Pos                                    (7U)
#define RCM_AHB2RST_OTGFSRST_Msk                                    (0x1UL << RCM_AHB2RST_OTGFSRST_Pos)                            /*!< 0x00000080 */
#define RCM_AHB2RST_OTGFSRST                                        RCM_AHB2RST_OTGFSRST_Msk
/********************  Bit definition for RCM_AHB3RST register  **************/
#define RCM_AHB3RST_EMMCRST_Pos                                     (0U)
#define RCM_AHB3RST_EMMCRST_Msk                                     (0x1UL << RCM_AHB3RST_EMMCRST_Pos)                             /*!< 0x00000001 */
#define RCM_AHB3RST_EMMCRST                                         RCM_AHB3RST_EMMCRST_Msk


/********************  Bit definition for RCM_APB1RST register  **************/
#define RCM_APB1RST_TMR2RST_Pos                                     (0U)
#define RCM_APB1RST_TMR2RST_Msk                                     (0x1UL << RCM_APB1RST_TMR2RST_Pos)                             /*!< 0x00000001 */
#define RCM_APB1RST_TMR2RST                                         RCM_APB1RST_TMR2RST_Msk
#define RCM_APB1RST_TMR3RST_Pos                                     (1U)
#define RCM_APB1RST_TMR3RST_Msk                                     (0x1UL << RCM_APB1RST_TMR3RST_Pos)                             /*!< 0x00000002 */
#define RCM_APB1RST_TMR3RST                                         RCM_APB1RST_TMR3RST_Msk
#define RCM_APB1RST_TMR4RST_Pos                                     (2U)
#define RCM_APB1RST_TMR4RST_Msk                                     (0x1UL << RCM_APB1RST_TMR4RST_Pos)                             /*!< 0x00000004 */
#define RCM_APB1RST_TMR4RST                                         RCM_APB1RST_TMR4RST_Msk
#define RCM_APB1RST_TMR5RST_Pos                                     (3U)
#define RCM_APB1RST_TMR5RST_Msk                                     (0x1UL << RCM_APB1RST_TMR5RST_Pos)                             /*!< 0x00000008 */
#define RCM_APB1RST_TMR5RST                                         RCM_APB1RST_TMR5RST_Msk
#define RCM_APB1RST_TMR6RST_Pos                                     (4U)
#define RCM_APB1RST_TMR6RST_Msk                                     (0x1UL << RCM_APB1RST_TMR6RST_Pos)                             /*!< 0x00000010 */
#define RCM_APB1RST_TMR6RST                                         RCM_APB1RST_TMR6RST_Msk
#define RCM_APB1RST_TMR7RST_Pos                                     (5U)
#define RCM_APB1RST_TMR7RST_Msk                                     (0x1UL << RCM_APB1RST_TMR7RST_Pos)                             /*!< 0x00000020 */
#define RCM_APB1RST_TMR7RST                                         RCM_APB1RST_TMR7RST_Msk
#define RCM_APB1RST_TMR12RST_Pos                                    (6U)
#define RCM_APB1RST_TMR12RST_Msk                                    (0x1UL << RCM_APB1RST_TMR12RST_Pos)                            /*!< 0x00000040 */
#define RCM_APB1RST_TMR12RST                                        RCM_APB1RST_TMR12RST_Msk
#define RCM_APB1RST_TMR13RST_Pos                                    (7U)
#define RCM_APB1RST_TMR13RST_Msk                                    (0x1UL << RCM_APB1RST_TMR13RST_Pos)                            /*!< 0x00000080 */
#define RCM_APB1RST_TMR13RST                                        RCM_APB1RST_TMR13RST_Msk
#define RCM_APB1RST_TMR14RST_Pos                                    (8U)
#define RCM_APB1RST_TMR14RST_Msk                                    (0x1UL << RCM_APB1RST_TMR14RST_Pos)                            /*!< 0x00000100 */
#define RCM_APB1RST_TMR14RST                                        RCM_APB1RST_TMR14RST_Msk
#define RCM_APB1RST_WWDTRST_Pos                                     (11U)
#define RCM_APB1RST_WWDTRST_Msk                                     (0x1UL << RCM_APB1RST_WWDTRST_Pos)                             /*!< 0x00000800 */
#define RCM_APB1RST_WWDTRST                                         RCM_APB1RST_WWDTRST_Msk
#define RCM_APB1RST_SPI2RST_Pos                                     (14U)
#define RCM_APB1RST_SPI2RST_Msk                                     (0x1UL << RCM_APB1RST_SPI2RST_Pos)                             /*!< 0x00004000 */
#define RCM_APB1RST_SPI2RST                                         RCM_APB1RST_SPI2RST_Msk
#define RCM_APB1RST_SPI3RST_Pos                                     (15U)
#define RCM_APB1RST_SPI3RST_Msk                                     (0x1UL << RCM_APB1RST_SPI3RST_Pos)                             /*!< 0x00008000 */
#define RCM_APB1RST_SPI3RST                                         RCM_APB1RST_SPI3RST_Msk
#define RCM_APB1RST_USART2RST_Pos                                   (17U)
#define RCM_APB1RST_USART2RST_Msk                                   (0x1UL << RCM_APB1RST_USART2RST_Pos)                           /*!< 0x00020000 */
#define RCM_APB1RST_USART2RST                                       RCM_APB1RST_USART2RST_Msk
#define RCM_APB1RST_USART3RST_Pos                                   (18U)
#define RCM_APB1RST_USART3RST_Msk                                   (0x1UL << RCM_APB1RST_USART3RST_Pos)                           /*!< 0x00040000 */
#define RCM_APB1RST_USART3RST                                       RCM_APB1RST_USART3RST_Msk
#define RCM_APB1RST_UART4RST_Pos                                    (19U)
#define RCM_APB1RST_UART4RST_Msk                                    (0x1UL << RCM_APB1RST_UART4RST_Pos)                            /*!< 0x00080000 */
#define RCM_APB1RST_UART4RST                                        RCM_APB1RST_UART4RST_Msk
#define RCM_APB1RST_UART5RST_Pos                                    (20U)
#define RCM_APB1RST_UART5RST_Msk                                    (0x1UL << RCM_APB1RST_UART5RST_Pos)                            /*!< 0x00100000 */
#define RCM_APB1RST_UART5RST                                        RCM_APB1RST_UART5RST_Msk
#define RCM_APB1RST_I2C1RST_Pos                                     (21U)
#define RCM_APB1RST_I2C1RST_Msk                                     (0x1UL << RCM_APB1RST_I2C1RST_Pos)                             /*!< 0x00200000 */
#define RCM_APB1RST_I2C1RST                                         RCM_APB1RST_I2C1RST_Msk
#define RCM_APB1RST_I2C2RST_Pos                                     (22U)
#define RCM_APB1RST_I2C2RST_Msk                                     (0x1UL << RCM_APB1RST_I2C2RST_Pos)                             /*!< 0x00400000 */
#define RCM_APB1RST_I2C2RST                                         RCM_APB1RST_I2C2RST_Msk
#define RCM_APB1RST_I2C3RST_Pos                                     (23U)
#define RCM_APB1RST_I2C3RST_Msk                                     (0x1UL << RCM_APB1RST_I2C3RST_Pos)                             /*!< 0x00800000 */
#define RCM_APB1RST_I2C3RST                                         RCM_APB1RST_I2C3RST_Msk
#define RCM_APB1RST_CAN1RST_Pos                                     (25U)
#define RCM_APB1RST_CAN1RST_Msk                                     (0x1UL << RCM_APB1RST_CAN1RST_Pos)                             /*!< 0x02000000 */
#define RCM_APB1RST_CAN1RST                                         RCM_APB1RST_CAN1RST_Msk
#define RCM_APB1RST_CAN2RST_Pos                                     (26U)
#define RCM_APB1RST_CAN2RST_Msk                                     (0x1UL << RCM_APB1RST_CAN2RST_Pos)                             /*!< 0x04000000 */
#define RCM_APB1RST_CAN2RST                                         RCM_APB1RST_CAN2RST_Msk
#define RCM_APB1RST_PMURST_Pos                                      (28U)
#define RCM_APB1RST_PMURST_Msk                                      (0x1UL << RCM_APB1RST_PMURST_Pos)                              /*!< 0x10000000 */
#define RCM_APB1RST_PMURST                                          RCM_APB1RST_PMURST_Msk
#define RCM_APB1RST_DACRST_Pos                                      (29U)
#define RCM_APB1RST_DACRST_Msk                                      (0x1UL << RCM_APB1RST_DACRST_Pos)                              /*!< 0x20000000 */
#define RCM_APB1RST_DACRST                                          RCM_APB1RST_DACRST_Msk

/********************  Bit definition for RCM_APB2RST register  **************/
#define RCM_APB2RST_TMR1RST_Pos                                     (0U)
#define RCM_APB2RST_TMR1RST_Msk                                     (0x1UL << RCM_APB2RST_TMR1RST_Pos)                             /*!< 0x00000001 */
#define RCM_APB2RST_TMR1RST                                         RCM_APB2RST_TMR1RST_Msk
#define RCM_APB2RST_TMR8RST_Pos                                     (1U)
#define RCM_APB2RST_TMR8RST_Msk                                     (0x1UL << RCM_APB2RST_TMR8RST_Pos)                             /*!< 0x00000002 */
#define RCM_APB2RST_TMR8RST                                         RCM_APB2RST_TMR8RST_Msk
#define RCM_APB2RST_USART1RST_Pos                                   (4U)
#define RCM_APB2RST_USART1RST_Msk                                   (0x1UL << RCM_APB2RST_USART1RST_Pos)                           /*!< 0x00000010 */
#define RCM_APB2RST_USART1RST                                       RCM_APB2RST_USART1RST_Msk
#define RCM_APB2RST_USART6RST_Pos                                   (5U)
#define RCM_APB2RST_USART6RST_Msk                                   (0x1UL << RCM_APB2RST_USART6RST_Pos)                           /*!< 0x00000020 */
#define RCM_APB2RST_USART6RST                                       RCM_APB2RST_USART6RST_Msk
#define RCM_APB2RST_ADCRST_Pos                                      (8U)
#define RCM_APB2RST_ADCRST_Msk                                      (0x1UL << RCM_APB2RST_ADCRST_Pos)                              /*!< 0x00000100 */
#define RCM_APB2RST_ADCRST                                          RCM_APB2RST_ADCRST_Msk
#define RCM_APB2RST_SDIORST_Pos                                     (11U)
#define RCM_APB2RST_SDIORST_Msk                                     (0x1UL << RCM_APB2RST_SDIORST_Pos)                             /*!< 0x00000800 */
#define RCM_APB2RST_SDIORST                                         RCM_APB2RST_SDIORST_Msk
#define RCM_APB2RST_SPI1RST_Pos                                     (12U)
#define RCM_APB2RST_SPI1RST_Msk                                     (0x1UL << RCM_APB2RST_SPI1RST_Pos)                             /*!< 0x00001000 */
#define RCM_APB2RST_SPI1RST                                         RCM_APB2RST_SPI1RST_Msk
#define RCM_APB2RST_SYSCFGRST_Pos                                   (14U)
#define RCM_APB2RST_SYSCFGRST_Msk                                   (0x1UL << RCM_APB2RST_SYSCFGRST_Pos)                           /*!< 0x00004000 */
#define RCM_APB2RST_SYSCFGRST                                       RCM_APB2RST_SYSCFGRST_Msk
#define RCM_APB2RST_TMR9RST_Pos                                     (16U)
#define RCM_APB2RST_TMR9RST_Msk                                     (0x1UL << RCM_APB2RST_TMR9RST_Pos)                             /*!< 0x00010000 */
#define RCM_APB2RST_TMR9RST                                         RCM_APB2RST_TMR9RST_Msk
#define RCM_APB2RST_TMR10RST_Pos                                    (17U)
#define RCM_APB2RST_TMR10RST_Msk                                    (0x1UL << RCM_APB2RST_TMR10RST_Pos)                            /*!< 0x00020000 */
#define RCM_APB2RST_TMR10RST                                        RCM_APB2RST_TMR10RST_Msk
#define RCM_APB2RST_TMR11RST_Pos                                    (18U)
#define RCM_APB2RST_TMR11RST_Msk                                    (0x1UL << RCM_APB2RST_TMR11RST_Pos)                            /*!< 0x00040000 */
#define RCM_APB2RST_TMR11RST                                        RCM_APB2RST_TMR11RST_Msk

/* Old SPI1RST bit definition, maintained for legacy purpose */
#define RCM_APB2RST_SPI1                                            RCM_APB2RST_SPI1RST

