betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f417xx.h
/*
 * @brief Specific device feature definitions (not present on all devices in the APM32F4 serie)
 */
#define RCM_LPAHB1_SUPPORT

/********************  Bit definition for RCM_LPAHB1CLKEN register  *************/
#define RCM_LPAHB1CLKEN_PALPEN_Pos                                  (0U)
#define RCM_LPAHB1CLKEN_PALPEN_Msk                                  (0x1UL << RCM_LPAHB1CLKEN_PALPEN_Pos)                          /*!< 0x00000001 */
#define RCM_LPAHB1CLKEN_PALPEN                                      RCM_LPAHB1CLKEN_PALPEN_Msk
#define RCM_LPAHB1CLKEN_PBLPEN_Pos                                  (1U)
#define RCM_LPAHB1CLKEN_PBLPEN_Msk                                  (0x1UL << RCM_LPAHB1CLKEN_PBLPEN_Pos)                          /*!< 0x00000002 */
#define RCM_LPAHB1CLKEN_PBLPEN                                      RCM_LPAHB1CLKEN_PBLPEN_Msk
#define RCM_LPAHB1CLKEN_PCLPEN_Pos                                  (2U)
#define RCM_LPAHB1CLKEN_PCLPEN_Msk                                  (0x1UL << RCM_LPAHB1CLKEN_PCLPEN_Pos)                          /*!< 0x00000004 */
#define RCM_LPAHB1CLKEN_PCLPEN                                      RCM_LPAHB1CLKEN_PCLPEN_Msk
#define RCM_LPAHB1CLKEN_PDLPEN_Pos                                  (3U)
#define RCM_LPAHB1CLKEN_PDLPEN_Msk                                  (0x1UL << RCM_LPAHB1CLKEN_PDLPEN_Pos)                          /*!< 0x00000008 */
#define RCM_LPAHB1CLKEN_PDLPEN                                      RCM_LPAHB1CLKEN_PDLPEN_Msk
#define RCM_LPAHB1CLKEN_PELPEN_Pos                                  (4U)
#define RCM_LPAHB1CLKEN_PELPEN_Msk                                  (0x1UL << RCM_LPAHB1CLKEN_PELPEN_Pos)                          /*!< 0x00000010 */
#define RCM_LPAHB1CLKEN_PELPEN                                      RCM_LPAHB1CLKEN_PELPEN_Msk
#define RCM_LPAHB1CLKEN_PFLPEN_Pos                                  (5U)
#define RCM_LPAHB1CLKEN_PFLPEN_Msk                                  (0x1UL << RCM_LPAHB1CLKEN_PFLPEN_Pos)                          /*!< 0x00000020 */
#define RCM_LPAHB1CLKEN_PFLPEN                                      RCM_LPAHB1CLKEN_PFLPEN_Msk
#define RCM_LPAHB1CLKEN_PGLPEN_Pos                                  (6U)
#define RCM_LPAHB1CLKEN_PGLPEN_Msk                                  (0x1UL << RCM_LPAHB1CLKEN_PGLPEN_Pos)                          /*!< 0x00000040 */
#define RCM_LPAHB1CLKEN_PGLPEN                                      RCM_LPAHB1CLKEN_PGLPEN_Msk
#define RCM_LPAHB1CLKEN_PHLPEN_Pos                                  (7U)
#define RCM_LPAHB1CLKEN_PHLPEN_Msk                                  (0x1UL << RCM_LPAHB1CLKEN_PHLPEN_Pos)                          /*!< 0x00000080 */
#define RCM_LPAHB1CLKEN_PHLPEN                                      RCM_LPAHB1CLKEN_PHLPEN_Msk
#define RCM_LPAHB1CLKEN_PILPEN_Pos                                  (8U)
#define RCM_LPAHB1CLKEN_PILPEN_Msk                                  (0x1UL << RCM_LPAHB1CLKEN_PILPEN_Pos)                          /*!< 0x00000100 */
#define RCM_LPAHB1CLKEN_PILPEN                                      RCM_LPAHB1CLKEN_PILPEN_Msk
#define RCM_LPAHB1CLKEN_CRCLPEN_Pos                                 (12U)
#define RCM_LPAHB1CLKEN_CRCLPEN_Msk                                 (0x1UL << RCM_LPAHB1CLKEN_CRCLPEN_Pos)                         /*!< 0x00001000 */
#define RCM_LPAHB1CLKEN_CRCLPEN                                     RCM_LPAHB1CLKEN_CRCLPEN_Msk
#define RCM_LPAHB1CLKEN_FMCEN_Pos                                   (15U)
#define RCM_LPAHB1CLKEN_FMCEN_Msk                                   (0x1UL << RCM_LPAHB1CLKEN_FMCEN_Pos)                           /*!< 0x00008000 */
#define RCM_LPAHB1CLKEN_FMCEN                                       RCM_LPAHB1CLKEN_FMCEN_Msk
#define RCM_LPAHB1CLKEN_SRAM1EN_Pos                                 (16U)
#define RCM_LPAHB1CLKEN_SRAM1EN_Msk                                 (0x1UL << RCM_LPAHB1CLKEN_SRAM1EN_Pos)                         /*!< 0x00010000 */
#define RCM_LPAHB1CLKEN_SRAM1EN                                     RCM_LPAHB1CLKEN_SRAM1EN_Msk
#define RCM_LPAHB1CLKEN_SRAM2EN_Pos                                 (17U)
#define RCM_LPAHB1CLKEN_SRAM2EN_Msk                                 (0x1UL << RCM_LPAHB1CLKEN_SRAM2EN_Pos)                         /*!< 0x00020000 */
#define RCM_LPAHB1CLKEN_SRAM2EN                                     RCM_LPAHB1CLKEN_SRAM2EN_Msk
#define RCM_LPAHB1CLKEN_BKPSRAMEN_Pos                               (18U)
#define RCM_LPAHB1CLKEN_BKPSRAMEN_Msk                               (0x1UL << RCM_LPAHB1CLKEN_BKPSRAMEN_Pos)                       /*!< 0x00040000 */
#define RCM_LPAHB1CLKEN_BKPSRAMEN                                   RCM_LPAHB1CLKEN_BKPSRAMEN_Msk
#define RCM_LPAHB1CLKEN_DMA1EN_Pos                                  (21U)
#define RCM_LPAHB1CLKEN_DMA1EN_Msk                                  (0x1UL << RCM_LPAHB1CLKEN_DMA1EN_Pos)                          /*!< 0x00200000 */
#define RCM_LPAHB1CLKEN_DMA1EN                                      RCM_LPAHB1CLKEN_DMA1EN_Msk
#define RCM_LPAHB1CLKEN_DMA2EN_Pos                                  (22U)
#define RCM_LPAHB1CLKEN_DMA2EN_Msk                                  (0x1UL << RCM_LPAHB1CLKEN_DMA2EN_Pos)                          /*!< 0x00400000 */
#define RCM_LPAHB1CLKEN_DMA2EN                                      RCM_LPAHB1CLKEN_DMA2EN_Msk

#define RCM_LPAHB1CLKEN_ETHEN_Pos                                   (25U)
#define RCM_LPAHB1CLKEN_ETHEN_Msk                                   (0x1UL << RCM_LPAHB1CLKEN_ETHEN_Pos)                           /*!< 0x02000000 */
#define RCM_LPAHB1CLKEN_ETHEN                                       RCM_LPAHB1CLKEN_ETHEN_Msk
#define RCM_LPAHB1CLKEN_ETHTXEN_Pos                                 (26U)
#define RCM_LPAHB1CLKEN_ETHTXEN_Msk                                 (0x1UL << RCM_LPAHB1CLKEN_ETHTXEN_Pos)                         /*!< 0x04000000 */
#define RCM_LPAHB1CLKEN_ETHTXEN                                     RCM_LPAHB1CLKEN_ETHTXEN_Msk
#define RCM_LPAHB1CLKEN_ETHRXEN_Pos                                 (27U)
#define RCM_LPAHB1CLKEN_ETHRXEN_Msk                                 (0x1UL << RCM_LPAHB1CLKEN_ETHRXEN_Pos)                         /*!< 0x08000000 */
#define RCM_LPAHB1CLKEN_ETHRXEN                                     RCM_LPAHB1CLKEN_ETHRXEN_Msk
#define RCM_LPAHB1CLKEN_ETHPTPEN_Pos                                (28U)
#define RCM_LPAHB1CLKEN_ETHPTPEN_Msk                                (0x1UL << RCM_LPAHB1CLKEN_ETHPTPEN_Pos)                        /*!< 0x10000000 */
#define RCM_LPAHB1CLKEN_ETHPTPEN                                    RCM_LPAHB1CLKEN_ETHPTPEN_Msk
#define RCM_LPAHB1CLKEN_OTGHS1EN_Pos                                (29U)
#define RCM_LPAHB1CLKEN_OTGHS1EN_Msk                                (0x1UL << RCM_LPAHB1CLKEN_OTGHS1EN_Pos)                        /*!< 0x20000000 */
#define RCM_LPAHB1CLKEN_OTGHS1EN                                    RCM_LPAHB1CLKEN_OTGHS1EN_Msk
#define RCM_LPAHB1CLKEN_OTGHSULPIEN_Pos                             (30U)
#define RCM_LPAHB1CLKEN_OTGHSULPIEN_Msk                             (0x1UL << RCM_LPAHB1CLKEN_OTGHSULPIEN_Pos)                     /*!< 0x40000000 */
#define RCM_LPAHB1CLKEN_OTGHSULPIEN                                 RCM_LPAHB1CLKEN_OTGHSULPIEN_Msk

