betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f417xx.h
/********************  Bits definition for RTC_BAKP13 register  ***************/
#define RTC_BAKP13_BAKP_Pos                                         (0U)
#define RTC_BAKP13_BAKP_Msk                                         (0xFFFFFFFFUL << RTC_BAKP13_BAKP_Pos)                          /*!< 0xFFFFFFFF */
#define RTC_BAKP13_BAKP                                             RTC_BAKP13_BAKP_Msk

/********************  Bits definition for RTC_BAKP14 register  ***************/
#define RTC_BAKP14_BAKP_Pos                                         (0U)
#define RTC_BAKP14_BAKP_Msk                                         (0xFFFFFFFFUL << RTC_BAKP14_BAKP_Pos)                          /*!< 0xFFFFFFFF */
#define RTC_BAKP14_BAKP                                             RTC_BAKP14_BAKP_Msk

/********************  Bits definition for RTC_BAKP15 register  ***************/
#define RTC_BAKP15_BAKP_Pos                                         (0U)
#define RTC_BAKP15_BAKP_Msk                                         (0xFFFFFFFFUL << RTC_BAKP15_BAKP_Pos)                          /*!< 0xFFFFFFFF */
#define RTC_BAKP15_BAKP                                             RTC_BAKP15_BAKP_Msk

/********************  Bits definition for RTC_BAKP16 register  ***************/
#define RTC_BAKP16_BAKP_Pos                                         (0U)
#define RTC_BAKP16_BAKP_Msk                                         (0xFFFFFFFFUL << RTC_BAKP16_BAKP_Pos)                          /*!< 0xFFFFFFFF */
#define RTC_BAKP16_BAKP                                             RTC_BAKP16_BAKP_Msk

/********************  Bits definition for RTC_BAKP17 register  ***************/
#define RTC_BAKP17_BAKP_Pos                                         (0U)
#define RTC_BAKP17_BAKP_Msk                                         (0xFFFFFFFFUL << RTC_BAKP17_BAKP_Pos)                          /*!< 0xFFFFFFFF */
#define RTC_BAKP17_BAKP                                             RTC_BAKP17_BAKP_Msk

/********************  Bits definition for RTC_BAKP18 register  ***************/
#define RTC_BAKP18_BAKP_Pos                                         (0U)
#define RTC_BAKP18_BAKP_Msk                                         (0xFFFFFFFFUL << RTC_BAKP18_BAKP_Pos)                          /*!< 0xFFFFFFFF */
#define RTC_BAKP18_BAKP                                             RTC_BAKP18_BAKP_Msk

/********************  Bits definition for RTC_BAKP19 register  ***************/
#define RTC_BAKP19_BAKP_Pos                                         (0U)
#define RTC_BAKP19_BAKP_Msk                                         (0xFFFFFFFFUL << RTC_BAKP19_BAKP_Pos)                          /*!< 0xFFFFFFFF */
#define RTC_BAKP19_BAKP                                             RTC_BAKP19_BAKP_Msk

/******************** Number of backup registers ******************************/
#define RTC_BKP_NUMBER                                              0x000000014U


/******************************************************************************/
/*                                                                            */
/*                          SD host Interface                                 */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for SDIO_PWRCTRL register  ******************/
#define SDIO_PWRCTRL_PWRCTRL_Pos                                    (0U)
#define SDIO_PWRCTRL_PWRCTRL_Msk                                    (0x3UL << SDIO_PWRCTRL_PWRCTRL_Pos)                            /*!< 0x00000003 */
#define SDIO_PWRCTRL_PWRCTRL                                        SDIO_PWRCTRL_PWRCTRL_Msk                                       /*!<PWRCTRL[1:0] bits (Power supply control bits) */
#define SDIO_PWRCTRL_PWRCTRL_0                                      (0x1UL << SDIO_PWRCTRL_PWRCTRL_Pos)                            /*!< 0x01 */
#define SDIO_PWRCTRL_PWRCTRL_1                                      (0x2UL << SDIO_PWRCTRL_PWRCTRL_Pos)                            /*!< 0x02 */

/******************  Bit definition for SDIO_CLKCTRL register  ******************/
#define SDIO_CLKCTRL_CLKDIV_Pos                                     (0U)
#define SDIO_CLKCTRL_CLKDIV_Msk                                     (0xFFUL << SDIO_CLKCTRL_CLKDIV_Pos)                            /*!< 0x000000FF */
#define SDIO_CLKCTRL_CLKDIV                                         SDIO_CLKCTRL_CLKDIV_Msk                                        /*!<Clock divide factor             */
#define SDIO_CLKCTRL_CLKEN_Pos                                      (8U)
#define SDIO_CLKCTRL_CLKEN_Msk                                      (0x1UL << SDIO_CLKCTRL_CLKEN_Pos)                              /*!< 0x00000100 */
#define SDIO_CLKCTRL_CLKEN                                          SDIO_CLKCTRL_CLKEN_Msk                                         /*!<Clock enable bit                */
#define SDIO_CLKCTRL_PWRSAV_Pos                                     (9U)
#define SDIO_CLKCTRL_PWRSAV_Msk                                     (0x1UL << SDIO_CLKCTRL_PWRSAV_Pos)                             /*!< 0x00000200 */
#define SDIO_CLKCTRL_PWRSAV                                         SDIO_CLKCTRL_PWRSAV_Msk                                        /*!<Power saving configuration bit  */
#define SDIO_CLKCTRL_BYPASSEN_Pos                                   (10U)
#define SDIO_CLKCTRL_BYPASSEN_Msk                                   (0x1UL << SDIO_CLKCTRL_BYPASSEN_Pos)                           /*!< 0x00000400 */
#define SDIO_CLKCTRL_BYPASSEN                                       SDIO_CLKCTRL_BYPASSEN_Msk                                      /*!<Clock divider bypass enable bit */

#define SDIO_CLKCTRL_WBSEL_Pos                                      (11U)
#define SDIO_CLKCTRL_WBSEL_Msk                                      (0x3UL << SDIO_CLKCTRL_WBSEL_Pos)                              /*!< 0x00001800 */
#define SDIO_CLKCTRL_WBSEL                                          SDIO_CLKCTRL_WBSEL_Msk                                         /*!<WIDBUS[1:0] bits (Wide bus mode enable bit) */
#define SDIO_CLKCTRL_WBSEL_0                                        (0x1UL << SDIO_CLKCTRL_WBSEL_Pos)                              /*!< 0x0800 */
#define SDIO_CLKCTRL_WBSEL_1                                        (0x2UL << SDIO_CLKCTRL_WBSEL_Pos)                              /*!< 0x1000 */

#define SDIO_CLKCTRL_DEPSEL_Pos                                     (13U)
#define SDIO_CLKCTRL_DEPSEL_Msk                                     (0x1UL << SDIO_CLKCTRL_DEPSEL_Pos)                             /*!< 0x00002000 */
#define SDIO_CLKCTRL_DEPSEL                                         SDIO_CLKCTRL_DEPSEL_Msk                                        /*!<SDIO_CK dephasing selection bit */
#define SDIO_CLKCTRL_HFCEN_EN_Pos                                   (14U)
#define SDIO_CLKCTRL_HFCEN_EN_Msk                                   (0x1UL << SDIO_CLKCTRL_HFCEN_EN_Pos)                           /*!< 0x00004000 */
#define SDIO_CLKCTRL_HFCEN_EN                                       SDIO_CLKCTRL_HFCEN_EN_Msk                                      /*!<HW Flow Control enable          */

