betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f417xx.h
#define TMR_CCM1_OC2FEN_Pos                                         (10U)
#define TMR_CCM1_OC2FEN_Msk                                         (0x1UL << TMR_CCM1_OC2FEN_Pos)                                 /*!< 0x00000400 */
#define TMR_CCM1_OC2FEN                                             TMR_CCM1_OC2FEN_Msk                                            /*!<Output Compare 2 Fast enable                 */
#define TMR_CCM1_OC2PEN_Pos                                         (11U)
#define TMR_CCM1_OC2PEN_Msk                                         (0x1UL << TMR_CCM1_OC2PEN_Pos)                                 /*!< 0x00000800 */
#define TMR_CCM1_OC2PEN                                             TMR_CCM1_OC2PEN_Msk                                            /*!<Output Compare 2 Preload enable              */

#define TMR_CCM1_OC2MOD_Pos                                         (12U)
#define TMR_CCM1_OC2MOD_Msk                                         (0x7UL << TMR_CCM1_OC2MOD_Pos)                                 /*!< 0x00007000 */
#define TMR_CCM1_OC2MOD                                             TMR_CCM1_OC2MOD_Msk                                            /*!<OC2M[2:0] bits (Output Compare 2 Mode)       */
#define TMR_CCM1_OC2MOD_0                                           (0x1UL << TMR_CCM1_OC2MOD_Pos)                                 /*!< 0x1000 */
#define TMR_CCM1_OC2MOD_1                                           (0x2UL << TMR_CCM1_OC2MOD_Pos)                                 /*!< 0x2000 */
#define TMR_CCM1_OC2MOD_2                                           (0x4UL << TMR_CCM1_OC2MOD_Pos)                                 /*!< 0x4000 */

#define TMR_CCM1_OC2CEN_Pos                                         (15U)
#define TMR_CCM1_OC2CEN_Msk                                         (0x1UL << TMR_CCM1_OC2CEN_Pos)                                 /*!< 0x00008000 */
#define TMR_CCM1_OC2CEN                                             TMR_CCM1_OC2CEN_Msk                                            /*!<Output Compare 2 Clear Enable */

/*----------------------------------------------------------------------------*/

#define TMR_CCM1_IC1PSC_Pos                                         (2U)
#define TMR_CCM1_IC1PSC_Msk                                         (0x3UL << TMR_CCM1_IC1PSC_Pos)                                 /*!< 0x0000000C */
#define TMR_CCM1_IC1PSC                                             TMR_CCM1_IC1PSC_Msk                                            /*!<IC1PSC[1:0] bits (Input Capture 1 Prescaler) */
#define TMR_CCM1_IC1PSC_0                                           (0x1UL << TMR_CCM1_IC1PSC_Pos)                                 /*!< 0x0004 */
#define TMR_CCM1_IC1PSC_1                                           (0x2UL << TMR_CCM1_IC1PSC_Pos)                                 /*!< 0x0008 */

#define TMR_CCM1_IC1F_Pos                                           (4U)
#define TMR_CCM1_IC1F_Msk                                           (0xFUL << TMR_CCM1_IC1F_Pos)                                   /*!< 0x000000F0 */
#define TMR_CCM1_IC1F                                               TMR_CCM1_IC1F_Msk                                              /*!<IC1F[3:0] bits (Input Capture 1 Filter)      */
#define TMR_CCM1_IC1F_0                                             (0x1UL << TMR_CCM1_IC1F_Pos)                                   /*!< 0x0010 */
#define TMR_CCM1_IC1F_1                                             (0x2UL << TMR_CCM1_IC1F_Pos)                                   /*!< 0x0020 */
#define TMR_CCM1_IC1F_2                                             (0x4UL << TMR_CCM1_IC1F_Pos)                                   /*!< 0x0040 */
#define TMR_CCM1_IC1F_3                                             (0x8UL << TMR_CCM1_IC1F_Pos)                                   /*!< 0x0080 */

#define TMR_CCM1_IC2PSC_Pos                                         (10U)
#define TMR_CCM1_IC2PSC_Msk                                         (0x3UL << TMR_CCM1_IC2PSC_Pos)                                 /*!< 0x00000C00 */
#define TMR_CCM1_IC2PSC                                             TMR_CCM1_IC2PSC_Msk                                            /*!<IC2PSC[1:0] bits (Input Capture 2 Prescaler)  */
#define TMR_CCM1_IC2PSC_0                                           (0x1UL << TMR_CCM1_IC2PSC_Pos)                                 /*!< 0x0400 */
#define TMR_CCM1_IC2PSC_1                                           (0x2UL << TMR_CCM1_IC2PSC_Pos)                                 /*!< 0x0800 */

#define TMR_CCM1_IC2F_Pos                                           (12U)
#define TMR_CCM1_IC2F_Msk                                           (0xFUL << TMR_CCM1_IC2F_Pos)                                   /*!< 0x0000F000 */
#define TMR_CCM1_IC2F                                               TMR_CCM1_IC2F_Msk                                              /*!<IC2F[3:0] bits (Input Capture 2 Filter)       */
#define TMR_CCM1_IC2F_0                                             (0x1UL << TMR_CCM1_IC2F_Pos)                                   /*!< 0x1000 */
#define TMR_CCM1_IC2F_1                                             (0x2UL << TMR_CCM1_IC2F_Pos)                                   /*!< 0x2000 */
#define TMR_CCM1_IC2F_2                                             (0x4UL << TMR_CCM1_IC2F_Pos)                                   /*!< 0x4000 */
#define TMR_CCM1_IC2F_3                                             (0x8UL << TMR_CCM1_IC2F_Pos)                                   /*!< 0x8000 */

/******************  Bit definition for TMR_CCM2 register  *******************/
#define TMR_CCM2_CC3SEL_Pos                                         (0U)
#define TMR_CCM2_CC3SEL_Msk                                         (0x3UL << TMR_CCM2_CC3SEL_Pos)                                 /*!< 0x00000003 */
#define TMR_CCM2_CC3SEL                                             TMR_CCM2_CC3SEL_Msk                                            /*!<CC3S[1:0] bits (Capture/Compare 3 Selection)  */
#define TMR_CCM2_CC3SEL_0                                           (0x1UL << TMR_CCM2_CC3SEL_Pos)                                 /*!< 0x0001 */
#define TMR_CCM2_CC3SEL_1                                           (0x2UL << TMR_CCM2_CC3SEL_Pos)                                 /*!< 0x0002 */

#define TMR_CCM2_OC3FEN_Pos                                         (2U)
#define TMR_CCM2_OC3FEN_Msk                                         (0x1UL << TMR_CCM2_OC3FEN_Pos)                                 /*!< 0x00000004 */
#define TMR_CCM2_OC3FEN                                             TMR_CCM2_OC3FEN_Msk                                            /*!<Output Compare 3 Fast enable           */
#define TMR_CCM2_OC3PEN_Pos                                         (3U)
#define TMR_CCM2_OC3PEN_Msk                                         (0x1UL << TMR_CCM2_OC3PEN_Pos)                                 /*!< 0x00000008 */
#define TMR_CCM2_OC3PEN                                             TMR_CCM2_OC3PEN_Msk                                            /*!<Output Compare 3 Preload enable        */

#define TMR_CCM2_OC3MOD_Pos                                         (4U)
#define TMR_CCM2_OC3MOD_Msk                                         (0x7UL << TMR_CCM2_OC3MOD_Pos)                                 /*!< 0x00000070 */
#define TMR_CCM2_OC3MOD                                             TMR_CCM2_OC3MOD_Msk                                            /*!<OC3M[2:0] bits (Output Compare 3 Mode) */
#define TMR_CCM2_OC3MOD_0                                           (0x1UL << TMR_CCM2_OC3MOD_Pos)                                 /*!< 0x0010 */
#define TMR_CCM2_OC3MOD_1                                           (0x2UL << TMR_CCM2_OC3MOD_Pos)                                 /*!< 0x0020 */
#define TMR_CCM2_OC3MOD_2                                           (0x4UL << TMR_CCM2_OC3MOD_Pos)                                 /*!< 0x0040 */

#define TMR_CCM2_OC3CEN_Pos                                         (7U)
#define TMR_CCM2_OC3CEN_Msk                                         (0x1UL << TMR_CCM2_OC3CEN_Pos)                                 /*!< 0x00000080 */
#define TMR_CCM2_OC3CEN                                             TMR_CCM2_OC3CEN_Msk                                            /*!<Output Compare 3 Clear Enable */

#define TMR_CCM2_CC4SEL_Pos                                         (8U)
#define TMR_CCM2_CC4SEL_Msk                                         (0x3UL << TMR_CCM2_CC4SEL_Pos)                                 /*!< 0x00000300 */
#define TMR_CCM2_CC4SEL                                             TMR_CCM2_CC4SEL_Msk                                            /*!<CC4S[1:0] bits (Capture/Compare 4 Selection) */
#define TMR_CCM2_CC4SEL_0                                           (0x1UL << TMR_CCM2_CC4SEL_Pos)                                 /*!< 0x0100 */
#define TMR_CCM2_CC4SEL_1                                           (0x2UL << TMR_CCM2_CC4SEL_Pos)                                 /*!< 0x0200 */

#define TMR_CCM2_OC4FEN_Pos                                         (10U)
#define TMR_CCM2_OC4FEN_Msk                                         (0x1UL << TMR_CCM2_OC4FEN_Pos)                                 /*!< 0x00000400 */
#define TMR_CCM2_OC4FEN                                             TMR_CCM2_OC4FEN_Msk                                            /*!<Output Compare 4 Fast enable    */
#define TMR_CCM2_OC4PEN_Pos                                         (11U)
#define TMR_CCM2_OC4PEN_Msk                                         (0x1UL << TMR_CCM2_OC4PEN_Pos)                                 /*!< 0x00000800 */
#define TMR_CCM2_OC4PEN                                             TMR_CCM2_OC4PEN_Msk                                            /*!<Output Compare 4 Preload enable */

