betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f417xx.h
/* Bit definition for Ethernet MAC debug Register */
#define ETH_MACDBG_TXSTSFSTS_Pos                                    (25U)
#define ETH_MACDBG_TXSTSFSTS_Msk                                    (0x1UL << ETH_MACDBG_TXSTSFSTS_Pos)                            /*!< 0x02000000 */
#define ETH_MACDBG_TXSTSFSTS                                        ETH_MACDBG_TXSTSFSTS_Msk                                       /* Tx FIFO full                                                            */
#define ETH_MACDBG_TXFSTS_Pos                                       (24U)
#define ETH_MACDBG_TXFSTS_Msk                                       (0x1UL << ETH_MACDBG_TXFSTS_Pos)                               /*!< 0x01000000 */
#define ETH_MACDBG_TXFSTS                                           ETH_MACDBG_TXFSTS_Msk                                          /* Tx FIFO not empty                                                       */
#define ETH_MACDBG_TWCSTS_Pos                                       (22U)
#define ETH_MACDBG_TWCSTS_Msk                                       (0x1UL << ETH_MACDBG_TWCSTS_Pos)                               /*!< 0x00400000 */
#define ETH_MACDBG_TWCSTS                                           ETH_MACDBG_TWCSTS_Msk                                          /* Tx FIFO write active                                                    */
#define ETH_MACDBG_TRCSTS_Pos                                       (20U)
#define ETH_MACDBG_TRCSTS_Msk                                       (0x3UL << ETH_MACDBG_TRCSTS_Pos)                               /*!< 0x00300000 */
#define ETH_MACDBG_TRCSTS                                           ETH_MACDBG_TRCSTS_Msk                                          /* Tx FIFO read status mask                                                */
#define ETH_MACDBG_TRCSTS_WRITING_Pos                               (20U)
#define ETH_MACDBG_TRCSTS_WRITING_Msk                               (0x3UL << ETH_MACDBG_TRCSTS_WRITING_Pos)                       /*!< 0x00300000 */
#define ETH_MACDBG_TRCSTS_WRITING                                   ETH_MACDBG_TRCSTS_WRITING_Msk                                  /* Writing the received TxStatus or flushing the TxFIFO                    */
#define ETH_MACDBG_TRCSTS_WAITING_Pos                               (21U)
#define ETH_MACDBG_TRCSTS_WAITING_Msk                               (0x1UL << ETH_MACDBG_TRCSTS_WAITING_Pos)                       /*!< 0x00200000 */
#define ETH_MACDBG_TRCSTS_WAITING                                   ETH_MACDBG_TRCSTS_WAITING_Msk                                  /* Waiting for TxStatus from MAC transmitter                               */
#define ETH_MACDBG_TRCSTS_READ_Pos                                  (20U)
#define ETH_MACDBG_TRCSTS_READ_Msk                                  (0x1UL << ETH_MACDBG_TRCSTS_READ_Pos)                          /*!< 0x00100000 */
#define ETH_MACDBG_TRCSTS_READ                                      ETH_MACDBG_TRCSTS_READ_Msk                                     /* Read state (transferring data to the MAC transmitter)                   */
#define ETH_MACDBG_TRCSTS_IDLE                                      0x00000000U                                                    /* Idle state                                                              */
#define ETH_MACDBG_TXPAUSED_Pos                                     (19U)
#define ETH_MACDBG_TXPAUSED_Msk                                     (0x1UL << ETH_MACDBG_TXPAUSED_Pos)                             /*!< 0x00080000 */
#define ETH_MACDBG_TXPAUSED                                         ETH_MACDBG_TXPAUSED_Msk                                        /* MAC transmitter in pause                                                */
#define ETH_MACDBG_TFCSTS_Pos                                       (17U)
#define ETH_MACDBG_TFCSTS_Msk                                       (0x3UL << ETH_MACDBG_TFCSTS_Pos)                               /*!< 0x00060000 */
#define ETH_MACDBG_TFCSTS                                           ETH_MACDBG_TFCSTS_Msk                                          /* MAC transmit frame controller status mask                               */
#define ETH_MACDBG_TFCSTS_TRANSFERRING_Pos                          (17U)
#define ETH_MACDBG_TFCSTS_TRANSFERRING_Msk                          (0x3UL << ETH_MACDBG_TFCSTS_TRANSFERRING_Pos)                  /*!< 0x00060000 */
#define ETH_MACDBG_TFCSTS_TRANSFERRING                              ETH_MACDBG_TFCSTS_TRANSFERRING_Msk                             /* Transferring input frame for transmission                               */
#define ETH_MACDBG_TFCSTS_GENERATINGPCF_Pos                         (18U)
#define ETH_MACDBG_TFCSTS_GENERATINGPCF_Msk                         (0x1UL << ETH_MACDBG_TFCSTS_GENERATINGPCF_Pos)                 /*!< 0x00040000 */
#define ETH_MACDBG_TFCSTS_GENERATINGPCF                             ETH_MACDBG_TFCSTS_GENERATINGPCF_Msk                            /* Generating and transmitting a Pause control frame (in full duplex mode) */
#define ETH_MACDBG_TFCSTS_WAITING_Pos                               (17U)
#define ETH_MACDBG_TFCSTS_WAITING_Msk                               (0x1UL << ETH_MACDBG_TFCSTS_WAITING_Pos)                       /*!< 0x00020000 */
#define ETH_MACDBG_TFCSTS_WAITING                                   ETH_MACDBG_TFCSTS_WAITING_Msk                                  /* Waiting for Status of previous frame or IFG/backoff period to be over   */
#define ETH_MACDBG_TFCSTS_IDLE                                      0x00000000U                                                    /* Idle                                                                    */
#define ETH_MACDBG_TPESTS_Pos                                       (16U)
#define ETH_MACDBG_TPESTS_Msk                                       (0x1UL << ETH_MACDBG_TPESTS_Pos)                               /*!< 0x00010000 */
#define ETH_MACDBG_TPESTS                                           ETH_MACDBG_TPESTS_Msk                                          /* MAC MII transmit engine active                                          */
#define ETH_MACDBG_RXFSTS_Pos                                       (8U)
#define ETH_MACDBG_RXFSTS_Msk                                       (0x3UL << ETH_MACDBG_RXFSTS_Pos)                               /*!< 0x00000300 */
#define ETH_MACDBG_RXFSTS                                           ETH_MACDBG_RXFSTS_Msk                                          /* Rx FIFO fill level mask                                                 */
#define ETH_MACDBG_RXFSTS_FULL_Pos                                  (8U)
#define ETH_MACDBG_RXFSTS_FULL_Msk                                  (0x3UL << ETH_MACDBG_RXFSTS_FULL_Pos)                          /*!< 0x00000300 */
#define ETH_MACDBG_RXFSTS_FULL                                      ETH_MACDBG_RXFSTS_FULL_Msk                                     /* RxFIFO full                                                             */
#define ETH_MACDBG_RXFSTS_ABOVEFCT_Pos                              (9U)
#define ETH_MACDBG_RXFSTS_ABOVEFCT_Msk                              (0x1UL << ETH_MACDBG_RXFSTS_ABOVEFCT_Pos)                      /*!< 0x00000200 */
#define ETH_MACDBG_RXFSTS_ABOVEFCT                                  ETH_MACDBG_RXFSTS_ABOVEFCT_Msk                                 /* RxFIFO fill-level above flow-control activate threshold                 */
#define ETH_MACDBG_RXFSTS_BELOWFCT_Pos                              (8U)
#define ETH_MACDBG_RXFSTS_BELOWFCT_Msk                              (0x1UL << ETH_MACDBG_RXFSTS_BELOWFCT_Pos)                      /*!< 0x00000100 */
#define ETH_MACDBG_RXFSTS_BELOWFCT                                  ETH_MACDBG_RXFSTS_BELOWFCT_Msk                                 /* RxFIFO fill-level below flow-control de-activate threshold              */
#define ETH_MACDBG_RXFSTS_EMPTY                                     0x00000000U                                                    /* RxFIFO empty                                                            */
#define ETH_MACDBG_RRCSTS_Pos                                       (5U)
#define ETH_MACDBG_RRCSTS_Msk                                       (0x3UL << ETH_MACDBG_RRCSTS_Pos)                               /*!< 0x00000060 */
#define ETH_MACDBG_RRCSTS                                           ETH_MACDBG_RRCSTS_Msk                                          /* Rx FIFO read controller status mask                                     */
#define ETH_MACDBG_RRCSTS_FLUSHING_Pos                              (5U)
#define ETH_MACDBG_RRCSTS_FLUSHING_Msk                              (0x3UL << ETH_MACDBG_RRCSTS_FLUSHING_Pos)                      /*!< 0x00000060 */
#define ETH_MACDBG_RRCSTS_FLUSHING                                  ETH_MACDBG_RRCSTS_FLUSHING_Msk                                 /* Flushing the frame data and status                                      */
#define ETH_MACDBG_RRCSTS_STATUSREADING_Pos                         (6U)
#define ETH_MACDBG_RRCSTS_STATUSREADING_Msk                         (0x1UL << ETH_MACDBG_RRCSTS_STATUSREADING_Pos)                 /*!< 0x00000040 */
#define ETH_MACDBG_RRCSTS_STATUSREADING                             ETH_MACDBG_RRCSTS_STATUSREADING_Msk                            /* Reading frame status (or time-stamp)                                    */
#define ETH_MACDBG_RRCSTS_DATAREADING_Pos                           (5U)
#define ETH_MACDBG_RRCSTS_DATAREADING_Msk                           (0x1UL << ETH_MACDBG_RRCSTS_DATAREADING_Pos)                   /*!< 0x00000020 */
#define ETH_MACDBG_RRCSTS_DATAREADING                               ETH_MACDBG_RRCSTS_DATAREADING_Msk                              /* Reading frame data                                                      */
#define ETH_MACDBG_RRCSTS_IDLE                                      0x00000000U                                                    /* IDLE state                                                              */
#define ETH_MACDBG_RWCSTS_Pos                                       (4U)
#define ETH_MACDBG_RWCSTS_Msk                                       (0x1UL << ETH_MACDBG_RWCSTS_Pos)                               /*!< 0x00000010 */
#define ETH_MACDBG_RWCSTS                                           ETH_MACDBG_RWCSTS_Msk                                          /* Rx FIFO write controller active                                         */
#define ETH_MACDBG_RFCFCSTS_Pos                                     (1U)
#define ETH_MACDBG_RFCFCSTS_Msk                                     (0x3UL << ETH_MACDBG_RFCFCSTS_Pos)                             /*!< 0x00000006 */
#define ETH_MACDBG_RFCFCSTS                                         ETH_MACDBG_RFCFCSTS_Msk                                        /* MAC small FIFO read / write controllers status  mask                    */
#define ETH_MACDBG_RFCFCSTS_1                                       (0x2UL << ETH_MACDBG_RFCFCSTS_Pos)                             /*!< 0x00000004 */
#define ETH_MACDBG_RFCFCSTS_0                                       (0x1UL << ETH_MACDBG_RFCFCSTS_Pos)                             /*!< 0x00000002 */
#define ETH_MACDBG_RPESTS_Pos                                       (0U)
#define ETH_MACDBG_RPESTS_Msk                                       (0x1UL << ETH_MACDBG_RPESTS_Pos)                               /*!< 0x00000001 */
#define ETH_MACDBG_RPESTS                                           ETH_MACDBG_RPESTS_Msk                                          /* MAC MII receive protocol engine active                                  */

/* Bit definition for Ethernet MAC Status Register */
#define ETH_MACISTS_TSTS_Pos                                        (9U)
#define ETH_MACISTS_TSTS_Msk                                        (0x1UL << ETH_MACISTS_TSTS_Pos)                                /*!< 0x00000200 */
#define ETH_MACISTS_TSTS                                            ETH_MACISTS_TSTS_Msk                                           /* Time stamp trigger status */
#define ETH_MACISTS_MMCTXIS_Pos                                     (6U)
#define ETH_MACISTS_MMCTXIS_Msk                                     (0x1UL << ETH_MACISTS_MMCTXIS_Pos)                             /*!< 0x00000040 */
#define ETH_MACISTS_MMCTXIS                                         ETH_MACISTS_MMCTXIS_Msk                                        /* MMC transmit status       */
#define ETH_MACISTS_MMCRXIS_Pos                                     (5U)
#define ETH_MACISTS_MMCRXIS_Msk                                     (0x1UL << ETH_MACISTS_MMCRXIS_Pos)                             /*!< 0x00000020 */
#define ETH_MACISTS_MMCRXIS                                         ETH_MACISTS_MMCRXIS_Msk                                        /* MMC receive status        */
#define ETH_MACISTS_MMCIS_Pos                                       (4U)
#define ETH_MACISTS_MMCIS_Msk                                       (0x1UL << ETH_MACISTS_MMCIS_Pos)                               /*!< 0x00000010 */
#define ETH_MACISTS_MMCIS                                           ETH_MACISTS_MMCIS_Msk                                          /* MMC status                */
#define ETH_MACISTS_PMTIS_Pos                                       (3U)
#define ETH_MACISTS_PMTIS_Msk                                       (0x1UL << ETH_MACISTS_PMTIS_Pos)                               /*!< 0x00000008 */
#define ETH_MACISTS_PMTIS                                           ETH_MACISTS_PMTIS_Msk                                          /* PMT status                */

