betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f417xx.h
#define USB_OTG_HPORTCSTS_PSPDSEL_Pos                               (17U)
#define USB_OTG_HPORTCSTS_PSPDSEL_Msk                               (0x3UL << USB_OTG_HPORTCSTS_PSPDSEL_Pos)                       /*!< 0x00060000 */
#define USB_OTG_HPORTCSTS_PSPDSEL                                   USB_OTG_HPORTCSTS_PSPDSEL_Msk                                  /*!< Port speed                 */
#define USB_OTG_HPORTCSTS_PSPDSEL_0                                 (0x1UL << USB_OTG_HPORTCSTS_PSPDSEL_Pos)                       /*!< 0x00020000 */
#define USB_OTG_HPORTCSTS_PSPDSEL_1                                 (0x2UL << USB_OTG_HPORTCSTS_PSPDSEL_Pos)                       /*!< 0x00040000 */

/********************  Bit definition for USB_OTG_DOUT1MASK register  ********************/
#define USB_OTG_DOUT1MASK_TSFCMPM_Pos                               (0U)
#define USB_OTG_DOUT1MASK_TSFCMPM_Msk                               (0x1UL << USB_OTG_DOUT1MASK_TSFCMPM_Pos)                       /*!< 0x00000001 */
#define USB_OTG_DOUT1MASK_TSFCMPM                                   USB_OTG_DOUT1MASK_TSFCMPM_Msk                                  /*!< Transfer completed interrupt mask         */
#define USB_OTG_DOUT1MASK_EPDISM_Pos                                (1U)
#define USB_OTG_DOUT1MASK_EPDISM_Msk                                (0x1UL << USB_OTG_DOUT1MASK_EPDISM_Pos)                        /*!< 0x00000002 */
#define USB_OTG_DOUT1MASK_EPDISM                                    USB_OTG_DOUT1MASK_EPDISM_Msk                                   /*!< Endpoint disabled interrupt mask          */
#define USB_OTG_DOUT1MASK_TOM_Pos                                   (3U)
#define USB_OTG_DOUT1MASK_TOM_Msk                                   (0x1UL << USB_OTG_DOUT1MASK_TOM_Pos)                           /*!< 0x00000008 */
#define USB_OTG_DOUT1MASK_TOM                                       USB_OTG_DOUT1MASK_TOM_Msk                                      /*!< Timeout condition mask                    */
#define USB_OTG_DOUT1MASK_ITXEMPM_Pos                               (4U)
#define USB_OTG_DOUT1MASK_ITXEMPM_Msk                               (0x1UL << USB_OTG_DOUT1MASK_ITXEMPM_Pos)                       /*!< 0x00000010 */
#define USB_OTG_DOUT1MASK_ITXEMPM                                   USB_OTG_DOUT1MASK_ITXEMPM_Msk                                  /*!< IN token received when TxFIFO empty mask  */
#define USB_OTG_DOUT1MASK_IEPMMM_Pos                                (5U)
#define USB_OTG_DOUT1MASK_IEPMMM_Msk                                (0x1UL << USB_OTG_DOUT1MASK_IEPMMM_Pos)                        /*!< 0x00000020 */
#define USB_OTG_DOUT1MASK_IEPMMM                                    USB_OTG_DOUT1MASK_IEPMMM_Msk                                   /*!< IN token received with EP mismatch mask   */
#define USB_OTG_DOUT1MASK_IEPNAKEM_Pos                              (6U)
#define USB_OTG_DOUT1MASK_IEPNAKEM_Msk                              (0x1UL << USB_OTG_DOUT1MASK_IEPNAKEM_Pos)                      /*!< 0x00000040 */
#define USB_OTG_DOUT1MASK_IEPNAKEM                                  USB_OTG_DOUT1MASK_IEPNAKEM_Msk                                 /*!< IN endpoint NAK effective mask            */
#define USB_OTG_DOUT1MASK_FUDRM_Pos                                 (8U)
#define USB_OTG_DOUT1MASK_FUDRM_Msk                                 (0x1UL << USB_OTG_DOUT1MASK_FUDRM_Pos)                         /*!< 0x00000100 */
#define USB_OTG_DOUT1MASK_FUDRM                                     USB_OTG_DOUT1MASK_FUDRM_Msk                                    /*!< OUT packet error mask                     */
#define USB_OTG_DOUT1MASK_BNAM_Pos                                  (9U)
#define USB_OTG_DOUT1MASK_BNAM_Msk                                  (0x1UL << USB_OTG_DOUT1MASK_BNAM_Pos)                          /*!< 0x00000200 */
#define USB_OTG_DOUT1MASK_BNAM                                      USB_OTG_DOUT1MASK_BNAM_Msk                                     /*!< BNA interrupt mask                        */
#define USB_OTG_DOUT1MASK_BERRM_Pos                                 (12U)
#define USB_OTG_DOUT1MASK_BERRM_Msk                                 (0x1UL << USB_OTG_DOUT1MASK_BERRM_Pos)                         /*!< 0x00001000 */
#define USB_OTG_DOUT1MASK_BERRM                                     USB_OTG_DOUT1MASK_BERRM_Msk                                    /*!< Bubble error interrupt mask               */
#define USB_OTG_DOUT1MASK_NAKM_Pos                                  (13U)
#define USB_OTG_DOUT1MASK_NAKM_Msk                                  (0x1UL << USB_OTG_DOUT1MASK_NAKM_Pos)                          /*!< 0x00002000 */
#define USB_OTG_DOUT1MASK_NAKM                                      USB_OTG_DOUT1MASK_NAKM_Msk                                     /*!< NAK interrupt mask                        */
#define USB_OTG_DOUT1MASK_NYETM_Pos                                 (14U)
#define USB_OTG_DOUT1MASK_NYETM_Msk                                 (0x1UL << USB_OTG_DOUT1MASK_NYETM_Pos)                         /*!< 0x00004000 */
#define USB_OTG_DOUT1MASK_NYETM                                     USB_OTG_DOUT1MASK_NYETM_Msk                                    /*!< NYET interrupt mask                       */

/********************  Bit definition for USB_OTG_GHPTXFSIZE register  ********************/
#define USB_OTG_GHPTXFSIZE_HPDTXFSA_Pos                             (0U)
#define USB_OTG_GHPTXFSIZE_HPDTXFSA_Msk                             (0xFFFFUL << USB_OTG_GHPTXFSIZE_HPDTXFSA_Pos)                  /*!< 0x0000FFFF */
#define USB_OTG_GHPTXFSIZE_HPDTXFSA                                 USB_OTG_GHPTXFSIZE_HPDTXFSA_Msk                                /*!< Host periodic TxFIFO start address            */
#define USB_OTG_GHPTXFSIZE_HPDTXFDEP_Pos                            (16U)
#define USB_OTG_GHPTXFSIZE_HPDTXFDEP_Msk                            (0xFFFFUL << USB_OTG_GHPTXFSIZE_HPDTXFDEP_Pos)                 /*!< 0xFFFF0000 */
#define USB_OTG_GHPTXFSIZE_HPDTXFDEP                                USB_OTG_GHPTXFSIZE_HPDTXFDEP_Msk                               /*!< Host periodic TxFIFO depth                    */

/********************  Bit definition for USB_OTG_DIEPCTRL register  ********************/
#define USB_OTG_DIEPCTRL_MAXPS_Pos                                  (0U)
#define USB_OTG_DIEPCTRL_MAXPS_Msk                                  (0x7FFUL << USB_OTG_DIEPCTRL_MAXPS_Pos)                        /*!< 0x000007FF */
#define USB_OTG_DIEPCTRL_MAXPS                                      USB_OTG_DIEPCTRL_MAXPS_Msk                                     /*!< Maximum packet size              */
#define USB_OTG_DIEPCTRL_USBAEP_Pos                                 (15U)
#define USB_OTG_DIEPCTRL_USBAEP_Msk                                 (0x1UL << USB_OTG_DIEPCTRL_USBAEP_Pos)                         /*!< 0x00008000 */
#define USB_OTG_DIEPCTRL_USBAEP                                     USB_OTG_DIEPCTRL_USBAEP_Msk                                    /*!< USB active endpoint              */
#define USB_OTG_DIEPCTRL_EOF_PID_Pos                                (16U)
#define USB_OTG_DIEPCTRL_EOF_PID_Msk                                (0x1UL << USB_OTG_DIEPCTRL_EOF_PID_Pos)                        /*!< 0x00010000 */
#define USB_OTG_DIEPCTRL_EOF_PID                                    USB_OTG_DIEPCTRL_EOF_PID_Msk                                   /*!< Even/odd frame                   */
#define USB_OTG_DIEPCTRL_NAKSTS_Pos                                 (17U)
#define USB_OTG_DIEPCTRL_NAKSTS_Msk                                 (0x1UL << USB_OTG_DIEPCTRL_NAKSTS_Pos)                         /*!< 0x00020000 */
#define USB_OTG_DIEPCTRL_NAKSTS                                     USB_OTG_DIEPCTRL_NAKSTS_Msk                                    /*!< NAK status                       */

#define USB_OTG_DIEPCTRL_EPTYPE_Pos                                 (18U)
#define USB_OTG_DIEPCTRL_EPTYPE_Msk                                 (0x3UL << USB_OTG_DIEPCTRL_EPTYPE_Pos)                         /*!< 0x000C0000 */
#define USB_OTG_DIEPCTRL_EPTYPE                                     USB_OTG_DIEPCTRL_EPTYPE_Msk                                    /*!< Endpoint type                    */
#define USB_OTG_DIEPCTRL_EPTYPE_0                                   (0x1UL << USB_OTG_DIEPCTRL_EPTYPE_Pos)                         /*!< 0x00040000 */
#define USB_OTG_DIEPCTRL_EPTYPE_1                                   (0x2UL << USB_OTG_DIEPCTRL_EPTYPE_Pos)                         /*!< 0x00080000 */
#define USB_OTG_DIEPCTRL_STALLH_Pos                                 (21U)
#define USB_OTG_DIEPCTRL_STALLH_Msk                                 (0x1UL << USB_OTG_DIEPCTRL_STALLH_Pos)                         /*!< 0x00200000 */
#define USB_OTG_DIEPCTRL_STALLH                                     USB_OTG_DIEPCTRL_STALLH_Msk                                    /*!< STALL handshake                  */

