betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f417xx.h
/********************  Bit definition for USB_OTG_HCHINT register  ********************/
#define USB_OTG_HCHINT_TSFCMPN_Pos                                  (0U)
#define USB_OTG_HCHINT_TSFCMPN_Msk                                  (0x1UL << USB_OTG_HCHINT_TSFCMPN_Pos)                          /*!< 0x00000001 */
#define USB_OTG_HCHINT_TSFCMPN                                      USB_OTG_HCHINT_TSFCMPN_Msk                                     /*!< Transfer completed */
#define USB_OTG_HCHINT_TSFCMPAN_Pos                                 (1U)
#define USB_OTG_HCHINT_TSFCMPAN_Msk                                 (0x1UL << USB_OTG_HCHINT_TSFCMPAN_Pos)                         /*!< 0x00000002 */
#define USB_OTG_HCHINT_TSFCMPAN                                     USB_OTG_HCHINT_TSFCMPAN_Msk                                    /*!< Channel halted */
#define USB_OTG_HCHINT_AHBERR_Pos                                   (2U)
#define USB_OTG_HCHINT_AHBERR_Msk                                   (0x1UL << USB_OTG_HCHINT_AHBERR_Pos)                           /*!< 0x00000004 */
#define USB_OTG_HCHINT_AHBERR                                       USB_OTG_HCHINT_AHBERR_Msk                                      /*!< AHB error */
#define USB_OTG_HCHINT_RXSTALL_Pos                                  (3U)
#define USB_OTG_HCHINT_RXSTALL_Msk                                  (0x1UL << USB_OTG_HCHINT_RXSTALL_Pos)                          /*!< 0x00000008 */
#define USB_OTG_HCHINT_RXSTALL                                      USB_OTG_HCHINT_RXSTALL_Msk                                     /*!< STALL response received interrupt */
#define USB_OTG_HCHINT_RXNAK_Pos                                    (4U)
#define USB_OTG_HCHINT_RXNAK_Msk                                    (0x1UL << USB_OTG_HCHINT_RXNAK_Pos)                            /*!< 0x00000010 */
#define USB_OTG_HCHINT_RXNAK                                        USB_OTG_HCHINT_RXNAK_Msk                                       /*!< NAK response received interrupt */
#define USB_OTG_HCHINT_RXTXACK_Pos                                  (5U)
#define USB_OTG_HCHINT_RXTXACK_Msk                                  (0x1UL << USB_OTG_HCHINT_RXTXACK_Pos)                          /*!< 0x00000020 */
#define USB_OTG_HCHINT_RXTXACK                                      USB_OTG_HCHINT_RXTXACK_Msk                                     /*!< ACK response received/transmitted interrupt */
#define USB_OTG_HCHINT_RXNYET_Pos                                   (6U)
#define USB_OTG_HCHINT_RXNYET_Msk                                   (0x1UL << USB_OTG_HCHINT_RXNYET_Pos)                           /*!< 0x00000040 */
#define USB_OTG_HCHINT_RXNYET                                       USB_OTG_HCHINT_RXNYET_Msk                                      /*!< Response received interrupt */
#define USB_OTG_HCHINT_TERR_Pos                                     (7U)
#define USB_OTG_HCHINT_TERR_Msk                                     (0x1UL << USB_OTG_HCHINT_TERR_Pos)                             /*!< 0x00000080 */
#define USB_OTG_HCHINT_TERR                                         USB_OTG_HCHINT_TERR_Msk                                        /*!< Transaction error */
#define USB_OTG_HCHINT_BABBLE_Pos                                   (8U)
#define USB_OTG_HCHINT_BABBLE_Msk                                   (0x1UL << USB_OTG_HCHINT_BABBLE_Pos)                           /*!< 0x00000100 */
#define USB_OTG_HCHINT_BABBLE                                       USB_OTG_HCHINT_BABBLE_Msk                                      /*!< Babble error */
#define USB_OTG_HCHINT_FOVR_Pos                                     (9U)
#define USB_OTG_HCHINT_FOVR_Msk                                     (0x1UL << USB_OTG_HCHINT_FOVR_Pos)                             /*!< 0x00000200 */
#define USB_OTG_HCHINT_FOVR                                         USB_OTG_HCHINT_FOVR_Msk                                        /*!< Frame overrun */
#define USB_OTG_HCHINT_DTOG_Pos                                     (10U)
#define USB_OTG_HCHINT_DTOG_Msk                                     (0x1UL << USB_OTG_HCHINT_DTOG_Pos)                             /*!< 0x00000400 */
#define USB_OTG_HCHINT_DTOG                                         USB_OTG_HCHINT_DTOG_Msk                                        /*!< Data toggle error */

/********************  Bit definition for USB_OTG_DIEPINT register  ********************/
#define USB_OTG_DIEPINT_TSFCMP_Pos                                  (0U)
#define USB_OTG_DIEPINT_TSFCMP_Msk                                  (0x1UL << USB_OTG_DIEPINT_TSFCMP_Pos)                          /*!< 0x00000001 */
#define USB_OTG_DIEPINT_TSFCMP                                      USB_OTG_DIEPINT_TSFCMP_Msk                                     /*!< Transfer completed interrupt */
#define USB_OTG_DIEPINT_EPDIS_Pos                                   (1U)
#define USB_OTG_DIEPINT_EPDIS_Msk                                   (0x1UL << USB_OTG_DIEPINT_EPDIS_Pos)                           /*!< 0x00000002 */
#define USB_OTG_DIEPINT_EPDIS                                       USB_OTG_DIEPINT_EPDIS_Msk                                      /*!< Endpoint disabled interrupt */
#define USB_OTG_DIEPINT_AHBERR_Pos                                  (2U)
#define USB_OTG_DIEPINT_AHBERR_Msk                                  (0x1UL << USB_OTG_DIEPINT_AHBERR_Pos)                          /*!< 0x00000004 */
#define USB_OTG_DIEPINT_AHBERR                                      USB_OTG_DIEPINT_AHBERR_Msk                                     /*!< AHB Error (AHBErr) during an IN transaction */
#define USB_OTG_DIEPINT_TO_Pos                                      (3U)
#define USB_OTG_DIEPINT_TO_Msk                                      (0x1UL << USB_OTG_DIEPINT_TO_Pos)                              /*!< 0x00000008 */
#define USB_OTG_DIEPINT_TO                                          USB_OTG_DIEPINT_TO_Msk                                         /*!< Timeout condition */
#define USB_OTG_DIEPINT_ITXEMP_Pos                                  (4U)
#define USB_OTG_DIEPINT_ITXEMP_Msk                                  (0x1UL << USB_OTG_DIEPINT_ITXEMP_Pos)                          /*!< 0x00000010 */
#define USB_OTG_DIEPINT_ITXEMP                                      USB_OTG_DIEPINT_ITXEMP_Msk                                     /*!< IN token received when TxFIFO is empty */
#define USB_OTG_DIEPINT_IEPMM_Pos                                   (5U)
#define USB_OTG_DIEPINT_IEPMM_Msk                                   (0x1UL << USB_OTG_DIEPINT_IEPMM_Pos)                           /*!< 0x00000004 */
#define USB_OTG_DIEPINT_IEPMM                                       USB_OTG_DIEPINT_IEPMM_Msk                                      /*!< IN token received with EP mismatch */
#define USB_OTG_DIEPINT_IEPNAKE_Pos                                 (6U)
#define USB_OTG_DIEPINT_IEPNAKE_Msk                                 (0x1UL << USB_OTG_DIEPINT_IEPNAKE_Pos)                         /*!< 0x00000040 */
#define USB_OTG_DIEPINT_IEPNAKE                                     USB_OTG_DIEPINT_IEPNAKE_Msk                                    /*!< IN endpoint NAK effective */
#define USB_OTG_DIEPINT_TXFE_Pos                                    (7U)
#define USB_OTG_DIEPINT_TXFE_Msk                                    (0x1UL << USB_OTG_DIEPINT_TXFE_Pos)                            /*!< 0x00000080 */
#define USB_OTG_DIEPINT_TXFE                                        USB_OTG_DIEPINT_TXFE_Msk                                       /*!< Transmit FIFO empty */
#define USB_OTG_DIEPINT_TXFUDR_Pos                                  (8U)
#define USB_OTG_DIEPINT_TXFUDR_Msk                                  (0x1UL << USB_OTG_DIEPINT_TXFUDR_Pos)                          /*!< 0x00000100 */
#define USB_OTG_DIEPINT_TXFUDR                                      USB_OTG_DIEPINT_TXFUDR_Msk                                     /*!< Transmit Fifo Underrun */
#define USB_OTG_DIEPINT_BUFFNA_Pos                                  (9U)
#define USB_OTG_DIEPINT_BUFFNA_Msk                                  (0x1UL << USB_OTG_DIEPINT_BUFFNA_Pos)                          /*!< 0x00000200 */
#define USB_OTG_DIEPINT_BUFFNA                                      USB_OTG_DIEPINT_BUFFNA_Msk                                     /*!< Buffer not available interrupt */
#define USB_OTG_DIEPINT_PDROFLG_Pos                                 (11U)
#define USB_OTG_DIEPINT_PDROFLG_Msk                                 (0x1UL << USB_OTG_DIEPINT_PDROFLG_Pos)                         /*!< 0x00000800 */
#define USB_OTG_DIEPINT_PDROFLG                                     USB_OTG_DIEPINT_PDROFLG_Msk                                    /*!< Packet dropped status */
#define USB_OTG_DIEPINT_BERR_Pos                                    (12U)
#define USB_OTG_DIEPINT_BERR_Msk                                    (0x1UL << USB_OTG_DIEPINT_BERR_Pos)                            /*!< 0x00001000 */
#define USB_OTG_DIEPINT_BERR                                        USB_OTG_DIEPINT_BERR_Msk                                       /*!< Babble error interrupt */
#define USB_OTG_DIEPINT_NAK_Pos                                     (13U)
#define USB_OTG_DIEPINT_NAK_Msk                                     (0x1UL << USB_OTG_DIEPINT_NAK_Pos)                             /*!< 0x00002000 */
#define USB_OTG_DIEPINT_NAK                                         USB_OTG_DIEPINT_NAK_Msk                                        /*!< NAK interrupt */

