betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f417xx.h
/********************  Bit definition for USB_OTG_HCHIMASK register  ********************/
#define USB_OTG_HCHIMASK_TSFCMPNM_Pos                               (0U)
#define USB_OTG_HCHIMASK_TSFCMPNM_Msk                               (0x1UL << USB_OTG_HCHIMASK_TSFCMPNM_Pos)                       /*!< 0x00000001 */
#define USB_OTG_HCHIMASK_TSFCMPNM                                   USB_OTG_HCHIMASK_TSFCMPNM_Msk                                  /*!< Transfer completed mask */
#define USB_OTG_HCHIMASK_TSFCMPANM_Pos                              (1U)
#define USB_OTG_HCHIMASK_TSFCMPANM_Msk                              (0x1UL << USB_OTG_HCHIMASK_TSFCMPANM_Pos)                      /*!< 0x00000002 */
#define USB_OTG_HCHIMASK_TSFCMPANM                                  USB_OTG_HCHIMASK_TSFCMPANM_Msk                                 /*!< Channel halted mask */
#define USB_OTG_HCHIMASK_AHBERRM_Pos                                (2U)
#define USB_OTG_HCHIMASK_AHBERRM_Msk                                (0x1UL << USB_OTG_HCHIMASK_AHBERRM_Pos)                        /*!< 0x00000004 */
#define USB_OTG_HCHIMASK_AHBERRM                                    USB_OTG_HCHIMASK_AHBERRM_Msk                                   /*!< AHB error */
#define USB_OTG_HCHIMASK_RXSTALLM_Pos                               (3U)
#define USB_OTG_HCHIMASK_RXSTALLM_Msk                               (0x1UL << USB_OTG_HCHIMASK_RXSTALLM_Pos)                       /*!< 0x00000008 */
#define USB_OTG_HCHIMASK_RXSTALLM                                   USB_OTG_HCHIMASK_RXSTALLM_Msk                                  /*!< STALL response received interrupt mask */
#define USB_OTG_HCHIMASK_RXNAKM_Pos                                 (4U)
#define USB_OTG_HCHIMASK_RXNAKM_Msk                                 (0x1UL << USB_OTG_HCHIMASK_RXNAKM_Pos)                         /*!< 0x00000010 */
#define USB_OTG_HCHIMASK_RXNAKM                                     USB_OTG_HCHIMASK_RXNAKM_Msk                                    /*!< NAK response received interrupt mask */
#define USB_OTG_HCHIMASK_RXTXACKM_Pos                               (5U)
#define USB_OTG_HCHIMASK_RXTXACKM_Msk                               (0x1UL << USB_OTG_HCHIMASK_RXTXACKM_Pos)                       /*!< 0x00000020 */
#define USB_OTG_HCHIMASK_RXTXACKM                                   USB_OTG_HCHIMASK_RXTXACKM_Msk                                  /*!< ACK response received/transmitted interrupt mask */
#define USB_OTG_HCHIMASK_RXNYETM_Pos                                (6U)
#define USB_OTG_HCHIMASK_RXNYETM_Msk                                (0x1UL << USB_OTG_HCHIMASK_RXNYETM_Pos)                        /*!< 0x00000040 */
#define USB_OTG_HCHIMASK_RXNYETM                                    USB_OTG_HCHIMASK_RXNYETM_Msk                                   /*!< response received interrupt mask */
#define USB_OTG_HCHIMASK_TERRM_Pos                                  (7U)
#define USB_OTG_HCHIMASK_TERRM_Msk                                  (0x1UL << USB_OTG_HCHIMASK_TERRM_Pos)                          /*!< 0x00000080 */
#define USB_OTG_HCHIMASK_TERRM                                      USB_OTG_HCHIMASK_TERRM_Msk                                     /*!< Transaction error mask */
#define USB_OTG_HCHIMASK_BABBLEM_Pos                                (8U)
#define USB_OTG_HCHIMASK_BABBLEM_Msk                                (0x1UL << USB_OTG_HCHIMASK_BABBLEM_Pos)                        /*!< 0x00000100 */
#define USB_OTG_HCHIMASK_BABBLEM                                    USB_OTG_HCHIMASK_BABBLEM_Msk                                   /*!< Babble error mask */
#define USB_OTG_HCHIMASK_FOVRM_Pos                                  (9U)
#define USB_OTG_HCHIMASK_FOVRM_Msk                                  (0x1UL << USB_OTG_HCHIMASK_FOVRM_Pos)                          /*!< 0x00000200 */
#define USB_OTG_HCHIMASK_FOVRM                                      USB_OTG_HCHIMASK_FOVRM_Msk                                     /*!< Frame overrun mask */
#define USB_OTG_HCHIMASK_DTOGM_Pos                                  (10U)
#define USB_OTG_HCHIMASK_DTOGM_Msk                                  (0x1UL << USB_OTG_HCHIMASK_DTOGM_Pos)                          /*!< 0x00000400 */
#define USB_OTG_HCHIMASK_DTOGM                                      USB_OTG_HCHIMASK_DTOGM_Msk                                     /*!< Data toggle error mask */

/********************  Bit definition for USB_OTG_DIEPTRS register  ********************/

#define USB_OTG_DIEPTRS_EPTRS_Pos                                   (0U)
#define USB_OTG_DIEPTRS_EPTRS_Msk                                   (0x7FFFFUL << USB_OTG_DIEPTRS_EPTRS_Pos)                       /*!< 0x0007FFFF */
#define USB_OTG_DIEPTRS_EPTRS                                       USB_OTG_DIEPTRS_EPTRS_Msk                                      /*!< Transfer size */
#define USB_OTG_DIEPTRS_EPPCNT_Pos                                  (19U)
#define USB_OTG_DIEPTRS_EPPCNT_Msk                                  (0x3FFUL << USB_OTG_DIEPTRS_EPPCNT_Pos)                        /*!< 0x1FF80000 */
#define USB_OTG_DIEPTRS_EPPCNT                                      USB_OTG_DIEPTRS_EPPCNT_Msk                                     /*!< Packet count */
#define USB_OTG_DIEPTRS_TXDSEL_Pos                                  (29U)
#define USB_OTG_DIEPTRS_TXDSEL_Msk                                  (0x3UL << USB_OTG_DIEPTRS_TXDSEL_Pos)                          /*!< 0x60000000 */
#define USB_OTG_DIEPTRS_TXDSEL                                      USB_OTG_DIEPTRS_TXDSEL_Msk                                     /*!< Packet count */
/********************  Bit definition for USB_OTG_HCHTSIZE register  ********************/
#define USB_OTG_HCHTSIZE_TSFSIZE_Pos                                (0U)
#define USB_OTG_HCHTSIZE_TSFSIZE_Msk                                (0x7FFFFUL << USB_OTG_HCHTSIZE_TSFSIZE_Pos)                    /*!< 0x0007FFFF */
#define USB_OTG_HCHTSIZE_TSFSIZE                                    USB_OTG_HCHTSIZE_TSFSIZE_Msk                                   /*!< Transfer size */
#define USB_OTG_HCHTSIZE_PCKTCNT_Pos                                (19U)
#define USB_OTG_HCHTSIZE_PCKTCNT_Msk                                (0x3FFUL << USB_OTG_HCHTSIZE_PCKTCNT_Pos)                      /*!< 0x1FF80000 */
#define USB_OTG_HCHTSIZE_PCKTCNT                                    USB_OTG_HCHTSIZE_PCKTCNT_Msk                                   /*!< Packet count */
#define USB_OTG_HCHTSIZE_DO_PING_Pos                                (31U)
#define USB_OTG_HCHTSIZE_DO_PING_Msk                                (0x1UL << USB_OTG_HCHTSIZE_DO_PING_Pos)                        /*!< 0x80000000 */
#define USB_OTG_HCHTSIZE_DO_PING                                    USB_OTG_HCHTSIZE_DO_PING_Msk                                   /*!< Do PING */
#define USB_OTG_HCHTSIZE_DATAPID_Pos                                (29U)
#define USB_OTG_HCHTSIZE_DATAPID_Msk                                (0x3UL << USB_OTG_HCHTSIZE_DATAPID_Pos)                        /*!< 0x60000000 */
#define USB_OTG_HCHTSIZE_DATAPID                                    USB_OTG_HCHTSIZE_DATAPID_Msk                                   /*!< Data PID */
#define USB_OTG_HCHTSIZE_DATAPID_0                                  (0x1UL << USB_OTG_HCHTSIZE_DATAPID_Pos)                        /*!< 0x20000000 */
#define USB_OTG_HCHTSIZE_DATAPID_1                                  (0x2UL << USB_OTG_HCHTSIZE_DATAPID_Pos)                        /*!< 0x40000000 */

/********************  Bit definition for USB_OTG_DIEPDMA register  ********************/
#define USB_OTG_DIEPDMA_DMAADDR_Pos                                 (0U)
#define USB_OTG_DIEPDMA_DMAADDR_Msk                                 (0xFFFFFFFFUL << USB_OTG_DIEPDMA_DMAADDR_Pos)                  /*!< 0xFFFFFFFF */
#define USB_OTG_DIEPDMA_DMAADDR                                     USB_OTG_DIEPDMA_DMAADDR_Msk                                    /*!< DMA address */

